#### InvalidSlantedColumnOffsetsInNestedFamily Property

---

|  |
| --- |
| BuiltInFailures FamilyFailures Class   See Also |

Instance of family [Family Name] can't be updated because in nested family the column's base (Base Level + Base Offset) must be below its top (Top Level + Top Offset).

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId InvalidSlantedColumnOffsetsInNestedFamily { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property InvalidSlantedColumnOffsetsInNestedFamily As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ InvalidSlantedColumnOffsetsInNestedFamily { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures FamilyFailures Class

Autodesk.Revit.DB Namespace