#### EdgeHostedPointToBeUnhosted Property

---

|  |
| --- |
| BuiltInFailures PointFailures Class   See Also |

A point element in a family was hosted on an edge outside its family and the edge no longer exists. The point will remain placed but with no host.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId EdgeHostedPointToBeUnhosted { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property EdgeHostedPointToBeUnhosted As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ EdgeHostedPointToBeUnhosted { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures PointFailures Class

Autodesk.Revit.DB Namespace