#### SetLayoutAsSingle Method

---

|  |
| --- |
| RebarFreeFormAccessor Class   See Also |

Sets the Layout Rule property of rebar set to Single.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018

# Syntax

| C# |
| --- |
| ``` public void SetLayoutAsSingle() ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetLayoutAsSingle ``` |

| Visual C++ |
| --- |
| ``` public: void SetLayoutAsSingle() ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions DisabledDisciplineException | None of the following disciplines is enabled: Structural. |
| Autodesk.Revit.Exceptions InvalidOperationException | This RebarFreeFormAccessor doesn't contain a valid rebar reference. -or- This RebarFreeFormAccessor Rebar doesn't contain a valid server GUID. |

# See Also

RebarFreeFormAccessor Class

Autodesk.Revit.DB.Structure Namespace