#### ConfusingPadByElementsInMainModel Property

---

|  |
| --- |
| BuiltInFailures DesignOptionFailures Class   See Also |

A pad in a design option cannot be hosted by topography in the Main Model [--if you continue it will not be added to the design option set].

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId ConfusingPadByElementsInMainModel { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property ConfusingPadByElementsInMainModel As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ ConfusingPadByElementsInMainModel { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures DesignOptionFailures Class

Autodesk.Revit.DB Namespace