#### NetworkExtraPumpOutsideSet Property

---

|  |
| --- |
| BuiltInFailures MEPCalculationFailures Class   See Also |

Flow calculations do not calculate this pump together with the other pumps as one equipment set. Verify the flow distribution and add the pump to the equipment set, if desired.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 19.0.0.0 (19.0.0.405)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId NetworkExtraPumpOutsideSet { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property NetworkExtraPumpOutsideSet As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ NetworkExtraPumpOutsideSet { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures MEPCalculationFailures Class

Autodesk.Revit.DB Namespace