#### GetCellText Method

---

|  |
| --- |
| TableSectionData Class   See Also |

Returns the text shown by this cell, if the cell's type is CellType.Text or CellType.ParameterText.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)

# Syntax

| C# |
| --- |
| ``` public string GetCellText( 	int nRow, 	int nCol ) ``` |

| Visual Basic |
| --- |
| ``` Public Function GetCellText ( _ 	nRow As Integer, _ 	nCol As Integer _ ) As String ``` |

| Visual C++ |
| --- |
| ``` public: String^ GetCellText( 	int nRow,  	int nCol ) ``` |

#### Parameters

nRow
:   Type:  System Int32
     The cell row.

nCol
:   Type:  System Int32
     The cell column.

#### Return Value

The text in the cell, or an empty string if the type if not CellType.Text or CellType.ParameterText.

# Remarks

For standard view schedules, to read the formatted text of the cell regardless of cell type, use  [!:Autodesk::Revit::DB::ViewSchedule::GetCellText()]  .

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The given row number nRow is invalid. -or- The given column number nCol is invalid. |

# See Also

TableSectionData Class

Autodesk.Revit.DB Namespace