#### CannotOpenLinkedFileServerNotFound Property

---

|  |
| --- |
| BuiltInFailures LinkFailures Class   See Also |

Cannot open the linked model using Open and Unload because the plugin [name] cannot be accessed. Please check plugin [name], which has server Id [serverId]

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId CannotOpenLinkedFileServerNotFound { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CannotOpenLinkedFileServerNotFound As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ CannotOpenLinkedFileServerNotFound { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures LinkFailures Class

Autodesk.Revit.DB Namespace