#### BentFabricSheetManyLoopsInSketch Property

---

|  |
| --- |
| BuiltInFailures SketchFailures Class   See Also |

The bend profile cannot contain two or more disconnected segments. Click Continue to correct the profile or Click Quit sketching to exit the bend profile editor.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId BentFabricSheetManyLoopsInSketch { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property BentFabricSheetManyLoopsInSketch As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ BentFabricSheetManyLoopsInSketch { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures SketchFailures Class

Autodesk.Revit.DB Namespace