#### IFCCantUpdateLinkedFile Property

---

|  |
| --- |
| BuiltInFailures ImportFailures Class   See Also |

The cached version of this IFC file is already loaded into another document in this session, and can't be updated. To update the IFC file, please close all other documents containing the link, and then update.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId IFCCantUpdateLinkedFile { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property IFCCantUpdateLinkedFile As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ IFCCantUpdateLinkedFile { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures ImportFailures Class

Autodesk.Revit.DB Namespace