#### ConfusingSweepByElementsInDesignOptionWarn Property

---

|  |
| --- |
| BuiltInFailures DesignOptionFailures Class   See Also |

A sweep in the main model cannot be hosted by an element in a Design Option [--if you continue it will not be added to the design option set].

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId ConfusingSweepByElementsInDesignOptionWarn { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property ConfusingSweepByElementsInDesignOptionWarn As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ ConfusingSweepByElementsInDesignOptionWarn { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures DesignOptionFailures Class

Autodesk.Revit.DB Namespace