#### TooManyAreaBoundaryLinesFound Property

---

|  |
| --- |
| BuiltInFailures PerformanceFailures Class   See Also |

There are too many area boundary lines in area scheme <element> might result in increased model sizes on disk and in memory. Please investigate if area scheme is used in a proper way.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId TooManyAreaBoundaryLinesFound { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property TooManyAreaBoundaryLinesFound As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ TooManyAreaBoundaryLinesFound { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures PerformanceFailures Class

Autodesk.Revit.DB Namespace