#### IsSolid Method

---

|  |
| --- |
| ExternallyTaggedGeometryValidation Class   See Also |

Makes sure that the input geometry object is a Solid.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2022

# Syntax

| C# |
| --- |
| ``` public static bool IsSolid( 	GeometryObject geometry ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function IsSolid ( _ 	geometry As GeometryObject _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: static bool IsSolid( 	GeometryObject^ geometry ) ``` |

#### Parameters

geometry
:   Type:  Autodesk.Revit.DB GeometryObject
     Geometry object to be validated.

#### Return Value

True if the supplied geometry object is a Solid.

# See Also

ExternallyTaggedGeometryValidation Class

Autodesk.Revit.DB Namespace