#### GetParentHwnd Method

---

|  |
| --- |
| IFCExternalServiceUIData Class   See Also |

return the parent handle

**Namespace:**   Autodesk.Revit.UI
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2023

# Syntax

| C# |
| --- |
| ``` public IntPtr GetParentHwnd() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetParentHwnd As IntPtr ``` |

| Visual C++ |
| --- |
| ``` public: IntPtr GetParentHwnd() ``` |

# See Also

IFCExternalServiceUIData Class

Autodesk.Revit.UI Namespace