#### NotEnoughRoomForFittingsWarning Property

---

|  |
| --- |
| BuiltInFailures AutoRouteFailures Class   See Also |

There was not enough room to place the required fittings. Consider increasing the length of the segments, or moving them farther apart to generate a solution.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId NotEnoughRoomForFittingsWarning { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property NotEnoughRoomForFittingsWarning As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ NotEnoughRoomForFittingsWarning { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures AutoRouteFailures Class

Autodesk.Revit.DB Namespace