#### StairsBottomEndExceedsOrNotReachWarning Property

---

|  |
| --- |
| BuiltInFailures StairRampFailures Class   See Also |

Stair bottom end exceeds or cannot reach the base elevation of the stair. Add/remove risers at the bottom end or change base elevation settings in Stair Properties.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId StairsBottomEndExceedsOrNotReachWarning { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property StairsBottomEndExceedsOrNotReachWarning As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ StairsBottomEndExceedsOrNotReachWarning { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures StairRampFailures Class

Autodesk.Revit.DB Namespace