#### CannotPlaceSystemPanelsInOldArcedCurtainWalls Property

---

|  |
| --- |
| BuiltInFailures CurtainGridFamilyFailures Class   See Also |

Can't place System Panels in arced Curtain Walls created prior to 3.0, nor in straight Curtain Walls created prior to version 2.0.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId CannotPlaceSystemPanelsInOldArcedCurtainWalls { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CannotPlaceSystemPanelsInOldArcedCurtainWalls As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ CannotPlaceSystemPanelsInOldArcedCurtainWalls { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures CurtainGridFamilyFailures Class

Autodesk.Revit.DB Namespace