#### ConfusingSweepByElementsInAnotherDesignOptionWarn Property

---

|  |
| --- |
| BuiltInFailures DesignOptionFailures Class   See Also |

A sweep in a Design Option cannot be hosted by an element in another Design Option [--if you continue it will not be added to the design option set].

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId ConfusingSweepByElementsInAnotherDesignOptionWarn { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property ConfusingSweepByElementsInAnotherDesignOptionWarn As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ ConfusingSweepByElementsInAnotherDesignOptionWarn { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures DesignOptionFailures Class

Autodesk.Revit.DB Namespace