#### RunIsJoiningLandingWithRiserSoNotchDoesNotWorkWarning Property

---

|  |
| --- |
| BuiltInFailures StairRampFailures Class   See Also |

Run is joining landing with riser, so notch configuration does not take effect. Try to set run as begin/end with tread to make a notch.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId RunIsJoiningLandingWithRiserSoNotchDoesNotWorkWarning { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RunIsJoiningLandingWithRiserSoNotchDoesNotWorkWarning As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ RunIsJoiningLandingWithRiserSoNotchDoesNotWorkWarning { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures StairRampFailures Class

Autodesk.Revit.DB Namespace