#### CannotPlaceBoundaryConditions Property

---

|  |
| --- |
| BuiltInFailures StructuralLoadFailures Class   See Also |

A boundary condition is already created on the selected element. Duplicate boundary conditions are not allowed. Click the Replace button to delete previous definition of boundary condition or cancel the operation.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId CannotPlaceBoundaryConditions { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CannotPlaceBoundaryConditions As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ CannotPlaceBoundaryConditions { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures StructuralLoadFailures Class

Autodesk.Revit.DB Namespace