#### PipeSettings Members

---

|  |
| --- |
| PipeSettings Class   Methods   Properties   See Also |

The  PipeSettings  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | AddPipeSlope | Add a pipe slope value. |
| Public method | GetFlowConvertionServerInfo | Get the MEPServerInfo of the current plumbing flow convertion server. |
| Public method Static member | GetPipeSettings | Get the pipe settings of the project. |
| Public method | GetPipeSlopes | Get pipe slopes. |
| Public method | GetSpecificFittingAngles | Gets the list of specific fitting angles. |
| Public method | GetSpecificFittingAngleStatus | Gets the status of given specific angle. |
| Public method Static member | IsAnalysisForClosedLoopHydronicPipingNetworksEnabled | Indicates whether analysis for closed loop hydronic piping networks is enabled in the specified document. |
| Public method | IsValidSpecificFittingAngle | Checks that the given value is a valid specific fitting angle. The specific fitting angles are angles of 90, 60, 45, 30, 22.5 or 11.25 degrees. |
| Public method | SetFlowConvertionServerInfo | Set the MEPServerInfo of the current plumbing flow convertion server. |
| Public method | SetPipeSlopes | Set pipe slope values. |
| Public method | SetSpecificFittingAngleStatus | Sets the status of given specific angle. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | AnalysisForClosedLoopHydronicPipingNetworks | Indicates whether to enable analysis for closed loop hydronic piping networks. |
| Public property | Centerline | The abbreviation of the Centerline (=) string. |
| Public property | ConnectorSeparator | The connector separator string. |
| Public property | ConnectorTolerance | The connector tolerance value. |
| Public property | FittingAngleUsage | Determine how to use fitting angle during pipe layout or modifying layout. |
| Public property | FittingAnnotationSize | The value of fitting annotation size. |
| Public property | FlatOnBottom | The abbreviation of the Flat On Bottom (FOB) string. |
| Public property | FlatOnTop | The abbreviation of the Flat On Top (FOT) string. |
| Public property | SetDown | The abbreviation of the Set Down (SD) string. |
| Public property | SetDownFromBottom | The abbreviation of the Set Down from bottom of fitting (SDB) string. |
| Public property | SetUp | The abbreviation of the Set Up (SU) string. |
| Public property | SetUpFromBottom | The abbreviation of the Set Up from bottom of fitting(SUB) string. |
| Public property | SizePrefix | The size prefix string. |
| Public property | SizeSuffix | The size suffix string. |
| Public property | UseAnnotationScaleForSingleLineFittings | Indicates whether use annotation scale for single line fittings or not. |

# See Also

PipeSettings Class

Autodesk.Revit.DB.Plumbing Namespace