#### Alignment Members

---

|  |
| --- |
| Alignment Class   Methods   Properties   See Also |

The  Alignment  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Get(Element) | Returns an  Alignment  object given a Revit alignment element. |
| Public method Static member | Get(Document, Guid) | Returns an  Alignment  in the document given its GUID. |
| Public method Static member | GetAlignments(Document) | Returns all alignments in the given document. |
| Public method Static member | GetAlignments(View) | Returns all alignments visible in the given view. |
| Public method | GetClosestPoint | Calculates the point on the alignment's geometry which is closest to the given model point. |
| Public method | GetClosestStation | Calculates the alignment station closest to the given model point. |
| Public method | GetDisplayedHorizontalCurveEndpoints | Returns the endpoints of the alignment's horizontal curves. Only the points between  DisplayedStartStation  and  DisplayedEndStation  are returned. |
| Public method | GetDistance | Calculates the relative distance along the alignment between two stations based on their alignment distances according to Revit Internal Origin Coordinate Base. The distance may be positive or negative depending on the relative positions of the input stations on the alignment. |
| Public method | GetHCurveNormalAtStation | Calculate 2d (X and Y components of returned vector) horizontal normal at given station. |
| Public method | GetHCurveTangentAtStation | Calculate 2d (X and Y components of returned vector) horizontal tangent at given station. |
| Public method | GetPointAtStation | Calculates the model point for a given alignment station. |
| Public method | GetVCurveNormalAtStation | Calculate 2d (X and Y components of returned vector) vertical normal at given station. |
| Public method | GetVCurveTangentAtStation | Calculate 2d (X and Y components of returned vector) vertical tangent at given station. |
| Public method | IsValid | Checks if this object is a valid alignment. |
| Public method Static member | IsValid(Element) | Checks if the element is a valid alignment. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Description | The Description of this alignment. |
| Public property | DisplayedEndStation | Specifies the station at which the alignment's display ends, in Revit internal model units (standard Imperial feet). |
| Public property | DisplayedStartStation | Specifies the station at which the alignment's display starts, in Revit internal model units (standard Imperial feet). |
| Public property | Element | The underlying  DirectShape  element. |
| Public property | EndStation | Specifies the station at which the alignment's geometric definition ends, in Revit internal model units (standard Imperial feet). |
| Public property | GUID | The GUID of this alignment. |
| Public property | Name | The Name of this alignment. |
| Public property | StartStation | Specifies the station at which the alignment's geometric definition starts, in Revit internal model units (standard Imperial feet). |

# See Also

Alignment Class

Autodesk.Revit.DB.Infrastructure Namespace