#### KeynoteEntries Members

---

|  |
| --- |
| KeynoteEntries Class   Methods   Properties   See Also |

The  KeynoteEntries  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | LoadKeynoteEntriesFromFile | Loads the contents of a keynote text file into the provided KeyBasedTreeEntriesLoadContent. |

# Properties

|  | Name | Description |
| --- | --- | --- |

# See Also

KeynoteEntries Class

Autodesk.Revit.DB Namespace