#### RebarCoverType Members

---

|  |
| --- |
| RebarCoverType Class   Methods   Properties   See Also |

The  RebarCoverType  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create | Creates a new CoverType in the document. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | CoverDistance | A distance that can be used as a concrete cover value in a document. |

# See Also

RebarCoverType Class

Autodesk.Revit.DB.Structure Namespace