#### PrintSetting Members

---

|  |
| --- |
| PrintSetting Class   Methods   Properties   See Also |

The  PrintSetting  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Name | Returns the Name of Print Setup. (Overrides  Element Name  .) |
| Public property | PrintParameters | Returns the Parameters of Print Setup. |

# See Also

PrintSetting Class

Autodesk.Revit.DB Namespace