#### AreaBasedLoadType Members

---

|  |
| --- |
| AreaBasedLoadType Class   Methods   Properties   See Also |

The  AreaBasedLoadType  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create | Creates an area based load type. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | ApparentPowerDensity | The apparent power density of area based load type. |
| Public property | LoadClassification | The load classification of area based load type. |
| Public property | LoadDensity | The load density of area based load type. |
| Public property | PowerFactor | The power factor of area based load type. |

# See Also

AreaBasedLoadType Class

Autodesk.Revit.DB.Electrical Namespace