#### TaskDialogShowingEventArgs Members

---

|  |
| --- |
| TaskDialogShowingEventArgs Class   Methods   Properties   See Also |

The  TaskDialogShowingEventArgs  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Message | The message that has been displayed in the dialog box. |

# See Also

TaskDialogShowingEventArgs Class

Autodesk.Revit.UI.Events Namespace