#### IDuctFittingAndAccessoryPressureDropUIServer Members

---

|  |
| --- |
| IDuctFittingAndAccessoryPressureDropUIServer Interface   Methods   See Also |

The  IDuctFittingAndAccessoryPressureDropUIServer  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | GetDBServerId | Returns the Id of the corresponding DB server for which this server provides an optional UI. |
| Public method | ShowSettings | Shows the settings UI. |

# See Also

IDuctFittingAndAccessoryPressureDropUIServer Interface

Autodesk.Revit.UI.Mechanical Namespace