#### AssetPropertyDoubleMatrix44 Members

---

|  |
| --- |
| AssetPropertyDoubleMatrix44 Class   Methods   Properties   See Also |

The  AssetPropertyDoubleMatrix44  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Value | Get the value of the property |

# See Also

AssetPropertyDoubleMatrix44 Class

Autodesk.Revit.DB.Visual Namespace