#### MEPAnalyticalConnectionType Members

---

|  |
| --- |
| MEPAnalyticalConnectionType Class   Methods   Properties   See Also |

The  MEPAnalyticalConnectionType  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create | Creates an analytical connection type element. |
| Public method Static member | FindTypeByName | Finds the analytical connection type by its name. |
| Public method Static member | IsNameUnused | Checks if this is an unused name. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | PressureLoss | The pressure loss of this analytical connection type. |

# See Also

MEPAnalyticalConnectionType Class

Autodesk.Revit.DB Namespace