#### SlabShapeVertex Members

---

|  |
| --- |
| SlabShapeVertex Class   Methods   Properties   See Also |

The  SlabShapeVertex  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Position | The position of the vertex. |
| Public property | VertexType | The type of the vertex. |

# See Also

SlabShapeVertex Class

Autodesk.Revit.DB Namespace