#### GenericZone Members

---

|  |
| --- |
| GenericZone Class   Methods   Properties   See Also |

The  GenericZone  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create | Creates a new instance of a generic zone and adds it to the document. |
| Public method | GetBoundaries | Gets the boundaries for the generic zone. |
| Public method | GetDomainData | Gets the domain data for the generic zone. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | LevelOffset | The offset distance from this zone to the associated level. |

# See Also

GenericZone Class

Autodesk.Revit.DB.Analysis Namespace