#### PipeFittingAndAccessoryConnectorData Members

---

|  |
| --- |
| PipeFittingAndAccessoryConnectorData Class   Methods   Properties   See Also |

The  PipeFittingAndAccessoryConnectorData  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  PipeFittingAndAccessoryConnectorData |
| Public method | GetCoordination | Gets the coordination of the connector |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Angle | The angle of the fitting, Units:(rad). |
| Public property | Diameter | The connector diameter, Units:(ft). |
| Public property | Flow | The connector flow, Units:(ftÂ³/s) |
| Public property | FlowDirection | The flow direction of this connector, In or Out. |
| Public property | Height | The connector height, Units:(ft). |
| Public property | Index | Return the index of this connector |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | LinkIndex | The index of the connector which is linked with this connector |
| Public property | Profile | The connector profile. |
| Public property | VelocityPressure | The connector velocity pressure. Units: (kg/(ftÂ·sÂ²)). |
| Public property | Width | The connector width, Units:(ft). |

# See Also

PipeFittingAndAccessoryConnectorData Class

Autodesk.Revit.DB.Plumbing Namespace