#### Plane Members

---

|  |
| --- |
| Plane Class   Methods   Properties   See Also |

The  Plane  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create | Creates a Plane object defined by a local frame of reference. |
| Public method Static member | CreateByNormalAndOrigin | Constructs a Plane object from a normal and an origin represented as XYZ objects. Follows the standard conventions for a planar surface. The constructed Plane object will pass through origin and be perpendicular to normal. The X and Y axes of the plane will be defined arbitrarily. |
| Public method Static member | CreateByOriginAndBasis | Creates a Plane object defined by the two orthogonal unit vectors and passing through the origin point supplied as arguments. |
| Public method Static member | CreateByThreePoints | Creates a Plane object passing through three points supplied as arguments. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Normal | Plane normal. |
| Public property | Origin | Plane origin. |
| Public property | XVec | Axis defining the first parametric direction of the plane. |
| Public property | YVec | Axis defining the second parametric direction of the plane. |

# See Also

Plane Class

Autodesk.Revit.DB Namespace