#### CircuitNamingScheme Members

---

|  |
| --- |
| CircuitNamingScheme Class   Methods   Properties   See Also |

The  CircuitNamingScheme  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create | Creates a new CircuitNamingScheme. |
| Public method | GetCombinedParameters | Gets the combined parameters. |
| Public method Static member | IsNameUnique | Validates whether the CircuitNamingScheme name is unique in document. |
| Public method Static member | IsValidCombinedParameters | Validates whether the combined parameters is valid. |
| Public method | SetCombinedParameters | Sets combined parameters array. |

# Properties

|  | Name | Description |
| --- | --- | --- |

# See Also

CircuitNamingScheme Class

Autodesk.Revit.DB.Electrical Namespace