#### RevitLinkInstance Members

---

|  |
| --- |
| RevitLinkInstance Class   Methods   Properties   See Also |

The  RevitLinkInstance  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create(Document, ElementId) | Creates a new instance of a linked Revit project (RevitLinkType). |
| Public method Static member | Create(Document, ElementId, ImportPlacement) | Creates a new instance of a linked Revit project (RevitLinkType). |
| Public method | GetLinkDocument | The document associated with the Revit link. |
| Public method | MoveBasePointToHostBasePoint | Moves this link instance so that the base point in the linked document is aligned to the base point in the host document. This is a one-time movement and does not set up any shared coordinates relationship.  If the rotation angle of this link instance was changed after insertion, the rotation angle can be preserved or reset to the original insertion angle. |
| Public method | MoveOriginToHostOrigin | Moves this link instance so that the internal origin of the linked document is aligned to the internal origin of the host document. This is a one-time movement and does not set up any shared coordinates relationship.  If the rotation angle of the link instance was changed after insertion, the rotation angle can be preserved or reset to the original insertion angle. |

# Properties

|  | Name | Description |
| --- | --- | --- |

# See Also

RevitLinkInstance Class

Autodesk.Revit.DB Namespace