#### AlignmentStationLabel Members

---

|  |
| --- |
| AlignmentStationLabel Class   Methods   Properties   See Also |

The  AlignmentStationLabel  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create | Creates an  AlignmentStationLabel  object along with its underlying  SpotDimension  element. Returns null if element creation fails. |
| Public method Static member | CreateRecommendedTypeForSet | Creates an element type recommended for alignment label sets and returns its ElementId. |
| Public method Static member | CreateSet | Creates a collection of  AlignmentStationLabel  objects along with their underlying  SpotDimension  elements. |
| Public method Static member | Get | Returns an  AlignmentStationLabel  object for the given element. |
| Public method Static member | GetAlignmentStationLabels(Alignment) | Returns all alignment station labels placed on the given alignment. |
| Public method Static member | GetAlignmentStationLabels(Alignment, ElementId) | Returns all alignment station labels placed on the given alignment in the given view. |
| Public method Static member | IsRecommendedTypeForSet | Checks if the element type is recommended for alignment labels in sets. |
| Public method | IsValid | Checks if this object is a valid alignment station label. |
| Public method Static member | IsValid(Element) | Checks if the element is a valid alignment station label. |
| Public method Static member | IsValidType | Checks if the type is a valid alignment station label type. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | AlignmentId | The ElementId of the  Alignment  on which the  SpotDimension  is placed. |
| Public property | Element | The underlying  SpotDimension  element. |
| Public property | Station | The alignment station at which the  SpotDimension  is placed. |

# See Also

AlignmentStationLabel Class

Autodesk.Revit.DB.Infrastructure Namespace