#### ParameterValue Members

---

|  |
| --- |
| ParameterValue Class   Methods   Properties   See Also |

The  ParameterValue  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Copy | Makes an identical copy of the given parameter value. |
| Public method | Dispose | Releases all resources used by the  ParameterValue |
| Public method | IsEqual | Tests equality with another instance of the same class. |
| Public method | IsSameType | Tests another instance is of the same value type. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

ParameterValue Class

Autodesk.Revit.DB Namespace