#### FileDialog Members

---

|  |
| --- |
| FileDialog Class   Methods   Properties   See Also |

The  FileDialog  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  FileDialog |
| Public method | GetSelectedModelPath | Returns the selected file path chosen by the user. |
| Public method Static member | IsValidFilterString | Determines if the input string is acceptable as input for a FileDialog filter string. |
| Public method | Show | Shows the dialog using the stored settings. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | DefaultFilterEntry | The default entry (from the filter) to be selected in the dialog. |
| Public property | Filter | The filter string representing a collection of extensions allowed by the dialog. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | Title | The title to show on the dialog. |

# See Also

FileDialog Class

Autodesk.Revit.UI Namespace