#### WorksetDefaultVisibilitySettings Members

---

|  |
| --- |
| WorksetDefaultVisibilitySettings Class   Methods   Properties   See Also |

The  WorksetDefaultVisibilitySettings  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | GetWorksetDefaultVisibilitySettings | Get the WorksetDefaultVisibilitySettings of the document. |
| Public method | IsWorksetVisible | Indicates whether the workset is visible by default. |
| Public method | SetWorksetVisibility | Set the default visibility of a workset. |

# Properties

|  | Name | Description |
| --- | --- | --- |

# See Also

WorksetDefaultVisibilitySettings Class

Autodesk.Revit.DB Namespace