#### CanExecuteEventArgs Members

---

|  |
| --- |
| CanExecuteEventArgs Class   Methods   Properties   See Also |

The  CanExecuteEventArgs  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | GetSelectedCategoryIds | Gets the category ids of selected elements. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | CanExecute | The value that indicates whether the Command associated with this event can be executed. |
| Public property | IsChecked | The value that indicates whether the UI associated with the Command associated with this event is in a checked state. |

# See Also

CanExecuteEventArgs Class

Autodesk.Revit.UI.Events Namespace