#### SpatialElementCalculationPoint Members

---

|  |
| --- |
| SpatialElementCalculationPoint Class   Methods   Properties   See Also |

The  SpatialElementCalculationPoint  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Position | The position of the "in" spatial element calculation point. |

# See Also

SpatialElementCalculationPoint Class

Autodesk.Revit.DB Namespace