#### AssetPropertyDoubleArray3d Members

---

|  |
| --- |
| AssetPropertyDoubleArray3d Class   Methods   Properties   See Also |

The  AssetPropertyDoubleArray3d  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | GetValueAsDoubles | Get the value property as doubles. |
| Public method | GetValueAsXYZ | Get the value property as a vector or point XYZ. |
| Public method | IsValidValue | Checks that the value is a valid value for this property. |
| Public method | SetValueAsXYZ | Sets the value property as a vector or point XYZ. |

# Properties

|  | Name | Description |
| --- | --- | --- |

# See Also

AssetPropertyDoubleArray3d Class

Autodesk.Revit.DB.Visual Namespace