#### FolderItemInfo Members

---

|  |
| --- |
| FolderItemInfo Class   Methods   Properties   See Also |

The  FolderItemInfo  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  FolderItemInfo |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | ElementId | The folder parameter Id |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | Name | The folder name |

# See Also

FolderItemInfo Class

Autodesk.Revit.DB Namespace