#### LinePatternElement Members

---

|  |
| --- |
| LinePatternElement Class   Methods   Properties   See Also |

The  LinePatternElement  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create | Creates a new LinePatternElement. |
| Public method | GetLinePattern | Gets the LinePattern associated to this element. |
| Public method Static member | GetLinePattern(Document, ElementId) | Gets the LinePattern associated to an element or from a built-in line pattern. |
| Public method Static member | GetLinePatternElementByName | Retrieves the LinePatternElement by its name. |
| Public method Static member | GetSolidPatternId | Gets the solid line pattern element id. |
| Public method | SetLinePattern | Sets the LinePattern associated to this element. |

# Properties

|  | Name | Description |
| --- | --- | --- |

# See Also

LinePatternElement Class

Autodesk.Revit.DB Namespace