#### LevelAssociationData Members

---

|  |
| --- |
| LevelAssociationData Class   Methods   Properties   See Also |

The  LevelAssociationData  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  LevelAssociationData |
| Public method | GetAssociatedLevel | Returns the Associated Level id. |
| Public method Static member | GetLevelAssociationData | Returns LevelAssociationData associated with this element, if it exists. |
| Public method | GetLevelOffset | Returns the offset from the Associated Level. |
| Public method | SetAssociatedLevel | Sets the Associated Level. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

LevelAssociationData Class

Autodesk.Revit.DB Namespace