#### FaceEdgeNode Members

---

|  |
| --- |
| FaceEdgeNode Class   Methods   Properties   See Also |

The  FaceEdgeNode  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | GetFaceEdge | Returns the Face edge object corresponding to the node. |

# Properties

|  | Name | Description |
| --- | --- | --- |

# See Also

FaceEdgeNode Class

Autodesk.Revit.DB Namespace