#### RebarConstraintsManager Members

---

|  |
| --- |
| RebarConstraintsManager Class   Methods   Properties   See Also |

The  RebarConstraintsManager  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | AllowConstraintTargets | Returns true if references are valid targets for handle, false otherwise. |
| Public method | ApplyRebarConstraints | Returns true if constraints were applied to rebar with success. |
| Public method | ClearHandleConstraintPairHighlighting | Clears all highlighting in all views. |
| Public method | Dispose | Releases all resources used by the  RebarConstraintsManager |
| Public method | GetAllConstrainedHandles | Retrieves all handles on the Rebar that are constrained to external references. |
| Public method | GetAllHandles | Gets all RebarConstrainedHandles of this bar. |
| Public method | GetConstraintCandidatesForHandle(RebarConstrainedHandle) | For shape driven rebar returns all possible RebarConstraints that could be used for a specified RebarConstrainedHandle.  For free form rebar will return an empty list. |
| Public method | GetConstraintCandidatesForHandle(RebarConstrainedHandle, ElementId) | For shape driven rebar returns all possible RebarConstraints belonging to references from the provided element that could be used for a specified RebarConstrainedHandle.  For free form rebar will return an empty list. |
| Public method | GetConstraintCandidatesForHandle(RebarConstrainedHandle, Reference) | For shape driven rebar returns all possible RebarConstraints that will constrain RebarConstrainedHandle to the provided reference.  For free form rebar will return an empty lists. |
| Public method | GetCurrentConstraintOnHandle | Retrieves the RebarConstraint that acts on the specified RebarConstraintHandle. |
| Public method | GetPreferredConstraintOnHandle | For ShapeDriven: Returns the RebarConstraint that has been set as preferred for the specified RebarConstrainedHandle.  For FreeForm: Returns the RebarConstraint that acts on the specified RebarConstraintHandle. |
| Public method | HasValidRebar | Checks whether the Manager's Rebar is still valid. |
| Public method | HighlightHandleConstraintPairInAllViews | Highlights the specified RebarConstrainedHandle and RebarConstraint in all views. |
| Public method | RemovePreferredConstraintFromHandle | For ShapeDriven: Clears the user-preferred RebarConstraint from the specified RebarConstrainedHandle.  For FreeForm: Removes the RebarConstraint that is associated to the specified RebarConstrainedHandle. |
| Public method | SetPreferredConstraintForHandle | For ShapeDriven Rebar: Sets the RebarConstraint as preferred constraint target for the specified RebarConstrainedHandle.  For FreeForm Rebar: Sets the RebarConstraint as the target for the specified RebarConstraintHandle. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | IsRebarConstrainedPlacementEnabled | A static property defining if the 'Rebar Constrained Placement' setting is on or off in current Revit Application Session. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

RebarConstraintsManager Class

Autodesk.Revit.DB.Structure Namespace