#### FilledRegionType Members

---

|  |
| --- |
| FilledRegionType Class   Methods   Properties   See Also |

The  FilledRegionType  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | IsValidLineWeight | Indicates whether the given line weight value is valid. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | BackgroundPatternColor | The background fill pattern color. |
| Public property | BackgroundPatternId | The background fill pattern Id. |
| Public property | ForegroundPatternColor | The foreground fill pattern color. |
| Public property | ForegroundPatternId | The foreground fill pattern Id. |
| Public property | IsMasking | If true then the FilledRegion will cover the lines and edges of objects behind it. If false then lines and edges will remain visible. |
| Public property | LineWeight | The line weight of the fill pattern. |

# See Also

FilledRegionType Class

Autodesk.Revit.DB Namespace