#### Definition Members

---

|  |
| --- |
| Definition Class   Methods   Properties   See Also |

The  Definition  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | GetDataType | Gets a ForgeTypeId identifying the data type describing values of the parameter. |
| Public method | GetGroupTypeId | Returns the identifier of the parameter definition's parameter group. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Name | The user visible name for the parameter. |
| Public property | ParameterGroup | Returns the group ID of the parameter definition. |

# See Also

Definition Class

Autodesk.Revit.DB Namespace