#### AssetProperty Members

---

|  |
| --- |
| AssetProperty Class   Methods   Properties   See Also |

The  AssetProperty  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | AddConnectedAsset | Adds a new connected asset attached to this asset property, if it allows it. |
| Public method | AddCopyAsConnectedAsset | Makes a copy of the asset and connects it to this property. |
| Public method | Dispose | Releases all resources used by the  AssetProperty |
| Public method | GetAllConnectedProperties | Gets the list of the connected properties. Connected properties are the detachable properties of an AssetProperty. e.g. diffuse property can have texture as its connected property. It can also detach texture on runtime. |
| Public method | GetConnectedProperty | Gets one connected property with specified index. |
| Public method | GetSingleConnectedAsset | Gets the single connected asset attached to this asset property, if it exists. |
| Public method Static member | GetTypeName | Get the name of the AssetProperty |
| Public method | IsEditable | Check if property can be edited. |
| Public method | IsValidSchemaIdentifier | Check that schema name is valid |
| Public method | RemoveConnectedAsset | Removes the connected asset attached to this asset property if any. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsReadOnly | Identifies if the object is read-only or modifiable. If true, the object may not be modified. If false, the object's contents may be modified. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | Name | Get the name of the AssetProperty |
| Public property | NumberOfConnectedProperties | The number of currently connected properties. |
| Public property | Type | Returns the type of the AssetProperty |

# See Also

AssetProperty Class

Autodesk.Revit.DB.Visual Namespace