#### RadialArray Members

---

|  |
| --- |
| RadialArray Class   Methods   Properties   See Also |

The  RadialArray  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | ArrayElementsWithoutAssociation | Creates a new radial array from a set of elements based on an input rotation axis. |
| Public method Static member | ArrayElementWithoutAssociation | Creates a new radial array from a single element based on an input rotation axis. |
| Public method Static member | Create(Document, View, ElementId, Int32, Line, Double, ArrayAnchorMember) | Creates a new radial array element from a single element based on an input rotation axis. |
| Public method Static member | Create(Document, View, ICollection ElementId , Int32, Line, Double, ArrayAnchorMember) | Creates a new radial array element from a set of elements based on an input rotation axis. |
| Public method | GetCopiedMemberIds | Retrieves the copied member Ids of the Array. (Overrides  BaseArray GetCopiedMemberIds  .) |
| Public method | GetOriginalMemberIds | Retrieves the original member Ids of the Array. (Overrides  BaseArray GetOriginalMemberIds  .) |
| Public method Static member | IsRotationAngleValid | This indicates whether the input angle is valid. |
| Public method Static member | IsValidArraySize | This indicates whether the input count is valid. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | NumMembers | Retrieves or changes the number of the arrayed members. (Overrides  BaseArray NumMembers  .) |

# See Also

RadialArray Class

Autodesk.Revit.DB Namespace