#### ReinforcementSettings Members

---

|  |
| --- |
| ReinforcementSettings Class   Methods   Properties   See Also |

The  ReinforcementSettings  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | GetFabricRoundingManager | Returns an object for managing reinforcement rounding override settings used by FabricSheetType and FabricSheet elements. |
| Public method | GetRebarRoundingManager | Returns an object for managing reinforcement rounding override settings used by RebarBarTypes, Rebar and RebarInSystem elements. |
| Public method | GetReinforcementAbbreviationTag | Gets one abbreviation tag for desired ReinforcementAbbreviationTagType. |
| Public method | GetReinforcementAbbreviationTags | Gets a list of abbreviation tags for desired reinforcement object type. |
| Public method Static member | GetReinforcementSettings | Obtains the ReinforcementSettings object for the specified project document. |
| Public method | IsEqual | Checks if Reinforcement Settings is equal to other |
| Public method | SetReinforcementAbbreviationTag | Sets one abbreviation tag for desired ReinforcementAbbreviationTagType. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | HostStructuralRebar | Host Structural Rebar within Area and Path Reinforcement with touching AtomHostStructuralRebar. |
| Public property | NumberVaryingLengthRebarsIndividually | Use this option to modify the way varying length bars are numbered (individually or as a whole). |
| Public property | RebarPresentationInSection | The default presentation mode for rebar sets, when:  * The view direction is perpendicular to the rebar normal and the rebar set is cut. * The view direction is not perpendicular to the rebar normal and the view direction is not parallel to the rebar normal. |
| Public property | RebarPresentationInView | The default presentation mode for rebar sets, when the view direction is perpendicular to the rebar normal and the rebar set is not cut. |
| Public property | RebarShapeDefinesEndTreatments | End Treatments are defined by Rebar Shape of Rebar element. Can be changed if document contains no rebars, area reinforcements and path reinforcements. |
| Public property | RebarShapeDefinesHooks | Hooks are defined by Rebar Shape of Rebar element. Can be changed if document contains no rebars, area reinforcements and path reinforcements. |
| Public property | RebarVaryingLengthNumberSuffix | A unique identifier used for a bar within a variable length rebar set. |

# See Also

ReinforcementSettings Class

Autodesk.Revit.DB.Structure Namespace