#### SystemZoneData Members

---

|  |
| --- |
| SystemZoneData Class   Methods   Properties   See Also |

The  SystemZoneData  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create | Creates a new instance of a system-zone data domain class. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | ZoneEquipmentId | The id of the zone equipment related to the zone. |

# See Also

SystemZoneData Class

Autodesk.Revit.DB.Mechanical Namespace