#### DocumentClosingEventArgs Members

---

|  |
| --- |
| DocumentClosingEventArgs Class   Methods   Properties   See Also |

The  DocumentClosingEventArgs  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | DocumentId | Id of the document that is about to be closed. |

# See Also

DocumentClosingEventArgs Class

Autodesk.Revit.DB.Events Namespace