#### ShapeBuilder Members

---

|  |
| --- |
| ShapeBuilder Class   Methods   Properties   See Also |

The  ShapeBuilder  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  ShapeBuilder |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

ShapeBuilder Class

Autodesk.Revit.DB Namespace