#### TransferringProjectStandardsEventArgs Members

---

|  |
| --- |
| TransferringProjectStandardsEventArgs Class   Methods   Properties   See Also |

The  TransferringProjectStandardsEventArgs  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | GetExternalItems | Gets the collection of externally added items which should be shown in the Transfer Project Standards dialog as options. |
| Public method | SetExternalItems | Sets the collection of externally added items which should be shown in the Transfer Project Standards dialog as options. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | SourceDocument | Source document. |
| Public property | TargetDocument | Target document. |

# See Also

TransferringProjectStandardsEventArgs Class

Autodesk.Revit.UI.Events Namespace