#### RebarSystemSpanSymbol Members

---

|  |
| --- |
| RebarSystemSpanSymbol Class   Methods   Properties   See Also |

The  RebarSystemSpanSymbol  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create | Creates a new instance of RebarSystemSpanSymbol in the project. |

# Properties

|  | Name | Description |
| --- | --- | --- |

# See Also

RebarSystemSpanSymbol Class

Autodesk.Revit.DB.Structure Namespace