#### BuildingPadType Members

---

|  |
| --- |
| BuildingPadType Class   Methods   Properties   See Also |

The  BuildingPadType  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | CreateDefault | Creates a BuildingPadType element and adds it to the document. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | ThermalProperties | The calculated and settable thermal properties of the BuildingPadType |

# See Also

BuildingPadType Class

Autodesk.Revit.DB Namespace