#### InsulationLiningBase Members

---

|  |
| --- |
| InsulationLiningBase Class   Methods   Properties   See Also |

The  InsulationLiningBase  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | GetInsulationIds | Returns the ids of the insulation elements associated to a given element. |
| Public method Static member | GetLiningIds | Returns the ids of the lining elements associated to a given element. |
| Public method Static member | IsValidThickness | Identifies if the given thickness value is valid for assignment to insulation or lining elements. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | HostElementId | The id of the host element for the insulation or lining element. |
| Public property | Thickness | Thickness of the insulation or lining element. |

# See Also

InsulationLiningBase Class

Autodesk.Revit.DB Namespace