#### StairsLandingType Members

---

|  |
| --- |
| StairsLandingType Class   Methods   Properties   See Also |

The  StairsLandingType  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsMonolithic | True if the stairs landing is monolithic, false otherwise. |
| Public property | Thickness | Thickness of the stairs landing. |

# See Also

StairsLandingType Class

Autodesk.Revit.DB.Architecture Namespace