#### AreaReinforcementType Members

---

|  |
| --- |
| AreaReinforcementType Class   Methods   Properties   See Also |

The  AreaReinforcementType  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | CreateDefaultAreaReinforcementType | Creates a new AreaReinforcementType object with a default name. |

# Properties

|  | Name | Description |
| --- | --- | --- |

# See Also

AreaReinforcementType Class

Autodesk.Revit.DB.Structure Namespace