#### AssetProperties Members

---

|  |
| --- |
| AssetProperties Class   Methods   Properties   See Also |

The  AssetProperties  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | FindByName | Gets the property with the given name. |
| Public method | Get | Gets the property at the given index. |
| Public method | IsValidIndex | Returns true if the provided index is valid. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Item |  |
| Public property | Size | The number of the AssetProperty(s) in the object. |

# See Also

AssetProperties Class

Autodesk.Revit.DB.Visual Namespace