#### JournalingAttribute Members

---

|  |
| --- |
| JournalingAttribute Class   Constructors   Methods   Properties   See Also |

The  JournalingAttribute  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | JournalingAttribute | Constructs a new JournalingAttribute. |

# Methods

|  | Name | Description |
| --- | --- | --- |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Mode | Journaling mode. |

# See Also

JournalingAttribute Class

Autodesk.Revit.Attributes Namespace