#### ConnectionInputPointInfo Members

---

|  |
| --- |
| ConnectionInputPointInfo Class   Constructors   Methods   Properties   See Also |

The  ConnectionInputPointInfo  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | ConnectionInputPointInfo | Construct a default input point. |
| Public method | ConnectionInputPointInfo(String, Int32, String) | Construct an input point info. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  ConnectionInputPointInfo |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | InputMemberIndex | A index of the input member to which the restriction applies. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | PointSelectionText | A string used to select input point by some connections. |
| Public property | RestrictionType | A type of input point restriction. |

# See Also

ConnectionInputPointInfo Class

Autodesk.Revit.DB.Structure Namespace