#### StructuralSectionGeneralLZ Members

---

|  |
| --- |
| StructuralSectionGeneralLZ Class   Constructors   Methods   Properties   See Also |

The  StructuralSectionGeneralLZ  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | StructuralSectionGeneralLZ | Creates a new instance of Z Cold Formed shape. |

# Methods

|  | Name | Description |
| --- | --- | --- |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | BottomFlangeLength | Bottom Flange segment length. |
| Public property | LipLength | Lip segment length. |

# See Also

StructuralSectionGeneralLZ Class

Autodesk.Revit.DB.Structure.StructuralSections Namespace