#### AssetSetIterator Members

---

|  |
| --- |
| AssetSetIterator Class   Constructors   Methods   Properties   See Also |

The  AssetSetIterator  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | AssetSetIterator | Initializes a new instance of the  AssetSetIterator  class |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | MoveNext |  |
| Public method | Reset |  |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Current |  |

# See Also

AssetSetIterator Class

Autodesk.Revit.DB.Visual Namespace