#### DocumentEntryPoint Members

---

|  |
| --- |
| DocumentEntryPoint Class   Constructors   Methods   Properties   See Also |

The  DocumentEntryPoint  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | DocumentEntryPoint | Initializes a new instance of the  DocumentEntryPoint  class |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | FinishInitializationEO | For Revit Macros internal use only. |
| Public method | Initialize | For Revit Macros internal use only. |
| Public method | OnShutdownEO | For Revit Macros internal use only. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | AddinFolder | The full path to the Revit Macros module. |

# See Also

DocumentEntryPoint Class

Autodesk.Revit.UI.Macros Namespace