#### StructuralSectionGeneralCEx Members

---

|  |
| --- |
| StructuralSectionGeneralCEx Class   Constructors   Methods   Properties   See Also |

The  StructuralSectionGeneralCEx  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | StructuralSectionGeneralCEx | Creates a new instance of general Channel Cold Formed shape. |

# Methods

|  | Name | Description |
| --- | --- | --- |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | FoldLength | Fold segment length. |
| Public property | LipLength | Lip segment length. |

# See Also

StructuralSectionGeneralCEx Class

Autodesk.Revit.DB.Structure.StructuralSections Namespace