#### StructuralSectionLAngle Members

---

|  |
| --- |
| StructuralSectionLAngle Class   Constructors   Methods   Properties   See Also |

The  StructuralSectionLAngle  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | StructuralSectionLAngle | Creates a new instance of Structural Section L Angle shape with the associated set of parameters, used to attach to structural element. |

# Methods

|  | Name | Description |
| --- | --- | --- |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | BoltDiameterLongerFlange | Maximum bolt hole diameter in the longer flange, in. (mm) |
| Public property | BoltDiameterShorterFlange | Maximum bolt hole diameter in the shorter flange, in. (mm) |
| Public property | BoltSpacing1LongerFlange | Standard bolt spacing first row in the longer flange, in. (mm) |
| Public property | BoltSpacing2LongerFlange | Standard bolt spacing second row in the longer flange, in. (mm) |
| Public property | BoltSpacingShorterFlange | Standard bolt spacing in the shorter flange, in. (mm) |

# See Also

StructuralSectionLAngle Class

Autodesk.Revit.DB.Structure.StructuralSections Namespace