#### StructuralSectionConcreteRectangleCut Members

---

|  |
| --- |
| StructuralSectionConcreteRectangleCut Class   Constructors   Methods   Properties   See Also |

The  StructuralSectionConcreteRectangleCut  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | StructuralSectionConcreteRectangleCut | Creates a new instance of Structural Section Concrete Rectangle Cut shape with the associated set of parameters, used to attach to structural element. |

# Methods

|  | Name | Description |
| --- | --- | --- |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | BottomCutHeight | Section height left Cut. |
| Public property | BottomCutWidth | Section width left Cut. |
| Public property | TopCutHeight | Section height right Cut. |
| Public property | TopCutWidth | Section width right Cut. |

# See Also

StructuralSectionConcreteRectangleCut Class

Autodesk.Revit.DB.Structure.StructuralSections Namespace