#### StructuralSectionGeneralLA Members

---

|  |
| --- |
| StructuralSectionGeneralLA Class   Constructors   Methods   Properties   See Also |

The  StructuralSectionGeneralLA  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | StructuralSectionGeneralLA | Creates a new instance of Angle Cold Formed shape. |

# Methods

|  | Name | Description |
| --- | --- | --- |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | LipLength | Lip segment length. |

# See Also

StructuralSectionGeneralLA Class

Autodesk.Revit.DB.Structure.StructuralSections Namespace