#### StructuralSectionConcreteCross Members

---

|  |
| --- |
| StructuralSectionConcreteCross Class   Constructors   Methods   Properties   See Also |

The  StructuralSectionConcreteCross  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | StructuralSectionConcreteCross | Creates a new instance of Structural Section Concrete Cross shape with the associated set of parameters, used to attach to structural element. |

# Methods

|  | Name | Description |
| --- | --- | --- |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | CantileverHeight | Flange cantilever thickness. |
| Public property | CantileverLength | Flange cantilever length. |

# See Also

StructuralSectionConcreteCross Class

Autodesk.Revit.DB.Structure.StructuralSections Namespace