#### FileSaveDialog Members

---

|  |
| --- |
| FileSaveDialog Class   Constructors   Methods   Properties   See Also |

The  FileSaveDialog  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | FileSaveDialog | Constructs a new instance of a File Save dialog. |

# Methods

|  | Name | Description |
| --- | --- | --- |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | InitialFileName | The initial file name to be shown for this save operation. |

# See Also

FileSaveDialog Class

Autodesk.Revit.UI Namespace