#### LayoutRuleMaximumSpacing Members

---

|  |
| --- |
| LayoutRuleMaximumSpacing Class   Constructors   Methods   Properties   See Also |

The  LayoutRuleMaximumSpacing  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | LayoutRuleMaximumSpacing | Constructor of LayoutRuleMaximumSpacing. |

# Methods

|  | Name | Description |
| --- | --- | --- |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Spacing | Get or set the spacing of the beam system. |

# See Also

LayoutRuleMaximumSpacing Class

Autodesk.Revit.DB Namespace