#### ExternalResourceType Members

---

|  |
| --- |
| ExternalResourceType Class   Constructors   Methods   Operators   Properties   See Also |

The  ExternalResourceType  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | ExternalResourceType | Creates a new ExternalResourceType instance. |

# Methods

|  | Name | Description |
| --- | --- | --- |

# Operators

|  | Name | Description |
| --- | --- | --- |
| Public operator Static member | Equality | Compares two ExternalResourceType instances. |
| Public operator Static member | Inequality | Compares two ExternalResourceType instances. |

# Properties

|  | Name | Description |
| --- | --- | --- |

# See Also

ExternalResourceType Class

Autodesk.Revit.DB Namespace