#### DockablePane Members

---

|  |
| --- |
| DockablePane Class   Constructors   Methods   Properties   See Also |

The  DockablePane  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | DockablePane(DockablePane) | Constructs a new copy of the input DockablePane object. |
| Public method | DockablePane(DockablePaneId) | Gets the pane with identifier %id%. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  DockablePane |
| Public method | GetTitle | Returns the current title (a.k.a. window caption) of the dockable pane. |
| Public method | Hide | If the pane is on screen, hide it. Has no effect on built-in Revit dockable panes. |
| Public method | IsShown | Identify the pane is currently visible or in a tab. |
| Public method Static member | PaneExists | Returns true if %id% refers to a dockable pane window that currently exists in the Revit user interface, whether it's hidden or shown. |
| Public method Static member | PaneIsBuiltIn | Returns true if %id% refers to a built-in Revit dockable pane, rather than one created by an add-in. |
| Public method Static member | PaneIsRegistered | Returns true if %id% refers to a built-in Revit dockable pane, or an add-in pane that has been properly registered with %Autodesk.Revit.UI.UIApplication.RegisterDockablePane%. |
| Public method | Show | If the pane is not currently visible or in a tab, display the pane in the Revit user interface at its last docked location. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Id | The unique identifier for this dockable pane. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

DockablePane Class

Autodesk.Revit.UI Namespace