#### StructuralSectionGeneralW Members

---

|  |
| --- |
| StructuralSectionGeneralW Class   Constructors   Methods   Properties   See Also |

The  StructuralSectionGeneralW  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | StructuralSectionGeneralW | Creates a new instance of Angle shape. |

# Methods

|  | Name | Description |
| --- | --- | --- |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | FlangeFillet | Flange Fillet - fillet radius at the flange end. |
| Public property | TopWebFillet | Top Web Fillet - fillet radius at the top of web. |

# See Also

StructuralSectionGeneralW Class

Autodesk.Revit.DB.Structure.StructuralSections Namespace