#### ScheduleFieldId Members

---

|  |
| --- |
| ScheduleFieldId Class   Constructors   Methods   Operators   Properties   See Also |

The  ScheduleFieldId  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | ScheduleFieldId | Initializes a new instance of the  ScheduleFieldId  class |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Overrides  Object Equals(Object)  .) |
| Public method | GetHashCode | Gets the integer value of the id as hash code (Overrides  Object GetHashCode  .) |
| Public method | ToString | Gets a String representation of the integer value of the id. (Overrides  Object ToString  .) |

# Operators

|  | Name | Description |
| --- | --- | --- |
| Public operator Static member | Equality | Determines whether two ScheduleFieldIds are the same. |
| Public operator Static member | Inequality | Determines whether two ScheduleFieldId are different. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IntegerValue | Provides the value of the ScheduleFieldId as an integer. |
| Public property Static member | InvalidScheduleFieldId | Get the invalid ScheduleFieldId whose IntegerValue is -1. |

# See Also

ScheduleFieldId Class

Autodesk.Revit.DB Namespace