#### FabricationPartSizeMap Members

---

|  |
| --- |
| FabricationPartSizeMap Class   Constructors   Methods   Properties   See Also |

The  FabricationPartSizeMap  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | FabricationPartSizeMap(String, Double, Double, Boolean) | Creates a new instance of the FabricationPartSizeMap class. |
| Public method | FabricationPartSizeMap(String, Double, Double, Boolean, ConnectorProfileType, Int32, Int32) | Creates a new instance of the FabricationPartSizeMap class. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  FabricationPartSizeMap |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | AllowMultipleServiceSizes | State flag to allow multiple services to include the same size. |
| Public property | Depth | The depth of the straight. |
| Public property | IsMappedProductList | Are the mapped sizes for a product listed fabrication part. |
| Public property | IsProductList | Are the sizes for a product listed fabrication part. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | MappedDepth | The mapped size for the depth of the straight. |
| Public property | MappedProfileType | The mapped shape of the straight. |
| Public property | MappedServiceId | The mapped service identifier of the straight. |
| Public property | MappedWidthDiameter | The mapped size for the width or diameter of the straight. |
| Public property | PaletteId | The palette identifier of the straight. |
| Public property | ProfileType | The shape of the straight. |
| Public property | ServiceId | The service identifier of the straight. |
| Public property | SizeString | The size display string for the straight that can be used by the user interface. |
| Public property | WidthDiameter | The width or diameter of the straight. |

# See Also

FabricationPartSizeMap Class

Autodesk.Revit.DB.Fabrication Namespace