#### AssetSet Members

---

|  |
| --- |
| AssetSet Class   Constructors   Methods   Properties   See Also |

The  AssetSet  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | AssetSet | Initializes a new instance of the  AssetSet  class |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Clear |  |
| Public method | Contains |  |
| Public method | Erase |  |
| Public method | ForwardIterator |  |
| Public method | GetEnumerator |  |
| Public method | Insert |  |
| Public method | ReverseIterator |  |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsEmpty |  |
| Public property | Size |  |

# See Also

AssetSet Class

Autodesk.Revit.DB.Visual Namespace