#### FilterStringGreater Members

---

|  |
| --- |
| FilterStringGreater Class   Constructors   Methods   Properties   See Also |

The  FilterStringGreater  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | FilterStringGreater | Constructs an instance of FilterStringGreater. |

# Methods

|  | Name | Description |
| --- | --- | --- |

# Properties

|  | Name | Description |
| --- | --- | --- |

# See Also

FilterStringGreater Class

Autodesk.Revit.DB Namespace