#### PerformanceAdviserRuleId Members

---

|  |
| --- |
| PerformanceAdviserRuleId Class   Constructors   Methods   Operators   Properties   See Also |

The  PerformanceAdviserRuleId  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | PerformanceAdviserRuleId | Creates a new PerformanceAdviserRuleId instance. |

# Methods

|  | Name | Description |
| --- | --- | --- |

# Operators

|  | Name | Description |
| --- | --- | --- |
| Public operator Static member | Equality | Compares two PerformanceAdviserRuleId instances. |
| Public operator Static member | Inequality | Compares two PerformanceAdviserRuleId instances. |

# Properties

|  | Name | Description |
| --- | --- | --- |

# See Also

PerformanceAdviserRuleId Class

Autodesk.Revit.DB Namespace