#### FilterDialog Members

---

|  |
| --- |
| FilterDialog Class   Constructors   Methods   Properties   See Also |

The  FilterDialog  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | FilterDialog(Document, ElementId) | Constructs a new instance of the FilterDialog class, while setting the id of the FilterElement to be selected when the dialog is shown. |
| Public method | FilterDialog(Document, String) | Constructs a new instance of the FilterDialog class, while setting the name of the new ParameterFilterElement to be created and selected for editing. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  FilterDialog |
| Public method | Show | Shows the FilterDialog editing dialog to the user. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | FilterToSelect | The filter element to be selected once Show is invoked. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | NewFilterId | The ElementId of the new filter created. The value is populated after Show method is executed. |
| Public property | NewFilterName | The name of the new ParameterFilterElement to be created and selected once Show is invoked. |

# See Also

FilterDialog Class

Autodesk.Revit.UI Namespace