#### SpaceFilter Members

---

|  |
| --- |
| SpaceFilter Class   Constructors   Methods   Properties   See Also |

The  SpaceFilter  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | SpaceFilter | Constructs a filter which matches only spaces. |

# Methods

|  | Name | Description |
| --- | --- | --- |

# Properties

|  | Name | Description |
| --- | --- | --- |

# See Also

SpaceFilter Class

Autodesk.Revit.DB.Mechanical Namespace