#### StructuralSectionSigmaProfileWithLips Members

---

|  |
| --- |
| StructuralSectionSigmaProfileWithLips Class   Constructors   Methods   Properties   See Also |

The  StructuralSectionSigmaProfileWithLips  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | StructuralSectionSigmaProfileWithLips | Creates a new instance of Structural Section Sigma Profile With Lips shape with the associated set of parameters, used to attach to structural element. |

# Methods

|  | Name | Description |
| --- | --- | --- |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | BendWidth | Bend segment width. |
| Public property | LipLength | Lip segment length. |
| Public property | MiddleBendLength | Middle Bend segment length. |
| Public property | TopBendLength | Top Bend segment length. |

# See Also

StructuralSectionSigmaProfileWithLips Class

Autodesk.Revit.DB.Structure.StructuralSections Namespace