#### StructuralSectionIWelded Members

---

|  |
| --- |
| StructuralSectionIWelded Class   Constructors   Methods   Properties   See Also |

The  StructuralSectionIWelded  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | StructuralSectionIWelded | Creates a new instance of Structural Section I Welded shape with the associated set of parameters, used to attach to structural element. |

# Methods

|  | Name | Description |
| --- | --- | --- |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | BottomFlangeThickness | Bottom Flange Thickness. |
| Public property | BottomFlangeWidth | Bottom Flange Width. |
| Public property | TopFlangeThickness | Top Flange Thickness. |
| Public property | TopFlangeWidth | Top Flange Width. |
| Public property | WebHeight | Web Height. |
| Public property | WebThickness | Web Thickness. |

# See Also

StructuralSectionIWelded Class

Autodesk.Revit.DB.Structure.StructuralSections Namespace