#### SpaceTagFilter Members

---

|  |
| --- |
| SpaceTagFilter Class   Constructors   Methods   Properties   See Also |

The  SpaceTagFilter  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | SpaceTagFilter | Constructs a filter which matches only spaces. |

# Methods

|  | Name | Description |
| --- | --- | --- |

# Properties

|  | Name | Description |
| --- | --- | --- |

# See Also

SpaceTagFilter Class

Autodesk.Revit.DB.Mechanical Namespace