#### FamilyStructuralMaterialTypeFilter Members

---

|  |
| --- |
| FamilyStructuralMaterialTypeFilter Class   Constructors   Methods   Properties   See Also |

The  FamilyStructuralMaterialTypeFilter  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | FamilyStructuralMaterialTypeFilter(StructuralMaterialType) | Constructs a new instance of a filter to match families that have the given structural material type. |
| Public method | FamilyStructuralMaterialTypeFilter(StructuralMaterialType, Boolean) | Constructs a new instance of a filter to match families by structural material type, with the option to match all families which are not of the given structural material type. |

# Methods

|  | Name | Description |
| --- | --- | --- |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | StructuralMaterialType | The family structural material type. |

# See Also

FamilyStructuralMaterialTypeFilter Class

Autodesk.Revit.DB.Structure Namespace