#### AppearanceAssetEditScope Members

---

|  |
| --- |
| AppearanceAssetEditScope Class   Constructors   Methods   Properties   See Also |

The  AppearanceAssetEditScope  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | AppearanceAssetEditScope | Constructs a new instance of an AppearanceAssetEditScope. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Cancel | Cancels the edit scope. |
| Public method | Commit | Finishes the edit scope. |
| Public method | Dispose | Releases all resources used by the  AppearanceAssetEditScope |
| Public method | Start | Starts the edit scope. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsActive | Identifies if the EditScope is active. In other words, the EditScope has started but not committed/canceled yet. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

AppearanceAssetEditScope Class

Autodesk.Revit.DB.Visual Namespace