#### StructuralSectionGeneralH Members

---

|  |
| --- |
| StructuralSectionGeneralH Class   Constructors   Methods   Properties   See Also |

The  StructuralSectionGeneralH  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | StructuralSectionGeneralH | Creates a new instance of Rectangular Pipe shape. |

# Methods

|  | Name | Description |
| --- | --- | --- |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | InnerFillet | Inner Fillet - Corner fillet inner radius. |
| Public property | OuterFillet | Outer Fillet - Corner fillet outer radius. |
| Public property | WallDesignThickness | Represents wall design thickness of rectangle. |
| Public property | WallNominalThickness | Represents wall nominal thickness of rectangle. |

# See Also

StructuralSectionGeneralH Class

Autodesk.Revit.DB.Structure.StructuralSections Namespace