#### StructuralInstanceUsageFilter Members

---

|  |
| --- |
| StructuralInstanceUsageFilter Class   Constructors   Methods   Properties   See Also |

The  StructuralInstanceUsageFilter  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | StructuralInstanceUsageFilter(StructuralInstanceUsage) | Constructs a new instance of a filter to match structural family instances (typically columns, beams, or braces) of the given structural usage. |
| Public method | StructuralInstanceUsageFilter(StructuralInstanceUsage, Boolean) | Constructs a new instance of a filter to match family instances by structural usage, with the option to match all family instances which are not of the given structural usage. |

# Methods

|  | Name | Description |
| --- | --- | --- |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | StructuralUsage | The family instance structural usage. |

# See Also

StructuralInstanceUsageFilter Class

Autodesk.Revit.DB.Structure Namespace