#### FilterStringEquals Members

---

|  |
| --- |
| FilterStringEquals Class   Constructors   Methods   Properties   See Also |

The  FilterStringEquals  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | FilterStringEquals | Constructs an instance of FilterStringEquals. |

# Methods

|  | Name | Description |
| --- | --- | --- |

# Properties

|  | Name | Description |
| --- | --- | --- |

# See Also

FilterStringEquals Class

Autodesk.Revit.DB Namespace