#### StructuralSectionGeneralT Members

---

|  |
| --- |
| StructuralSectionGeneralT Class   Constructors   Methods   Properties   See Also |

The  StructuralSectionGeneralT  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | StructuralSectionGeneralT | Creates a new instance of Tees shape. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | GetFlangeThicknessInFlangeCenter | Returns thickness of flange measured in the 0.25 \* (width - webThickess), sometimes used for sections with width > 300 mm. |
| Public method | GetFlangeThicknessInQuarterWidth | Returns thickness of flange measured in the 0.25 \* width, sometimes used for sections with width <= 300 mm. |
| Public method | GetWebThicknessInHeightCenter | Returns thickness of web measured in the 0.5 \* height, |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | FlangeFillet | Flange Fillet - fillet radius at the flange end. |
| Public property | FlangeToeOfFillet | Detailing distance from center of web to flange toe of fillet, in. (mm) |
| Public property | SlopedFlangeAngle | Sloped flange angle. (rad) |
| Public property | SlopedWebAngle | Sloped web angle. (rad) |
| Public property | TopWebFillet | Top Web Fillet - fillet radius at the top of web. |
| Public property | WebToeOfFillet | Detailing distance from outer face of flange to web toe of fillet, in. (mm) |

# See Also

StructuralSectionGeneralT Class

Autodesk.Revit.DB.Structure.StructuralSections Namespace