#### RebarBendData Members

---

|  |
| --- |
| RebarBendData Class   Constructors   Methods   Properties   See Also |

The  RebarBendData  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | RebarBendData | Constructs a new RebarBendData with default settings. |
| Public method | RebarBendData(RebarBarType, RebarHookType, RebarHookType, RebarStyle, RebarHookOrientation, RebarHookOrientation) | Constructs a new RebarBendData using the bar type, hook types, style and orientation values. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  RebarBendData |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | BarModelDiameter | Defines the model diameter of the bar. |
| Public property | BarNominalDiameter | Defines the nominal diameter of the bar. |
| Public property | BendRadius | The radius of all fillets, except hook fillets, in the Rebar shape. |
| Public property | HookAngle0 | The angle of the hook at the start. |
| Public property | HookAngle1 | The angle of the hook at the end. |
| Public property | HookBendRadius | The radius of the hook fillets in the Rebar shape. |
| Public property | HookLength0 | The extension length of the hook at the start. |
| Public property | HookLength1 | The extension length of the hook at the end. |
| Public property | HookOrient0 | The orientation of the hook at the start. |
| Public property | HookOrient1 | The orientation of the hook at the end. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

RebarBendData Class

Autodesk.Revit.DB.Structure Namespace