#### StructuralSectionGeneralC Members

---

|  |
| --- |
| StructuralSectionGeneralC Class   Constructors   Methods   Properties   See Also |

The  StructuralSectionGeneralC  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | StructuralSectionGeneralC | Creates a new instance of general Channel Cold Formed shape. |

# Methods

|  | Name | Description |
| --- | --- | --- |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | LipLength | Lip segment length. |

# See Also

StructuralSectionGeneralC Class

Autodesk.Revit.DB.Structure.StructuralSections Namespace