#### FilterStringLess Members

---

|  |
| --- |
| FilterStringLess Class   Constructors   Methods   Properties   See Also |

The  FilterStringLess  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | FilterStringLess | Constructs an instance of FilterStringLess. |

# Methods

|  | Name | Description |
| --- | --- | --- |

# Properties

|  | Name | Description |
| --- | --- | --- |

# See Also

FilterStringLess Class

Autodesk.Revit.DB Namespace