#### FilterCategoryRule Members

---

|  |
| --- |
| FilterCategoryRule Class   Constructors   Methods   Properties   See Also |

The  FilterCategoryRule  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | FilterCategoryRule | Constructs a new instance of FilterCategoryRule. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | AllCategoriesFilterable | Checks that all of the given categories are filterable. |
| Public method | GetCategories | Gets the rule's categories. |
| Public method | SetCategories | Sets the rule's categories. |

# Properties

|  | Name | Description |
| --- | --- | --- |

# See Also

FilterCategoryRule Class

Autodesk.Revit.DB Namespace