#### StructuralSectionISplitSlopedFlange Members

---

|  |
| --- |
| StructuralSectionISplitSlopedFlange Class   Constructors   Methods   Properties   See Also |

The  StructuralSectionISplitSlopedFlange  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | StructuralSectionISplitSlopedFlange | Creates a new instance of Structural Section I Split Sloped Flange shape with the associated set of parameters, used to attach to structural element. |

# Methods

|  | Name | Description |
| --- | --- | --- |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | BoltDiameter | Maximum bolt hole diameter, in. (mm) |
| Public property | BoltSpacing | Standard bolt spacing, in. (mm) |
| Public property | ClearWebHeight | Detailing depth between the web toes of the fillets, in.(mm) |

# See Also

StructuralSectionISplitSlopedFlange Class

Autodesk.Revit.DB.Structure.StructuralSections Namespace