#### AreaTagFilter Members

---

|  |
| --- |
| AreaTagFilter Class   Constructors   Methods   Properties   See Also |

The  AreaTagFilter  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | AreaTagFilter | Constructs a filter which matches only areas. |

# Methods

|  | Name | Description |
| --- | --- | --- |

# Properties

|  | Name | Description |
| --- | --- | --- |

# See Also

AreaTagFilter Class

Autodesk.Revit.DB Namespace