#### ReinforcementAbbreviationTag Members

---

|  |
| --- |
| ReinforcementAbbreviationTag Class   Constructors   Methods   Properties   See Also |

The  ReinforcementAbbreviationTag  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | ReinforcementAbbreviationTag | Constructs a new ReinforcementAbbreviationTag. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  ReinforcementAbbreviationTag |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | AbbreviationTag | The abbreviation tag value. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | TypeTag | The abbreviation tag type. |

# See Also

ReinforcementAbbreviationTag Class

Autodesk.Revit.DB.Structure Namespace