#### DockablePaneProviderData Members

---

|  |
| --- |
| DockablePaneProviderData Class   Constructors   Methods   Properties   See Also |

The  DockablePaneProviderData  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | DockablePaneProviderData | Initializes a new instance of the  DockablePaneProviderData  class |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | GetFrameworkElement | Wrapper function that returns the FrameworkElement for this provider. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | ContextualHelp | The contextual help associated with the pane. |
| Public property | EditorInteraction | Defines the interaction this pane has with the Active Editor when the pane becomes active. |
| Public property | FrameworkElement | The Windows Presentation Framework object containing the pane's user interface. |
| Public property | FrameworkElementCreator | A creator that will be called for the pane if the FrameworkElement is not set. |
| Public property | InitialState | The initial position of the docking pane. |
| Public property | VisibleByDefault | Controls the default visibility of the pane upon the first time the pane/plugin is loaded into Revit. |

# See Also

DockablePaneProviderData Class

Autodesk.Revit.UI Namespace