#### NumberingSchemaType Members

---

|  |
| --- |
| NumberingSchemaType Class   Constructors   Methods   Operators   Properties   See Also |

The  NumberingSchemaType  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | NumberingSchemaType | Creates a new NumberingSchemaType instance. |

# Methods

|  | Name | Description |
| --- | --- | --- |

# Operators

|  | Name | Description |
| --- | --- | --- |
| Public operator Static member | Equality | Compares two NumberingSchemaType instances. |
| Public operator Static member | Inequality | Compares two NumberingSchemaType instances. |

# Properties

|  | Name | Description |
| --- | --- | --- |

# See Also

NumberingSchemaType Class

Autodesk.Revit.DB Namespace