#### Definitions Members

---

|  |
| --- |
| Definitions Class   Constructors   Methods   Properties   See Also |

The  Definitions  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | Definitions | Constructs an empty set of parameter definitions. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Contains | Tests for the existence of a definition within the set. |
| Public method | Create | Creates a new parameter definition using specified options. |
| Public method | Dispose | Releases all resources used by the  Definitions |
| Protected method | GetBasicIEnumerator | Returns an enumerator that iterates through a collection. |
| Public method | GetEnumerator | Retrieves an enumerator to the collection. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsEmpty | Identifies if the definitions collection is empty. |
| Public property | Item | Retrieves a definition by a given name. |
| Public property | Size | The number of definitions in the collection. |

# See Also

Definitions Class

Autodesk.Revit.DB Namespace