#### StructuralMaterialTypeFilter Members

---

|  |
| --- |
| StructuralMaterialTypeFilter Class   Constructors   Methods   Properties   See Also |

The  StructuralMaterialTypeFilter  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | StructuralMaterialTypeFilter(StructuralMaterialType) | Constructs a new instance of a filter to match family instances that have the given structural material type. |
| Public method | StructuralMaterialTypeFilter(StructuralMaterialType, Boolean) | Constructs a new instance of a filter to match family instances by structural material type, with the option to match all families which are not of the given structural material type. |

# Methods

|  | Name | Description |
| --- | --- | --- |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | StructuralMaterialType | The structural material type. |

# See Also

StructuralMaterialTypeFilter Class

Autodesk.Revit.DB.Structure Namespace