#### DontEditNestedGroup Property

---

|  |
| --- |
| BuiltInFailures GroupFailures Class   See Also |

Cannot edit nested Groups while inside Edit Group mode for its host Group. To edit the nested Group finish editing all Groups. Use the Tab key to select the nested Group and edit it directly.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId DontEditNestedGroup { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property DontEditNestedGroup As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ DontEditNestedGroup { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures GroupFailures Class

Autodesk.Revit.DB Namespace