#### IDuctFittingAndAccessoryPressureDropServer Members

---

|  |
| --- |
| IDuctFittingAndAccessoryPressureDropServer Interface   Methods   See Also |

The  IDuctFittingAndAccessoryPressureDropServer  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Calculate | Calculate the duct fitting and duct accessory coefficient. |
| Public method | GetDataSchema | Obtains the schema of the ESEntity. |
| Public method | IsApplicable | Check if the server is applicable for the duct fitting or duct accessory. |

# See Also

IDuctFittingAndAccessoryPressureDropServer Interface

Autodesk.Revit.DB.Mechanical Namespace