#### LoadNature Members

---

|  |
| --- |
| LoadNature Class   Methods   Properties   See Also |

The  LoadNature  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create | Creates a new LoadNature. |

# Properties

|  | Name | Description |
| --- | --- | --- |

# See Also

LoadNature Class

Autodesk.Revit.DB.Structure Namespace