#### DuctInsulation Members

---

|  |
| --- |
| DuctInsulation Class   Methods   Properties   See Also |

The  DuctInsulation  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create | Creates a new instance of duct insulation. |

# Properties

|  | Name | Description |
| --- | --- | --- |

# See Also

DuctInsulation Class

Autodesk.Revit.DB.Mechanical Namespace