#### FabricationPartType Members

---

|  |
| --- |
| FabricationPartType Class   Methods   Properties   See Also |

The  FabricationPartType  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create | Creates a fabrication part type element based on a specific fabrication servic button and condition. |
| Public method Static member | Lookup | Looks up an existing fabrication part type based on a specfic fabrication service button and condition. |

# Properties

|  | Name | Description |
| --- | --- | --- |

# See Also

FabricationPartType Class

Autodesk.Revit.DB Namespace