#### GlobalParametersManager Members

---

|  |
| --- |
| GlobalParametersManager Class   Methods   Properties   See Also |

The  GlobalParametersManager  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | AreGlobalParametersAllowed | Tests whether global parameters are allowed in the given document. |
| Public method | Dispose | Releases all resources used by the  GlobalParametersManager |
| Public method Static member | FindByName | Finds whether a global parameter with the given name exists in the input document. |
| Public method Static member | GetAllGlobalParameters | Returns all global parameters available in the given document. |
| Public method Static member | GetGlobalParametersOrdered | Returns all global paramters in an ordered array. |
| Public method Static member | IsUniqueName | Tests whether a name is unique among existing global parameters of a given document. |
| Public method Static member | IsValidGlobalParameter | Tests whether an ElementId is of a global parameter in the given document. |
| Public method Static member | MoveParameterDownOrder | Moves given paramerer Down in the current order. |
| Public method Static member | MoveParameterUpOrder | Moves given paramerer Up in the current order. |
| Public method Static member | SortParameters | Sorts global parameters in the desired order. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

GlobalParametersManager Class

Autodesk.Revit.DB Namespace