#### ClassificationEntries Members

---

|  |
| --- |
| ClassificationEntries Class   Methods   Properties   See Also |

The  ClassificationEntries  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | LoadClassificationEntriesFromFile | Loads the contents of a classification text file into the provided KeyBasedTreeEntriesLoadContent. |

# Properties

|  | Name | Description |
| --- | --- | --- |

# See Also

ClassificationEntries Class

Autodesk.Revit.DB Namespace