#### DoubleClickOptions Members

---

|  |
| --- |
| DoubleClickOptions Class   Methods   Properties   See Also |

The  DoubleClickOptions  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  DoubleClickOptions |
| Public method | GetAction | Returns the active user's desired action for a particular double-click target. |
| Public method Static member | GetDoubleClickOptions | Returns the current user's DoubleClickOptions. |
| Public method | GetRenameOnSlowDoubleClickInProjectBrowser | Returns the user's desire to rename item in project browser on slow double-click. |
| Public method | IsSupportedAction | Checks whether the specified double-click target supports the specified action. |
| Public method | SetAction | Changes the double-click action associated with a specified target. |
| Public method | SetRenameOnSlowDoubleClickInProjectBrowser | Sets whether the desired action is to rename item in project browser on slow double-click. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

DoubleClickOptions Class

Autodesk.Revit.UI Namespace