#### AnalyticalPanel Members

---

|  |
| --- |
| AnalyticalPanel Class   Methods   Properties   See Also |

The  AnalyticalPanel  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create | Creates a new instance of an Analytical Panel within the project. |
| Public method | GetAnalyticalOpeningsIds | Returns the Analytical Openings ids of the Analytical Panel. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Thickness | Panel thickness, in the Revit default units. |

# See Also

AnalyticalPanel Class

Autodesk.Revit.DB.Structure Namespace