#### PipePlumbingFixtureFlowData Members

---

|  |
| --- |
| PipePlumbingFixtureFlowData Class   Methods   Properties   See Also |

The  PipePlumbingFixtureFlowData  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  PipePlumbingFixtureFlowData |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | DimensionFlow | The dimension flow which is used to calculate flow of the pipe. Units: (gal/min). |
| Public property | FixtureUnits | The fixture units of the pipe. |
| Public property | Flow | The actual flow of the plumbing fixture converted from dimension flow or fixture unit. Units: (gal/min). |
| Public property | FlowConfiguration | The flow configuration mode of the pipe. |
| Public property | FlowConversionMode | The flow conversion mode of the pipe. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

PipePlumbingFixtureFlowData Class

Autodesk.Revit.DB.Plumbing Namespace