#### AreaBasedLoadBoundaryLineData Members

---

|  |
| --- |
| AreaBasedLoadBoundaryLineData Class   Methods   Properties   See Also |

The  AreaBasedLoadBoundaryLineData  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  AreaBasedLoadBoundaryLineData |
| Public method | GetLevelIdsInRange | Returns level ids between the top level and the bottom level (including the top level and the bottom level) of the area based load boundary line. |
| Public method | IsElevationWithinRange | Checks whether the given elevation is between the bottom level and the top level(including the bottom level and the top level) of the area based load boundary line. |
| Public method | IsLevelWithinRange | Checks whether the given level is between the bottom level and the top level (including the bottom level and the top level) of the area based load boundary line. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | BottomLevelId | The bottom level id of the area based load boundary line. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | TopLevelId | The top level id of the area based load boundary line. |

# See Also

AreaBasedLoadBoundaryLineData Class

Autodesk.Revit.DB.Electrical Namespace