#### FaceWall Members

---

|  |
| --- |
| FaceWall Class   Methods   Properties   See Also |

The  FaceWall  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create | Creates a new instance of a wall attached to a non-vertical massing face. |
| Public method Static member | IsValidFaceReferenceForFaceWall | Identifies if a reference may be used as the parent of a face wall. |
| Public method Static member | IsWallTypeValidForFaceWall | Identifies if a wall type may be applied to a face wall. |

# Properties

|  | Name | Description |
| --- | --- | --- |

# See Also

FaceWall Class

Autodesk.Revit.DB Namespace