#### IControllableDropHandler Members

---

|  |
| --- |
| IControllableDropHandler Interface   Methods   See Also |

The  IControllableDropHandler  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | CanExecute | Implement this method to inform Revit whether the drop event can be executed onto the given view. |

# See Also

IControllableDropHandler Interface

Autodesk.Revit.UI Namespace