#### LoadUsage Members

---

|  |
| --- |
| LoadUsage Class   Methods   Properties   See Also |

The  LoadUsage  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create | Creates a new LoadUsage. |

# Properties

|  | Name | Description |
| --- | --- | --- |

# See Also

LoadUsage Class

Autodesk.Revit.DB.Structure Namespace