#### RebarRoundingManager Members

---

|  |
| --- |
| RebarRoundingManager Class   Methods   Properties   See Also |

The  RebarRoundingManager  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | ApplicableReinforcementRoundingSource | Identifies the source of the rounding settings for this element. |
| Public property | ApplicableSegmentLengthRounding | The applicable rounding for shared parameters used by rebar. |
| Public property | ApplicableSegmentLengthRoundingMethod | The applicable rounding method for shared parameters used by rebar. |
| Public property | ApplicableTotalLengthRounding | The applicable rounding for Bar Length and Total Bar Length parameters. |
| Public property | ApplicableTotalLengthRoundingMethod | The applicable rounding method for Bar Length and Total Bar Length parameters. |
| Public property | SegmentLengthRounding | The rounding for shared parameters used by rebar. |
| Public property | SegmentLengthRoundingMethod | Identifies the segment length rounding method |
| Public property | TotalLengthRounding | The rounding for Bar Length and Total Bar Length parameters. |
| Public property | TotalLengthRoundingMethod | Identifies the total length rounding method |

# See Also

RebarRoundingManager Class

Autodesk.Revit.DB.Structure Namespace