#### ElementLogicalFilter Members

---

|  |
| --- |
| ElementLogicalFilter Class   Methods   Properties   See Also |

The  ElementLogicalFilter  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | GetFilters | Returns an array of copies of the filters that are logically combined by this ElementLogicalFilter. |
| Public method | SetFilters | Replaces current filters in the logical filter with any number of input filters. |

# Properties

|  | Name | Description |
| --- | --- | --- |

# See Also

ElementLogicalFilter Class

Autodesk.Revit.DB Namespace