#### TemporaryGraphicsCommandData Members

---

|  |
| --- |
| TemporaryGraphicsCommandData Class   Methods   Properties   See Also |

The  TemporaryGraphicsCommandData  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  TemporaryGraphicsCommandData |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Document | The document. |
| Public property | Index | The unique index of the temporary graphics object managed by  TemporaryGraphicsManager  . |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

TemporaryGraphicsCommandData Class

Autodesk.Revit.UI Namespace