#### BoundaryValidation Members

---

|  |
| --- |
| BoundaryValidation Class   Methods   Properties   See Also |

The  BoundaryValidation  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  BoundaryValidation |
| Public method Static member | IsValidBoundaryOnSketchPlane | Indicates if the given curve loops compose a valid boundary on the sketch plane. |
| Public method Static member | IsValidBoundaryOnView | Indicates if the given curve loops compose a valid boundary on the view's detail sketch plane. |
| Public method Static member | IsValidHorizontalBoundary | Identifies whether the given curve loops compose a valid horizontal boundary. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

BoundaryValidation Class

Autodesk.Revit.DB Namespace