#### Asset Members

---

|  |
| --- |
| Asset Class   Methods   Properties   See Also |

The  Asset  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | AssetType | The type of RenderingAsset |
| Public property | LibraryName | Library name |
| Public property | Title | Asset title |

# See Also

Asset Class

Autodesk.Revit.DB.Visual Namespace