#### WorksharingUtils Members

---

|  |
| --- |
| WorksharingUtils Class   Methods   Properties   See Also |

The  WorksharingUtils  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | CheckoutElements(Document, ICollection ElementId ) | Obtains ownership for the current user of as many specified elements as possible. |
| Public method Static member | CheckoutElements(Document, ISet ElementId , TransactWithCentralOptions) | Obtains ownership for the current user of as many specified elements as possible. |
| Public method Static member | CheckoutWorksets(Document, ICollection WorksetId ) | Obtains ownership for the current user of as many specified worksets as possible. |
| Public method Static member | CheckoutWorksets(Document, ISet WorksetId , TransactWithCentralOptions) | Obtains ownership for the current user of as many specified worksets as possible. |
| Public method Static member | CreateNewLocal | Takes a path to a central model and copies the model into a new local file for the current user. |
| Public method | Dispose | Releases all resources used by the  WorksharingUtils |
| Public method Static member | GetCheckoutStatus(Document, ElementId) | Gets the ownership status of an element. |
| Public method Static member | GetCheckoutStatus(Document, ElementId, String ) | Gets the ownership status and outputs the owner of an element. |
| Public method Static member | GetModelUpdatesStatus | Gets the status of a single element in the central model. |
| Public method Static member | GetUserWorksetInfo | Gets information about user worksets in a workshared model file, without fully opening the file. |
| Public method Static member | GetWorksharingTooltipInfo | Gets worksharing information about an element to display in an in-canvas tooltip. |
| Public method Static member | RelinquishOwnership | Relinquishes ownership by the current user of as many specified elements and worksets as possible, and grants element ownership requested by other users on a first-come, first-served basis. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

WorksharingUtils Class

Autodesk.Revit.DB Namespace