#### Control Members

---

|  |
| --- |
| Control Class   Methods   Properties   See Also |

The  Control  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Origin | The control origin. |
| Public property | Shape | The control shape. |
| Public property | View | The view. |

# See Also

Control Class

Autodesk.Revit.DB Namespace