#### ExportDGNSettings Members

---

|  |
| --- |
| ExportDGNSettings Class   Methods   Properties   See Also |

The  ExportDGNSettings  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create(Document, String) | Create a DGN export settings with default values. |
| Public method Static member | Create(Document, String, DGNExportOptions) | Create DGN export settings with specified values in DGNExportOptions. |
| Public method Static member | FindByName | Returns the pre-defined non-in-session exporting settings for DGN in the given document with the specified name. |
| Public method Static member | GetActivePredefinedSettings | Returns the active pre-defined non-in-session exporting settings for DGN in the given document. |
| Public method | GetDGNExportOptions | Gets the options stored in the these settings. |
| Public method Static member | ListNames | Returns a list of names of dgn export settings. |
| Public method | SetDGNExportOptions | Sets the options stored in these settings. |

# Properties

|  | Name | Description |
| --- | --- | --- |

# See Also

ExportDGNSettings Class

Autodesk.Revit.DB Namespace