#### ReinforcementData Members

---

|  |
| --- |
| ReinforcementData Class   Methods   Properties   See Also |

The  ReinforcementData  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  ReinforcementData |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

ReinforcementData Class

Autodesk.Revit.DB.Structure Namespace