#### AnalyticalTransferSwitchData Members

---

|  |
| --- |
| AnalyticalTransferSwitchData Class   Methods   Properties   See Also |

The  AnalyticalTransferSwitchData  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | CurrentRating | The current rating value of the electrical analytical transfer switch. |
| Public property | TotalConnectedCurrent | The total connected current of the electrical analytical transfer switch. |
| Public property | Voltage | The voltage value of the electrical analytical transfer switch. |

# See Also

AnalyticalTransferSwitchData Class

Autodesk.Revit.DB.Electrical Namespace