#### InternalOrigin Members

---

|  |
| --- |
| InternalOrigin Class   Methods   Properties   See Also |

The  InternalOrigin  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Get | Gets the internal origin for the document. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Position | The position of the InternalOrigin. |
| Public property | SharedPosition | The position of the InternalOrigin relative to the active ProjectLocation set for the document. |

# See Also

InternalOrigin Class

Autodesk.Revit.DB Namespace