#### SlabShapeCrease Members

---

|  |
| --- |
| SlabShapeCrease Class   Methods   Properties   See Also |

The  SlabShapeCrease  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | CreaseType | The type of the crease. |
| Public property | Curve | The geometry of the crease. |
| Public property | EndPoints | The vertices of the crease. |

# See Also

SlabShapeCrease Class

Autodesk.Revit.DB Namespace