#### PlanViewRange Members

---

|  |
| --- |
| PlanViewRange Class   Methods   Properties   See Also |

The  PlanViewRange  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  PlanViewRange |
| Public method | GetLevelId | Get the element id of the level for a View Depth plane |
| Public method | GetOffset | Get the offset value associated with a View Depth plane |
| Public method | SetLevelId | Set the level for a View Depth plane |
| Public method | SetOffset | Set the offset value associated with a View Depth plane |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | Current | View range for the current plane |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property Static member | LevelAbove | View range for the level above the specified plane |
| Public property Static member | LevelBelow | View range for the level below the specified plane |
| Public property Static member | Unlimited | View range is unlimited |

# See Also

PlanViewRange Class

Autodesk.Revit.DB Namespace