#### AssetPropertyFloatArray Members

---

|  |
| --- |
| AssetPropertyFloatArray Class   Methods   Properties   See Also |

The  AssetPropertyFloatArray  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | GetValue | Get the value of the property. |

# Properties

|  | Name | Description |
| --- | --- | --- |

# See Also

AssetPropertyFloatArray Class

Autodesk.Revit.DB.Visual Namespace