#### Line Members

---

|  |
| --- |
| Line Class   Methods   Properties   See Also |

The  Line  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | CreateBound | Creates a new instance of a bound linear curve. |
| Public method Static member | CreateUnbound | Creates a new instance of an unbound linear curve. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Direction | Returns the direction of the line. |
| Public property | Origin | Returns the origin of the line. |

# See Also

Line Class

Autodesk.Revit.DB Namespace