#### StructuralConnectionType Members

---

|  |
| --- |
| StructuralConnectionType Class   Methods   Properties   See Also |

The  StructuralConnectionType  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create | Create a new StructuralConnectionType, allowing the specified annotation FamilySymbol to be applied to structural members. |
| Public method Static member | GetAllStructuralConnectionTypeIds | Collects the ids of all StructuralConnectionTypes in the document. |
| Public method | GetFamilySymbolId | FamilySymbol of the annotation to use for this connection type. |
| Public method | SetFamilySymbolId | FamilySymbol of the annotation to use for this connection type. |
| Public method Static member | ValidFamilySymbolId | Checks whether the family symbol id is allowed for StructuralConnectionTypes with the given value for the applyTo property. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | ApplyTo | Choose whether this connection type applies to beams and braces, to tops of columns, or to bases of columns. |

# See Also

StructuralConnectionType Class

Autodesk.Revit.DB.Structure Namespace