#### AnalyticalOpening Members

---

|  |
| --- |
| AnalyticalOpening Class   Methods   Properties   See Also |

The  AnalyticalOpening  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create | Creates a new instance of an Analytical Opening within the project. |
| Public method Static member | IsCurveLoopValidForAnalyticalOpening | Checks if curve loop is valid for Analytical Opening. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | PanelId | ElementId of the AnalyticalPanel parent. |

# See Also

AnalyticalOpening Class

Autodesk.Revit.DB.Structure Namespace