#### PipeFittingAndAccessoryPressureDropUIDataItem Members

---

|  |
| --- |
| PipeFittingAndAccessoryPressureDropUIDataItem Class   Methods   Properties   See Also |

The  PipeFittingAndAccessoryPressureDropUIDataItem  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  PipeFittingAndAccessoryPressureDropUIDataItem |
| Public method | GetEntity | Returns the entity set by UI server. or an invalid entity otherwise. |
| Public method | GetPipeFittingAndAccessoryData | Gets the fitting data stored in the UI data item. |
| Public method | SetEntity | Stores the entity in the UI data item. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

PipeFittingAndAccessoryPressureDropUIDataItem Class

Autodesk.Revit.UI.Plumbing Namespace