#### Create Method

---

|  |
| --- |
| Grid Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create(Document, Arc) | Creates a new radial grid line. |
| Public method Static member | Create(Document, Line) | Creates a new grid line. |

# See Also

Grid Class

Grid Members

Autodesk.Revit.DB Namespace

#### Outline Constructor

---

|  |
| --- |
| Outline Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | Outline(Outline) | Constructs a new copy of the input Outline object. |
| Public method | Outline(XYZ, XYZ) | Constructor that uses a minimum and maximum XYZ point to initialize the outline. |

# See Also

Outline Class

Outline Members

Autodesk.Revit.DB Namespace

#### AddTrigger Method

---

|  |
| --- |
| UpdaterRegistry Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | AddTrigger(UpdaterId, ElementFilter, ChangeType) | Adds trigger with the specified element filter and ChangeType for all documents associated with this Updater |
| Public method Static member | AddTrigger(UpdaterId, Document, ElementFilter, ChangeType) | Adds trigger with the specified element filter and ChangeType for the specified document |
| Public method Static member | AddTrigger(UpdaterId, Document, ICollection ElementId , ChangeType) | Adds a trigger to an updater with specified set of elements and ChangeType |

# See Also

UpdaterRegistry Class

UpdaterRegistry Members

Autodesk.Revit.DB Namespace

#### SetCellParamIdAndCategoryId Method

---

|  |
| --- |
| TableSectionData Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | SetCellParamIdAndCategoryId(Int32, ElementId, ElementId) | Sets a column's category and parameter Id |
| Public method | SetCellParamIdAndCategoryId(Int32, Int32, ElementId, ElementId) | Sets a cell's category and parameter Id |

# See Also

TableSectionData Class

TableSectionData Members

Autodesk.Revit.DB Namespace

#### TableMergedCell Constructor

---

|  |
| --- |
| TableMergedCell Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | TableMergedCell | Default constructor. |
| Public method | TableMergedCell(Int32, Int32, Int32, Int32) | Constructor. |

# See Also

TableMergedCell Class

TableMergedCell Members

Autodesk.Revit.DB Namespace

#### Create Method

---

|  |
| --- |
| PathOfTravel Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create(View, XYZ, XYZ) | Creates a new path of travel between two points. |
| Public method Static member | Create(View, XYZ, XYZ, PathOfTravelCalculationStatus ) | Creates a new path of travel between two points and provides creation result status. |

# See Also

PathOfTravel Class

PathOfTravel Members

Autodesk.Revit.DB.Analysis Namespace

#### OverrideGraphicSettings Constructor

---

|  |
| --- |
| OverrideGraphicSettings Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | OverrideGraphicSettings | Creates a new instance of an OverrideGraphicSettings object. |
| Public method | OverrideGraphicSettings(OverrideGraphicSettings) | Creates a new instance of an OverrideGraphicSettings object based on an existing OverrideGraphicSettings object. |

# See Also

OverrideGraphicSettings Class

OverrideGraphicSettings Members

Autodesk.Revit.DB Namespace

#### GetRibbonPanels Method

---

|  |
| --- |
| UIApplication Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | GetRibbonPanels | Get all the custom Panels on Add-Ins tab of Revit. |
| Public method | GetRibbonPanels(String) | Get all the custom Panels on a designated Revit tab. |
| Public method | GetRibbonPanels(Tab) | Get all the custom Panels on a designated standard Revit tab. |

# See Also

UIApplication Class

UIApplication Members

Autodesk.Revit.UI Namespace

#### SetBoldStatus Method

---

|  |
| --- |
| FormattedText Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | SetBoldStatus(Boolean) | Sets the characters in the entire text to be bold or not bold. |
| Public method | SetBoldStatus(TextRange, Boolean) | Sets the characters in a given text range to be bold or not bold. |

# See Also

FormattedText Class

FormattedText Members

Autodesk.Revit.DB Namespace

#### IsValidAccuracy Method

---

|  |
| --- |
| FormatOptions Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | IsValidAccuracy(Double) | Checks whether an accuracy is valid for the display unit in this FormatOptions. |
| Public method Static member | IsValidAccuracy(ForgeTypeId, Double) | Checks whether an accuracy is valid for a given unit. |

# See Also

FormatOptions Class

FormatOptions Members

Autodesk.Revit.DB Namespace

#### FabricationPartSizeMap Constructor

---

|  |
| --- |
| FabricationPartSizeMap Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | FabricationPartSizeMap(String, Double, Double, Boolean) | Creates a new instance of the FabricationPartSizeMap class. |
| Public method | FabricationPartSizeMap(String, Double, Double, Boolean, ConnectorProfileType, Int32, Int32) | Creates a new instance of the FabricationPartSizeMap class. |

# See Also

FabricationPartSizeMap Class

FabricationPartSizeMap Members

Autodesk.Revit.DB.Fabrication Namespace

#### Create Method

---

|  |
| --- |
| Pipe Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create(Document, ElementId, ElementId, Connector, Connector) | Creates a new pipe that connects to two connectors. |
| Public method Static member | Create(Document, ElementId, ElementId, Connector, XYZ) | Creates a new pipe that connects to the connector. |
| Public method Static member | Create(Document, ElementId, ElementId, ElementId, XYZ, XYZ) | Creates a new pipe from two points. |

# See Also

Pipe Class

Pipe Members

Autodesk.Revit.DB.Plumbing Namespace

#### AnalysisDisplayVectorSettings Constructor

---

|  |
| --- |
| AnalysisDisplayVectorSettings Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | AnalysisDisplayVectorSettings | Constructs a default instance of vector settings. |
| Public method | AnalysisDisplayVectorSettings(AnalysisDisplayVectorSettings) | Constructs a new copy of the input AnalysisDisplayVectorSettings object. |

# See Also

AnalysisDisplayVectorSettings Class

AnalysisDisplayVectorSettings Members

Autodesk.Revit.DB.Analysis Namespace

#### FamilyInstanceCreationData Constructor

---

|  |
| --- |
| FamilyInstanceCreationData Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | FamilyInstanceCreationData(Object) | Initializes a new instance of the  FamilyInstanceCreationData  class |
| Public method | FamilyInstanceCreationData(FamilySymbol, IList XYZ ) | Initializes a new instance of the  FamilyInstanceCreationData  class |
| Public method | FamilyInstanceCreationData(Face, Line, FamilySymbol) | Initializes a new instance of the  FamilyInstanceCreationData  class |
| Public method | FamilyInstanceCreationData(XYZ, FamilySymbol, StructuralType) | Initializes a new instance of the  FamilyInstanceCreationData  class |
| Public method | FamilyInstanceCreationData(Curve, FamilySymbol, Level, StructuralType) | Initializes a new instance of the  FamilyInstanceCreationData  class |
| Public method | FamilyInstanceCreationData(Face, XYZ, XYZ, FamilySymbol) | Initializes a new instance of the  FamilyInstanceCreationData  class |
| Public method | FamilyInstanceCreationData(XYZ, FamilySymbol, Element, StructuralType) | Initializes a new instance of the  FamilyInstanceCreationData  class |
| Public method | FamilyInstanceCreationData(XYZ, FamilySymbol, Level, StructuralType) | Initializes a new instance of the  FamilyInstanceCreationData  class |
| Public method | FamilyInstanceCreationData(XYZ, FamilySymbol, Element, Level, StructuralType) | Initializes a new instance of the  FamilyInstanceCreationData  class |
| Public method | FamilyInstanceCreationData(XYZ, FamilySymbol, XYZ, Element, StructuralType) | Initializes a new instance of the  FamilyInstanceCreationData  class |

# See Also

FamilyInstanceCreationData Class

FamilyInstanceCreationData Members

Autodesk.Revit.Creation Namespace

#### BringToFront Method

---

|  |
| --- |
| DetailElementOrderUtils Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | BringToFront(Document, View, ElementId) | Places the given detail instance in the front of all other detail instances in the view. |
| Public method Static member | BringToFront(Document, View, ICollection ElementId ) | Places the given detail instances in the front of all other detail instances in the view, while keeping the order of the given ones. |

# See Also

DetailElementOrderUtils Class

DetailElementOrderUtils Members

Autodesk.Revit.DB Namespace

#### CollectGeometryInfo Method

---

|  |
| --- |
| ExporterIFCUtils Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | CollectGeometryInfo(ExporterIFC, IFCGeometryInfo, GeometryObject, XYZ, Boolean) | Collects all the target geometry from the input geometry object and adds it as IFC handles to the IFCInfo. |
| Public method Static member | CollectGeometryInfo(ExporterIFC, IFCGeometryInfo, GeometryObject, XYZ, Boolean, Transform) | Collects all the target geometry from the input geometry object and adds it as IFC handles to the IFCInfo. |

# See Also

ExporterIFCUtils Class

ExporterIFCUtils Members

Autodesk.Revit.DB.IFC Namespace

#### Import Method

---

|  |
| --- |
| Document Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | Import(String, GBXMLImportOptions) | Imports a Green-Building XML file into the document. |
| Public method | Import(String, AXMImportOptions, View) | Imports an AXM file into the document. |
| Public method | Import(String, ImportOptions3DM, View) | Imports a 3DM file into the document. |
| Public method | Import(String, OBJImportOptions, View) | Imports an OBJ file into the document. |
| Public method | Import(String, SATImportOptions, View) | Imports an SAT file into the document. |
| Public method | Import(String, SKPImportOptions, View) | Imports a SKP file into the document. |
| Public method | Import(String, STLImportOptions, View) | Imports an STL file into the document. |
| Public method | Import(String, DGNImportOptions, View, ElementId ) | Imports a DGN file to the document. |
| Public method | Import(String, DWGImportOptions, View, ElementId ) | Imports a DWG or DXF file to the document. |

# See Also

Document Class

Document Members

Autodesk.Revit.DB Namespace

#### BoundingBoxIntersectsFilter Constructor

---

|  |
| --- |
| BoundingBoxIntersectsFilter Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | BoundingBoxIntersectsFilter(Outline) | Constructs a new instance of a filter to match elements with a bounding box that intersects the given Outline. |
| Public method | BoundingBoxIntersectsFilter(Outline, Boolean) | Constructs a new instance of a filter to match elements with a bounding box that intersects the given Outline, with the option to invert the filter and match all elements with a bounding box that are not intersecting the given Outline. |
| Public method | BoundingBoxIntersectsFilter(Outline, Double) | Constructs a new instance of a filter to match elements with a bounding box that intersects the given Outline. |
| Public method | BoundingBoxIntersectsFilter(Outline, Double, Boolean) | Constructs a new instance of a filter to match elements with a bounding box that intersects the given Outline, with the option to invert the filter and match all elements with a bounding box that are not intersecting the given Outline. |

# See Also

BoundingBoxIntersectsFilter Class

BoundingBoxIntersectsFilter Members

Autodesk.Revit.DB Namespace

#### CreateEqualsRule Method

---

|  |
| --- |
| ParameterFilterRuleFactory Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | CreateEqualsRule(ElementId, ElementId) | Creates a filter rule that determines whether ElementId values from the document equal a certain value. |
| Public method Static member | CreateEqualsRule(ElementId, Int32) | Creates a filter rule that determines whether integer values from the document equal a certain value. |
| Public method Static member | CreateEqualsRule(ElementId, String) | Creates a filter rule that determines whether strings from the document equal a certain value. |
| Public method Static member | CreateEqualsRule(ElementId, Double, Double) | Creates a filter rule that determines whether double-precision values from the document equal a certain value. |
| Public method Static member | CreateEqualsRule(ElementId, String, Boolean) | **Obsolete.**   Creates a filter rule that determines whether strings from the document equal a certain value. |

# See Also

ParameterFilterRuleFactory Class

ParameterFilterRuleFactory Members

Autodesk.Revit.DB Namespace

#### CreateDetailSection Method

---

|  |
| --- |
| AssemblyViewUtils Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | CreateDetailSection(Document, ElementId, AssemblyDetailViewOrientation) | Creates a new detail section assembly view for the assembly instance. |
| Public method Static member | CreateDetailSection(Document, ElementId, AssemblyDetailViewOrientation, ElementId, Boolean) | Creates a new detail section assembly view for the assembly instance. |

# See Also

AssemblyViewUtils Class

AssemblyViewUtils Members

Autodesk.Revit.DB Namespace

#### AddRule Method

---

|  |
| --- |
| RoutingPreferenceManager Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | AddRule(RoutingPreferenceRuleGroupType, RoutingPreferenceRule) | Adds a new routing preference rule to the rule group. |
| Public method | AddRule(RoutingPreferenceRuleGroupType, RoutingPreferenceRule, Int32) | Adds a new routing preference rule to the specified position in the rule group. |

# See Also

RoutingPreferenceManager Class

RoutingPreferenceManager Members

Autodesk.Revit.DB Namespace

#### CreateFromCurves Method

---

|  |
| --- |
| Rebar Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | CreateFromCurves(Document, RebarStyle, RebarBarType, RebarHookType, RebarHookType, Element, XYZ, IList Curve , RebarHookOrientation, RebarHookOrientation, Boolean, Boolean) | Creates a new instance of a shape driven Rebar element within the project. |
| Public method Static member | CreateFromCurves(Document, RebarStyle, RebarBarType, RebarHookType, RebarHookType, Element, XYZ, IList Curve , RebarHookOrientation, RebarHookOrientation, Double, Double, ElementId, ElementId, Boolean, Boolean) | Creates a new instance of a shape driven Rebar element within the project. |

# See Also

Rebar Class

Rebar Members

Autodesk.Revit.DB.Structure Namespace

#### Create Method

---

|  |
| --- |
| PathReinforcement Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create(Document, Element, IList Curve , Boolean, ElementId, ElementId, ElementId, ElementId) | Creates a new PathReinforcement object from an array of curves. The newly created object will use a default Rebar Shape. |
| Public method Static member | Create(Document, Element, IList Curve , Boolean, ElementId, ElementId, ElementId, ElementId, ElementId) | Creates a new PathReinforcement object from an array of curves and given Rebar Shape id. |

# See Also

PathReinforcement Class

PathReinforcement Members

Autodesk.Revit.DB.Structure Namespace

#### SubmitPrint Method

---

|  |
| --- |
| PrintManager Class   See Also |

Print with the current PrintManager settings.

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | SubmitPrint | Print the views and sheets defined in the current local PrintManager settings. |
| Public method | SubmitPrint(View) | Print a view with the current PrintManager settings. |

# See Also

PrintManager Class

PrintManager Members

Autodesk.Revit.DB Namespace

#### ClosestPointsPairBetweenTwoCurves Constructor

---

|  |
| --- |
| ClosestPointsPairBetweenTwoCurves Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | ClosestPointsPairBetweenTwoCurves | Obtain a new instance of ClosestPointsPairBetweenTwoCurves class. |
| Public method | ClosestPointsPairBetweenTwoCurves(ClosestPointsPairBetweenTwoCurves) | Creates a copy of the ClosestPointsPairBetweenTwoCurves. |

# See Also

ClosestPointsPairBetweenTwoCurves Class

ClosestPointsPairBetweenTwoCurves Members

Autodesk.Revit.DB Namespace

#### GetExportId Method

---

|  |
| --- |
| ExportUtils Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | GetExportId(Subelement) | Retrieves the GUID representing the subelement in DWF and IFC export. |
| Public method Static member | GetExportId(Document, ElementId) | Retrieves the GUID representing this element in DWF and IFC export. |

# See Also

ExportUtils Class

ExportUtils Members

Autodesk.Revit.DB Namespace

#### PlanTopology Property

---

|  |
| --- |
| Document Class   See Also |

Gets the PlanTopology of a given level.

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public property | PlanTopology Level | Get the PlanTopology of a given level in the last phase. |
| Public property | PlanTopology Level, Phase | Get the PlanTopology of a given level in a given phase. |

# See Also

Document Class

Document Members

Autodesk.Revit.DB Namespace

#### Get Method

---

|  |
| --- |
| Entity Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | Get FieldType (String) | Retrieves the value of the field in the entity. |
| Public method | Get FieldType (Field) | Retrieves the value of the field in the entity. |
| Public method | Get FieldType (String, ForgeTypeId) | Retrieves the value of the field in the entity. |
| Public method | Get FieldType (Field, ForgeTypeId) | Retrieves the value of the field in the entity. |

# See Also

Entity Class

Entity Members

Autodesk.Revit.DB.ExtensibleStorage Namespace

#### IsValidTarget Method

---

|  |
| --- |
| ColumnAttachment Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | IsValidTarget(Boolean, Element) | Says whether the element can be used as a target for a new attachment. |
| Public method Static member | IsValidTarget(FamilyInstance, Element) | Says whether the element can be used as a target for a new attachment. |

# See Also

ColumnAttachment Class

ColumnAttachment Members

Autodesk.Revit.DB Namespace

#### AnalysisResultSchema Constructor

---

|  |
| --- |
| AnalysisResultSchema Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | AnalysisResultSchema(AnalysisResultSchema) | Constructs a new copy of the input AnalysisResultSchema object. |
| Public method | AnalysisResultSchema(String, String) | Creates object and assigns name and description |

# See Also

AnalysisResultSchema Class

AnalysisResultSchema Members

Autodesk.Revit.DB.Analysis Namespace

#### MassGBXMLExportOptions Constructor

---

|  |
| --- |
| MassGBXMLExportOptions Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | MassGBXMLExportOptions(IList ElementId ) | Constructs a new instance of the options used to export a mass model to gbXML. |
| Public method | MassGBXMLExportOptions(IList ElementId , IList ElementId ) | Constructs a new instance of the options used to export a mass model to gbXML. |

# See Also

MassGBXMLExportOptions Class

MassGBXMLExportOptions Members

Autodesk.Revit.DB.Analysis Namespace

#### DoubleParameterValue Constructor

---

|  |
| --- |
| DoubleParameterValue Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | DoubleParameterValue | Default constructor |
| Public method | DoubleParameterValue(Double) | Value constructor |

# See Also

DoubleParameterValue Class

DoubleParameterValue Members

Autodesk.Revit.DB Namespace

#### AsValueString Method

---

|  |
| --- |
| Parameter Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | AsValueString | Get the parameter value as a string with units. |
| Public method | AsValueString(FormatOptions) | Get the parameter value as a string with units. |

# See Also

Parameter Class

Parameter Members

Autodesk.Revit.DB Namespace

#### DWFImportOptions Constructor

---

|  |
| --- |
| DWFImportOptions Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | DWFImportOptions(DWFImportOptions) | Constructs a new instance of DWFImportOptions as a copy of the import options. |
| Public method | DWFImportOptions(IList ElementId ) | Constructs a new instance of DWFImportOptions with an array of imported sheet views. |

# See Also

DWFImportOptions Class

DWFImportOptions Members

Autodesk.Revit.DB Namespace

#### NewFamilyInstance Method

---

|  |
| --- |
| Document Class   See Also |

Inserts a new instance of a family into the document.

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | NewFamilyInstance(Curve, FamilySymbol, Level, StructuralType) | Inserts a new instance of a family into the document, using a curve, type/symbol and reference level. |
| Public method | NewFamilyInstance(XYZ, FamilySymbol, Level, StructuralType) | Inserts a new instance of a family into the document, using a location, type/symbol and a base level. |
| Public method | NewFamilyInstance(XYZ, FamilySymbol, Element, Level, StructuralType) | Inserts a new instance of a family into the document, using a location, type/symbol, the host element and a base level. |

# See Also

Document Class

Document Members

Autodesk.Revit.Creation Namespace

#### GetPointCloudScanOverrideSettings Method

---

|  |
| --- |
| PointCloudOverrides Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | GetPointCloudScanOverrideSettings(ElementId) | Gets scan override settings assigned to the whole PointCloudInstance element. |
| Public method | GetPointCloudScanOverrideSettings(ElementId, String, Document) | Gets override settings assigned to a particular scan within a PointCloudInstance element. |

# See Also

PointCloudOverrides Class

PointCloudOverrides Members

Autodesk.Revit.DB.PointClouds Namespace

#### Print Method

---

|  |
| --- |
| View Class   See Also |

Print this view.

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | Print | Print this view with the default view template and using the print setting of the current active document. |
| Public method | Print(Boolean) | Print this view with the default view template, and either the view's document's print setting or the print setting of the current active document. |
| Public method | Print(View) | Print this view with the given view template and using the print setting of the current active document. |
| Public method | Print(View, Boolean) | Print this view with the given view template, and either the view's document's print setting or the print setting of the current active document. |

# See Also

View Class

View Members

Autodesk.Revit.DB Namespace

#### Link Method

---

|  |
| --- |
| Document Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | Link(String, DWFImportOptions) | Links Markups in a DWF file into the project document. |
| Public method | Link(String, ImportOptions3DM, View) | Links a 3DM file into the project document. |
| Public method | Link(String, OBJImportOptions, View) | Links an OBJ file into the project document. |
| Public method | Link(String, SATImportOptions, View) | Links an SAT file into the project document. |
| Public method | Link(String, SKPImportOptions, View) | Links a SKP file into the project document. |
| Public method | Link(String, STLImportOptions, View) | Links an STL file into the project document. |
| Public method | Link(String, DGNImportOptions, View, ElementId ) | Links a DGN file into the project document. |
| Public method | Link(String, DWGImportOptions, View, ElementId ) | Links a DWG or DXF file into the project document. |

# See Also

Document Class

Document Members

Autodesk.Revit.DB Namespace

#### Create Method

---

|  |
| --- |
| FabricationPart Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create(Document, FabricationItemFile, ElementId) | Creates a fabrication part element from a fabrication item file. |
| Public method Static member | Create(Document, FabricationServiceButton, Int32, ElementId) | Creates a fabrication part element based on button. |
| Public method Static member | Create(Document, FabricationServiceButton, Double, Double, ElementId) | Creates a fabrication part element based on button and size. |

# See Also

FabricationPart Class

FabricationPart Members

Autodesk.Revit.DB Namespace

#### Save Method

---

|  |
| --- |
| Document Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | Save | Saves the document. |
| Public method | Save(SaveOptions) | Saves the document. |

# See Also

Document Class

Document Members

Autodesk.Revit.DB Namespace

#### InstanceBinding Constructor

---

|  |
| --- |
| InstanceBinding Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | InstanceBinding | Constructs an empty instance binding. |
| Public method | InstanceBinding(CategorySet) | Constructs an instance binding with the set of categories passed. |

# See Also

InstanceBinding Class

InstanceBinding Members

Autodesk.Revit.DB Namespace

#### IsFailureResolutionPermitted Method

---

|  |
| --- |
| FailuresAccessor Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | IsFailureResolutionPermitted | Checks if resolution of failures is permitted. |
| Public method | IsFailureResolutionPermitted(FailureMessageAccessor) | Checks if default resolution of the failure is permitted. |
| Public method | IsFailureResolutionPermitted(FailureMessageAccessor, FailureResolutionType) | Checks if resolution of the failure using given resolution type is permitted. |

# See Also

FailuresAccessor Class

FailuresAccessor Members

Autodesk.Revit.DB Namespace

#### DockablePane Constructor

---

|  |
| --- |
| DockablePane Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | DockablePane(DockablePane) | Constructs a new copy of the input DockablePane object. |
| Public method | DockablePane(DockablePaneId) | Gets the pane with identifier %id%. |

# See Also

DockablePane Class

DockablePane Members

Autodesk.Revit.UI Namespace

#### Equals Method

---

|  |
| --- |
| EdgeEndPoint Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | Equals(EdgeEndPoint) | Determines whether this EdgeEndPoint is equal to another. |

# See Also

EdgeEndPoint Class

EdgeEndPoint Members

Autodesk.Revit.DB Namespace

#### GetAssociatedZoneEquipment Method

---

|  |
| --- |
| ZoneEquipment Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | GetAssociatedZoneEquipment(Document, ElementId) | Gets the associated zone equipment of the specified analytical space. |
| Public method Static member | GetAssociatedZoneEquipment(Document, ISet ElementId ) | Gets the associated zone equipment of all specified analytical spaces. |

# See Also

ZoneEquipment Class

ZoneEquipment Members

Autodesk.Revit.DB.Mechanical Namespace

#### OpenDocumentFile Method

---

|  |
| --- |
| Application Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | OpenDocumentFile(String) | Opens a document from disk. |
| Public method | OpenDocumentFile(ModelPath, OpenOptions) | Opens a document from disk or cloud. |
| Public method | OpenDocumentFile(ModelPath, OpenOptions, IOpenFromCloudCallback) | Opens a document from disk or cloud. |

# See Also

Application Class

Application Members

Autodesk.Revit.ApplicationServices Namespace

#### Create Method

---

|  |
| --- |
| StructuralConnectionHandler Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create(Document, IList ElementId , ElementId) | Creates a new instance of a Structural Connection Handler, which defines the connection between given elements. |
| Public method Static member | Create(Document, IList ElementId , String) | Creates custom StructuralConnectionHandlerType and StructuralConnectionHandler. |
| Public method Static member | Create(Document, IList ElementId , ElementId, IList ConnectionInputPoint ) | Creates a new instance of a Structural Connection Handler, which is defined by the elements to connect and the additional points. |

# See Also

StructuralConnectionHandler Class

StructuralConnectionHandler Members

Autodesk.Revit.DB.Structure Namespace

#### GetMaximumAllowedWidth Method

---

|  |
| --- |
| TextElement Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | GetMaximumAllowedWidth | Returns the maximum width the text element can be assigned. |
| Public method Static member | GetMaximumAllowedWidth(Document, ElementId) | Returns the maximum width the text element can be created with. |

# See Also

TextElement Class

TextElement Members

Autodesk.Revit.DB Namespace

#### ElementParameterFilter Constructor

---

|  |
| --- |
| ElementParameterFilter Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | ElementParameterFilter(FilterRule) | Constructs a new instance of an ElementParameterFilter from a single rule. |
| Public method | ElementParameterFilter(IList FilterRule ) | Constructs a new instance of an ElementParameterFilter from a set of rules. |
| Public method | ElementParameterFilter(FilterRule, Boolean) | Constructs a new instance of an ElementParameterFilter, with the option to match all elements not passing a given filter rule. |
| Public method | ElementParameterFilter(IList FilterRule , Boolean) | Constructs a new instance of an ElementParameterFilter, with the option to match all elements not passing the given filter rules. |

# See Also

ElementParameterFilter Class

ElementParameterFilter Members

Autodesk.Revit.DB Namespace

#### ElementMulticategoryFilter Constructor

---

|  |
| --- |
| ElementMulticategoryFilter Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | ElementMulticategoryFilter(ICollection BuiltInCategory ) | Constructs a new instance of a filter to match elements by built-in category. |
| Public method | ElementMulticategoryFilter(ICollection ElementId ) | Constructs a new instance of a filter to find elements whose category matches any of a given set of categories. |
| Public method | ElementMulticategoryFilter(ICollection BuiltInCategory , Boolean) | Constructs a new instance of a filter to match elements by built-in category, with the option to match all elements which are not of the given category. |
| Public method | ElementMulticategoryFilter(ICollection ElementId , Boolean) | Constructs a new instance of a filter to find elements whose category matches any of a given set of categories, with the option to instead match elements which are not of the given categories. |

# See Also

ElementMulticategoryFilter Class

ElementMulticategoryFilter Members

Autodesk.Revit.DB Namespace

#### AddSpatialFieldPrimitive Method

---

|  |
| --- |
| SpatialFieldManager Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | AddSpatialFieldPrimitive | Creates empty analysis results primitive not associated with any geometry element |
| Public method | AddSpatialFieldPrimitive(Reference) | Creates an empty analysis results primitive associated with a reference. |
| Public method | AddSpatialFieldPrimitive(Curve, Transform) | Creates empty analysis results primitive associated with a curve and a transform. |
| Public method | AddSpatialFieldPrimitive(Face, Transform) | Creates empty analysis results primitive associated with a face and a transform. |
| Public method | AddSpatialFieldPrimitive(Reference, SpatialFieldPrimitiveHideMode) | Creates an empty analysis results primitive associated with a reference, with the option to control how the reference element is hidden. |

# See Also

SpatialFieldManager Class

SpatialFieldManager Members

Autodesk.Revit.DB.Analysis Namespace

#### DGNExportOptions Constructor

---

|  |
| --- |
| DGNExportOptions Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | DGNExportOptions | Constructs a new instance of DGNExportOptions with default values of all properties. |
| Public method | DGNExportOptions(DGNExportOptions) | Constructs a new instance of DGNExportOptions as a copy of the export options. |

# See Also

DGNExportOptions Class

DGNExportOptions Members

Autodesk.Revit.DB Namespace

#### SetTessellationSettings Method

---

|  |
| --- |
| STLExportOptions Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | SetTessellationSettings(ExportResolution) | Sets all the tessellation parameters to its predefined values for the given resolution type. |
| Public method | SetTessellationSettings(STLExportResolution) | **Obsolete.**   Sets all the tessellation parameters to its predefined values for the given resolution type. |

# See Also

STLExportOptions Class

STLExportOptions Members

Autodesk.Revit.DB Namespace

#### Create Method

---

|  |
| --- |
| ParameterFilterElement Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create(Document, String, ICollection ElementId ) | Creates a new ParameterFilterElement in the given document. |
| Public method Static member | Create(Document, String, ICollection ElementId , ElementFilter) | Creates a new ParameterFilterElement in the given document. |

# See Also

ParameterFilterElement Class

ParameterFilterElement Members

Autodesk.Revit.DB Namespace

#### NewInstanceBinding Method

---

|  |
| --- |
| Application Class   See Also |

Creates a new instance binding object.

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | NewInstanceBinding | Creates a new empty instance binding object. |
| Public method | NewInstanceBinding(CategorySet) | Creates a new instance binding object containing the categories passed as a parameter. |

# See Also

Application Class

Application Members

Autodesk.Revit.Creation Namespace

#### CreateGreaterOrEqualRule Method

---

|  |
| --- |
| ParameterFilterRuleFactory Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | CreateGreaterOrEqualRule(ElementId, ElementId) | Creates a filter rule that determines whether ElementId values from the document are greater than or equal to a certain value. |
| Public method Static member | CreateGreaterOrEqualRule(ElementId, Int32) | Creates a filter rule that determines whether integer values from the document are greater than or equal to a certain value. |
| Public method Static member | CreateGreaterOrEqualRule(ElementId, String) | Creates a filter rule that determines whether strings from the document are greater than or equal to a certain value. |
| Public method Static member | CreateGreaterOrEqualRule(ElementId, Double, Double) | Creates a filter rule that determines whether double-precision values from the document are greater than or equal to a certain value. |
| Public method Static member | CreateGreaterOrEqualRule(ElementId, String, Boolean) | **Obsolete.**   Creates a filter rule that determines whether strings from the document are greater than or equal to a certain value. |

# See Also

ParameterFilterRuleFactory Class

ParameterFilterRuleFactory Members

Autodesk.Revit.DB Namespace

#### CreateConduitConnector Method

---

|  |
| --- |
| ConnectorElement Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | CreateConduitConnector(Document, Reference) | Create a new conduit ConnectorElement. |
| Public method Static member | CreateConduitConnector(Document, Reference, Edge) | Create a new conduit ConnectorElement. |

# See Also

ConnectorElement Class

ConnectorElement Members

Autodesk.Revit.DB Namespace

#### KeynoteEntry Constructor

---

|  |
| --- |
| KeynoteEntry Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | KeynoteEntry(String, String) | Constructs a new KeynoteEntry from the given key name and keynote text. KeynoteEntry objects created from this constructor will not have parents. |
| Public method | KeynoteEntry(String, String, String) | Constructs a new KeynoteEntry from the given key name, parent key name, and keynote text. |

# See Also

KeynoteEntry Class

KeynoteEntry Members

Autodesk.Revit.DB Namespace

#### OBJImportOptions Constructor

---

|  |
| --- |
| OBJImportOptions Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | OBJImportOptions | Constructs a new instance of OBJImportOptions with default values of all properties. |
| Public method | OBJImportOptions(OBJImportOptions) | Constructs a new instance of OBJImportOptions as a copy of the import options. |

# See Also

OBJImportOptions Class

OBJImportOptions Members

Autodesk.Revit.DB Namespace

#### NewLineBoundaryConditions Method

---

|  |
| --- |
| Document Class   See Also |

Creates a new Line BoundaryConditions element.

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | NewLineBoundaryConditions(Element, TranslationRotationValue, Double, TranslationRotationValue, Double, TranslationRotationValue, Double, TranslationRotationValue, Double) | Creates a new Line BoundaryConditions element on a host element. |
| Public method | NewLineBoundaryConditions(Reference, TranslationRotationValue, Double, TranslationRotationValue, Double, TranslationRotationValue, Double, TranslationRotationValue, Double) | Creates a new Line BoundaryConditions element on a reference. |

# See Also

Document Class

Document Members

Autodesk.Revit.Creation Namespace

#### CheckoutWorksets Method

---

|  |
| --- |
| WorksharingUtils Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | CheckoutWorksets(Document, ICollection WorksetId ) | Obtains ownership for the current user of as many specified worksets as possible. |
| Public method Static member | CheckoutWorksets(Document, ISet WorksetId , TransactWithCentralOptions) | Obtains ownership for the current user of as many specified worksets as possible. |

# See Also

WorksharingUtils Class

WorksharingUtils Members

Autodesk.Revit.DB Namespace

#### GetWireCenterlines Method

---

|  |
| --- |
| FabricSheet Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | GetWireCenterlines | Gets a list of curves representing the wires centerlines of the Fabric Sheet in the both distribution directions. |
| Public method | GetWireCenterlines(WireDistributionDirection) | Gets a list of curves representing the wires centerlines of the Fabric Sheet. |

# See Also

FabricSheet Class

FabricSheet Members

Autodesk.Revit.DB.Structure Namespace

#### DXFExportOptions Constructor

---

|  |
| --- |
| DXFExportOptions Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | DXFExportOptions | Constructs a new instance of DXFImportOptions with default values of all properties. |
| Public method | DXFExportOptions(DXFExportOptions) | Constructs a new instance of DXFImportOptions as a copy of the export options. |

# See Also

DXFExportOptions Class

DXFExportOptions Members

Autodesk.Revit.DB Namespace

#### GetRuleDescription Method

---

|  |
| --- |
| PerformanceAdviser Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | GetRuleDescription(Int32) | Retrieves the description of the rule. |
| Public method | GetRuleDescription(PerformanceAdviserRuleId) | Retrieves the description of the rule. |

# See Also

PerformanceAdviser Class

PerformanceAdviser Members

Autodesk.Revit.DB Namespace

#### Format Method

---

|  |
| --- |
| UnitFormatUtils Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Format(Units, ForgeTypeId, Double, Boolean) | Formats a number with units into a string. |
| Public method Static member | Format(Units, ForgeTypeId, Double, Boolean, FormatValueOptions) | Formats a number with units into a string. |

# See Also

UnitFormatUtils Class

UnitFormatUtils Members

Autodesk.Revit.DB Namespace

#### FormattedText Constructor

---

|  |
| --- |
| FormattedText Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | FormattedText | Creates a new default FormattedText object, which contains only a carriage return character and has no formatting. |
| Public method | FormattedText(String) | Creates a new FormattedText object with unformatted text. |

# See Also

FormattedText Class

FormattedText Members

Autodesk.Revit.DB Namespace

#### Start Method

---

|  |
| --- |
| Transaction Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | Start | Starts the transaction. |
| Public method | Start(String) | Starts the transaction with an assigned name. |

# See Also

Transaction Class

Transaction Members

Autodesk.Revit.DB Namespace

#### Create Method

---

|  |
| --- |
| FlexPipe Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create(Document, ElementId, ElementId, ElementId, IList XYZ ) | Creates a new flexible pipe into the document, using a point array and flex pipe type. |
| Public method Static member | Create(Document, ElementId, ElementId, ElementId, XYZ, XYZ, IList XYZ ) | Creates a new flexible pipe into the document, using a point array and flex pipe type. |

# See Also

FlexPipe Class

FlexPipe Members

Autodesk.Revit.DB.Plumbing Namespace

#### GetAddedElementIds Method

---

|  |
| --- |
| DocumentChangedEventArgs Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | GetAddedElementIds | Returns set of elements newly added to the document. |
| Public method | GetAddedElementIds(ElementFilter) | Returns set of newly added elements that pass the filter. |

# See Also

DocumentChangedEventArgs Class

DocumentChangedEventArgs Members

Autodesk.Revit.DB.Events Namespace

#### RegisterUpdater Method

---

|  |
| --- |
| UpdaterRegistry Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | RegisterUpdater(IUpdater) | Registers an updater application-wide, which means the updater may get triggered in any open document. |
| Public method Static member | RegisterUpdater(IUpdater, Document) | Registers the updater for a specified document, which means the updater can only be triggered by changes made in that document. |
| Public method Static member | RegisterUpdater(IUpdater, Boolean) | Registers an updater application-wide, which means the updater may get triggered in any open document. |
| Public method Static member | RegisterUpdater(IUpdater, Document, Boolean) | Registers the updater for a specified document, which means the updater can only be triggered by changes made in that document. |

# See Also

UpdaterRegistry Class

UpdaterRegistry Members

Autodesk.Revit.DB Namespace

#### Create Method

---

|  |
| --- |
| DirectShapeType Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create(Document, String, ElementId) | Creates a DirectShapeType element. |
| Public method Static member | Create(Document, String, ElementId, DirectShapeTypeOptions) | Creates a DirectShapeType element. |

# See Also

DirectShapeType Class

DirectShapeType Members

Autodesk.Revit.DB Namespace

#### DWGImportOptions Constructor

---

|  |
| --- |
| DWGImportOptions Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | DWGImportOptions | Constructs a new instance of DWGImportOptions with default values of all properties. |
| Public method | DWGImportOptions(DWGImportOptions) | Constructs a new instance of DWGImportOptions as a copy of the import options. |

# See Also

DWGImportOptions Class

DWGImportOptions Members

Autodesk.Revit.DB Namespace

#### GetFailureMessages Method

---

|  |
| --- |
| FailuresAccessor Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | GetFailureMessages | Provides access to the individual failure messages currently posted in the document. |
| Public method | GetFailureMessages(FailureSeverity) | Provides access to the individual failure messages if a given severity currently posted in the document. |

# See Also

FailuresAccessor Class

FailuresAccessor Members

Autodesk.Revit.DB Namespace

#### ElementFilterIsAcceptableForParameterFilterElement Method

---

|  |
| --- |
| ParameterFilterElement Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | ElementFilterIsAcceptableForParameterFilterElement(ElementFilter) | Checks that an ElementFilter is acceptable for use in defining the filtering rules for a ParameterFilterElement (i.e., for view filtering). |
| Public method Static member | ElementFilterIsAcceptableForParameterFilterElement(Document, ISet ElementId , ElementFilter) | Checks that an ElementFilter is acceptable for use in defining the filtering rules for a given list of categories (i.e., for view filtering). |

# See Also

ParameterFilterElement Class

ParameterFilterElement Members

Autodesk.Revit.DB Namespace

#### StringParameterValue Constructor

---

|  |
| --- |
| StringParameterValue Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | StringParameterValue | Default constructor |
| Public method | StringParameterValue(String) | Value constructor |

# See Also

StringParameterValue Class

StringParameterValue Members

Autodesk.Revit.DB Namespace

#### SATExportOptions Constructor

---

|  |
| --- |
| SATExportOptions Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | SATExportOptions | Constructs a new instance of SATImportOptions with default values of all properties. |
| Public method | SATExportOptions(SATExportOptions) | Constructs a new instance of SATImportOptions as a copy of the export options. |

# See Also

SATExportOptions Class

SATExportOptions Members

Autodesk.Revit.DB Namespace

#### STLExportOptions Constructor

---

|  |
| --- |
| STLExportOptions Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | STLExportOptions | Constructs a new instance of STLExportOptions with default values of all properties. |
| Public method | STLExportOptions(ExportResolution) | Constructs a new instance of STLExportOptions with all predefined tessellation settings, depending on export resolution type. Note: in case of Custom resolution type, tessellation settings won't be predefined and will have default values. |
| Public method | STLExportOptions(STLExportResolution) | **Obsolete.**   Constructs a new instance of STLExportOptions with all predefined tessellation settings, depending on STL export resolution type. Note: in case of Custom resolution type, tessellation settings won't be predefined and will have default values. |

# See Also

STLExportOptions Class

STLExportOptions Members

Autodesk.Revit.DB Namespace

#### CreatePartList Method

---

|  |
| --- |
| AssemblyViewUtils Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | CreatePartList(Document, ElementId) | Creates a new part list multicategory schedule assembly view for the assembly instance. |
| Public method Static member | CreatePartList(Document, ElementId, ElementId, Boolean) | Creates a new part list multicategory schedule assembly view for the assembly instance. |

# See Also

AssemblyViewUtils Class

AssemblyViewUtils Members

Autodesk.Revit.DB Namespace

#### CreateCableTrayConnector Method

---

|  |
| --- |
| ConnectorElement Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | CreateCableTrayConnector(Document, Reference) | Create a new cable tray ConnectorElement. |
| Public method Static member | CreateCableTrayConnector(Document, Reference, Edge) | Create a new cable tray ConnectorElement. |

# See Also

ConnectorElement Class

ConnectorElement Members

Autodesk.Revit.DB Namespace

#### CreateFaceGeometryInfo Method

---

|  |
| --- |
| IFCGeometryInfo Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | CreateFaceGeometryInfo(Double) | Creates a new container object which holds IfcFace handles processed from a Revit geometry object. |
| Public method Static member | CreateFaceGeometryInfo(Double, Boolean) | Creates a new container object which holds IfcFace handles processed from a Revit geometry object. |
| Public method Static member | CreateFaceGeometryInfo(ExporterIFC, Plane, XYZ, Double, Boolean) | Creates a new container object which holds IfcFace handles processed from a Revit geometry object. |

# See Also

IFCGeometryInfo Class

IFCGeometryInfo Members

Autodesk.Revit.DB.IFC Namespace

#### NewRadialDimension Method

---

|  |
| --- |
| FamilyItemFactory Class   See Also |

Creates a new radial dimension object.

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | NewRadialDimension(View, Reference, XYZ) | Creates a new radial dimension object using the default dimension type. |
| Public method | NewRadialDimension(View, Reference, XYZ, DimensionType) | Generate a new radial dimension object using a specified dimension type. |

# See Also

FamilyItemFactory Class

FamilyItemFactory Members

Autodesk.Revit.Creation Namespace

#### LinePatternSegment Constructor

---

|  |
| --- |
| LinePatternSegment Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | LinePatternSegment | Creates a line pattern segment. |
| Public method | LinePatternSegment(LinePatternSegmentType, Double) | Creates a line pattern segment with given type and length. |

# See Also

LinePatternSegment Class

LinePatternSegment Members

Autodesk.Revit.DB Namespace

#### SetSegmentAs180DegreeBend Method

---

|  |
| --- |
| RebarShapeDefinitionBySegments Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | SetSegmentAs180DegreeBend(Int32) | Indicates that a segment is a "virtual" segment introduced to describe a 180-degree bend. The radius of the bend will be taken from the Bar Type. |
| Public method | SetSegmentAs180DegreeBend(Int32, ElementId, Boolean) | Indicate that a segment is a "virtual" segment introduced to describe a 180-degree bend. The radius of the bend will be driven by radiusParam. |

# See Also

RebarShapeDefinitionBySegments Class

RebarShapeDefinitionBySegments Members

Autodesk.Revit.DB.Structure Namespace

#### ExportFontInfo Constructor

---

|  |
| --- |
| ExportFontInfo Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | ExportFontInfo | Constructs a new default ExportFontInfo. |
| Public method | ExportFontInfo(String) | Constructs a new ExportFontInfo using the destination font name as input. |
| Public method | ExportFontInfo(ExportFontInfo) | Constructs a new copy of the input ExportFontInfo object. |

# See Also

ExportFontInfo Class

ExportFontInfo Members

Autodesk.Revit.DB Namespace

#### Read Method

---

|  |
| --- |
| IFCFile Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | Read(IFCFileReadOptions) | Reads content from a file of IFC format. |
| Public method | Read(IFCFileReadOptions, Int32 , Int32 ) | Reads content from a file of IFC format. |

# See Also

IFCFile Class

IFCFile Members

Autodesk.Revit.DB.IFC Namespace

#### TypeBinding Constructor

---

|  |
| --- |
| TypeBinding Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | TypeBinding | Constructs an empty type binding. |
| Public method | TypeBinding(CategorySet) | Constructs a type binding with the set of categories passed. |

# See Also

TypeBinding Class

TypeBinding Members

Autodesk.Revit.DB Namespace

#### LogicalAndFilter Constructor

---

|  |
| --- |
| LogicalAndFilter Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | LogicalAndFilter(IList ElementFilter ) | Constructs a new instance of the logical filter with any number of input filters. |
| Public method | LogicalAndFilter(ElementFilter, ElementFilter) | Constructs a new instance of the logical filter with two input filters. |

# See Also

LogicalAndFilter Class

LogicalAndFilter Members

Autodesk.Revit.DB Namespace

#### PlanTopologies Property

---

|  |
| --- |
| Document Class   See Also |

Gets the PlanTopologies of the current project.

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public property | PlanTopologies | Get the PlanTopologies of the current project in the last phase. |
| Public property | PlanTopologies Phase | Gets the PlanTopologies of the current project in a given phase. |

# See Also

Document Class

Document Members

Autodesk.Revit.DB Namespace

#### VectorAtPoint Constructor

---

|  |
| --- |
| VectorAtPoint Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | VectorAtPoint(VectorAtPoint) | Creates a copy of the given VectorAtPoint instance. |
| Public method | VectorAtPoint(IList XYZ ) | Creates object from an array of vectors |

# See Also

VectorAtPoint Class

VectorAtPoint Members

Autodesk.Revit.DB.Analysis Namespace

#### CanSetValue Method

---

|  |
| --- |
| ColorFillSchemeEntry Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | CanSetValue(Double) | Checks whether  StorageType  of entry is Double and the value is no less than 0.0. |
| Public method | CanSetValue(Int32) | Checks whether  StorageType  of entry is Integer. |
| Public method | CanSetValue(ElementId) | Checks whether  StorageType  of entry is ElementId. |

# See Also

ColorFillSchemeEntry Class

ColorFillSchemeEntry Members

Autodesk.Revit.DB Namespace

#### AnalysisDisplayLegendSettings Constructor

---

|  |
| --- |
| AnalysisDisplayLegendSettings Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | AnalysisDisplayLegendSettings | Constructs a default instance of legend settings. |
| Public method | AnalysisDisplayLegendSettings(AnalysisDisplayLegendSettings) | Constructs a new copy of the input AnalysisDisplayLegendSettings object. |

# See Also

AnalysisDisplayLegendSettings Class

AnalysisDisplayLegendSettings Members

Autodesk.Revit.DB.Analysis Namespace

#### SetAttribute Method

---

|  |
| --- |
| IFCAnyHandle Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | SetAttribute(String, IFCAnyHandle) | Sets the attribute value. |
| Public method | SetAttribute(String, IFCData) | Sets the attribute value. |
| Public method | SetAttribute(String, Boolean) | Sets the attribute value. |
| Public method | SetAttribute(String, IList IFCAnyHandle ) |  |
| Public method | SetAttribute(String, IList Boolean ) |  |
| Public method | SetAttribute(String, IList Double ) |  |
| Public method | SetAttribute(String, IList Int32 ) |  |
| Public method | SetAttribute(String, IList String ) |  |
| Public method | SetAttribute(String, ISet IFCAnyHandle ) |  |
| Public method | SetAttribute(String, ISet Boolean ) |  |
| Public method | SetAttribute(String, ISet Double ) |  |
| Public method | SetAttribute(String, ISet Int32 ) |  |
| Public method | SetAttribute(String, ISet String ) |  |
| Public method | SetAttribute(String, Double) | Sets the attribute value. |
| Public method | SetAttribute(String, Int32) | Sets the attribute value. |
| Public method | SetAttribute(String, String) | Sets the attribute value. |

# See Also

IFCAnyHandle Class

IFCAnyHandle Members

Autodesk.Revit.DB.IFC Namespace

#### Duplicate Method

---

|  |
| --- |
| ViewSheet Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | Duplicate(SheetDuplicateOption) | Duplicates this sheet to generate a new one. |

# See Also

ViewSheet Class

ViewSheet Members

Autodesk.Revit.DB Namespace

#### ExportPatternInfo Constructor

---

|  |
| --- |
| ExportPatternInfo Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | ExportPatternInfo | Constructs a new default ExportPatternInfo. |
| Public method | ExportPatternInfo(String) | Constructs a new ExportPatternInfo using the destination pattern name as input. |
| Public method | ExportPatternInfo(ExportPatternInfo) | Constructs a new copy of the input ExportPatternInfo object. |

# See Also

ExportPatternInfo Class

ExportPatternInfo Members

Autodesk.Revit.DB Namespace

#### TableCellStyle Constructor

---

|  |
| --- |
| TableCellStyle Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | TableCellStyle | Constructs a new TableCellStyle with default settings. |
| Public method | TableCellStyle(TableCellStyle) | Constructs a new copy of the input TableCellStyle object. |

# See Also

TableCellStyle Class

TableCellStyle Members

Autodesk.Revit.DB Namespace

#### ExportPatternKey Constructor

---

|  |
| --- |
| ExportPatternKey Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | ExportPatternKey | Constructs a new default ExportPatternKey. |
| Public method | ExportPatternKey(ExportPatternKey) | Constructs a new copy of the input ExportPatternKey object. |
| Public method | ExportPatternKey(FillPatternTarget, String) | Constructs a new ExportPatternKey using the original fill pattern type and name as input. |

# See Also

ExportPatternKey Class

ExportPatternKey Members

Autodesk.Revit.DB Namespace

#### BoundingBoxContainsPointFilter Constructor

---

|  |
| --- |
| BoundingBoxContainsPointFilter Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | BoundingBoxContainsPointFilter(XYZ) | Constructs a new instance of a filter to match elements with a bounding box that contains the given point. |
| Public method | BoundingBoxContainsPointFilter(XYZ, Boolean) | Constructs a new instance of a filter to match elements with a bounding box that contains the given point, with the option to invert the filter and match all elements with a bounding box that do not contain the given point. |
| Public method | BoundingBoxContainsPointFilter(XYZ, Double) | Constructs a new instance of a filter to match elements with a bounding box that contains the given point, while specifying the tolerance to be used in deciding if the point matches the criteria. |
| Public method | BoundingBoxContainsPointFilter(XYZ, Double, Boolean) | Constructs a new instance of a filter to match elements with a bounding box that contains the given point, while specifying the tolerance to be used in deciding if the point matches the criteria. This constructor includes the option to invert the filter and match all elements with a bounding box that do not contain the given point. |

# See Also

BoundingBoxContainsPointFilter Class

BoundingBoxContainsPointFilter Members

Autodesk.Revit.DB Namespace

#### CheckGroundPlane Method

---

|  |
| --- |
| EnergyDataSettings Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | CheckGroundPlane(ElementId) | The ground plane should be an Element of type Level. This method checks to confirm that an ElementId is for a Level element. |
| Public method Static member | CheckGroundPlane(Document, ElementId) | The ground plane should be an Element of type Level. This method checks to confirm that an ElementId is for a Level element. |

# See Also

EnergyDataSettings Class

EnergyDataSettings Members

Autodesk.Revit.DB.Analysis Namespace

#### LoadFamily Method

---

|  |
| --- |
| Document Class   See Also |

Loads a family and all its types/symbols into the document.

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | LoadFamily(String) | Loads an entire family and all its types/symbols into the document. |
| Public method | LoadFamily(Document) | Loads the contents of this family document into another document. |
| Public method | LoadFamily(String, Family ) | Loads an entire family and all its types/symbols into the document and provides a reference to the loaded family. |
| Public method | LoadFamily(Document, IFamilyLoadOptions) | Loads the contents of this family document into another document. |
| Public method | LoadFamily(String, IFamilyLoadOptions, Family ) | Loads an entire family and all its types/symbols into the document and provides a reference to the loaded family. |

# See Also

Document Class

Document Members

Autodesk.Revit.DB Namespace

#### GetMacroManager Method

---

|  |
| --- |
| UIMacroManager Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | GetMacroManager(UIApplication) | Gets the UI Macro manager from the UI application. |
| Public method Static member | GetMacroManager(UIDocument) | Gets the UI Macro manager from the UI document. |

# See Also

UIMacroManager Class

UIMacroManager Members

Autodesk.Revit.UI.Macros Namespace

#### AddCommandLink Method

---

|  |
| --- |
| TaskDialog Class   See Also |

Adds a CommandLink to the TaskDialog.

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | AddCommandLink(TaskDialogCommandLinkId, String) | Adds a CommandLink associated to the given id, displaying the indicating main content. |
| Public method | AddCommandLink(TaskDialogCommandLinkId, String, String) | Adds a CommandLink associated to the given id, displaying the indicating main and supporting content. |

# See Also

TaskDialog Class

TaskDialog Members

Autodesk.Revit.UI Namespace

#### CurveElementFilter Constructor

---

|  |
| --- |
| CurveElementFilter Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | CurveElementFilter(CurveElementType) | Constructs a new instance of a filter to match specific types of curve elements. |
| Public method | CurveElementFilter(CurveElementType, Boolean) | Constructs a new instance of a filter to match specific types of curve elements, with the option to match all curves which are not of the given curve type. |

# See Also

CurveElementFilter Class

CurveElementFilter Members

Autodesk.Revit.DB Namespace

#### FromRoom Property

---

|  |
| --- |
| FamilyInstance Class   See Also |

The "From Room" set for the door or window.

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public property | FromRoom | The "From Room" set for the door or window in the last phase of the project. |
| Public property | FromRoom Phase |  |

# See Also

FamilyInstance Class

FamilyInstance Members

Autodesk.Revit.DB Namespace

#### RollBack Method

---

|  |
| --- |
| Transaction Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | RollBack | Rolls back all changes made to the model during the transaction. |
| Public method | RollBack(FailureHandlingOptions) | Rolls back all changes made to the model during the transaction. |

# See Also

Transaction Class

Transaction Members

Autodesk.Revit.DB Namespace

#### Evaluate Method

---

|  |
| --- |
| FilterNumericRuleEvaluator Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | Evaluate(Int32, Int32) | Derived classes should override this method to implement the desired test. |
| Public method | Evaluate(Double, Double, Double) | Derived classes override this method to implement the test that determines whether the two given double-precision values satisfy the desired condition or not. |

# See Also

FilterNumericRuleEvaluator Class

FilterNumericRuleEvaluator Members

Autodesk.Revit.DB Namespace

#### ProcessIFCProject Method

---

|  |
| --- |
| ImporterIFC Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | ProcessIFCProject(IFCAnyHandle) | The entry point to the native IFC import function. Processes the main IfcProject and creates appropriate Revit elements. |
| Public method | ProcessIFCProject(IFCAnyHandle, IDictionary IFCAnyHandle, ElementId ) |  |

# See Also

ImporterIFC Class

ImporterIFC Members

Autodesk.Revit.DB.IFC Namespace

#### WorksetKindFilter Constructor

---

|  |
| --- |
| WorksetKindFilter Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | WorksetKindFilter(WorksetKind) | Constructs a new instance of WorksetKindFilter filter to match worksets of the given WorksetKind. |
| Public method | WorksetKindFilter(WorksetKind, Boolean) | Constructs a new instance of WorksetKindFilter filter to match worksets of the given WorksetKind. |

# See Also

WorksetKindFilter Class

WorksetKindFilter Members

Autodesk.Revit.DB Namespace

#### GetSpaceAtPoint Method

---

|  |
| --- |
| Document Class   See Also |

Gets a space containing the point.

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | GetSpaceAtPoint(XYZ) | Gets a space containing the point. |
| Public method | GetSpaceAtPoint(XYZ, Phase) | Gets a space containing the point. |

# See Also

Document Class

Document Members

Autodesk.Revit.DB Namespace

#### Rehost Method

---

|  |
| --- |
| Form Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | Rehost(Reference, XYZ) | Rehost Form to edge, face or curve. |
| Public method | Rehost(SketchPlane, XYZ) | Rehost Form to sketch plane |

# See Also

Form Class

Form Members

Autodesk.Revit.DB Namespace

#### ScheduleSortGroupField Constructor

---

|  |
| --- |
| ScheduleSortGroupField Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | ScheduleSortGroupField | Creates a new ScheduleSortGroupField. |
| Public method | ScheduleSortGroupField(ScheduleFieldId) | Creates a new ScheduleSortGroupField. |
| Public method | ScheduleSortGroupField(ScheduleFieldId, ScheduleSortOrder) | Creates a new ScheduleSortGroupField. |

# See Also

ScheduleSortGroupField Class

ScheduleSortGroupField Members

Autodesk.Revit.DB Namespace

#### Create Method

---

|  |
| --- |
| FabricSheet Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create(Document, Element, ElementId) | Creates a new instance of a single flat Fabric Sheet element within the project. |
| Public method Static member | Create(Document, ElementId, ElementId, CurveLoop) | Creates a new instance of a single bent Fabric Sheet element within the project. |

# See Also

FabricSheet Class

FabricSheet Members

Autodesk.Revit.DB.Structure Namespace

#### Export Method

---

|  |
| --- |
| Document Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | Export(String, IList ElementId , PDFExportOptions) | Exports a selection of views in PDF format. |
| Public method | Export(String, String, MassGBXMLExportOptions) | **Obsolete.**   Exports a gbXML file from a mass model document. |
| Public method | Export(String, String, GBXMLExportOptions) | Export the model in gbXML (green-building) format. |
| Public method | Export(String, String, IFCExportOptions) | Exports the document to the Industry Standard Classes (IFC) format. |
| Public method | Export(String, String, NavisworksExportOptions) | Exports a Revit project to the Navisworks .nwc format. |
| Public method | Export(String, String, OBJExportOptions) | Exports a view specified in the export options to the OBJ format. |
| Public method | Export(String, String, STLExportOptions) | Exports a view specified in the export options to the STL format. |
| Public method | Export(String, String, ViewSet, DWFExportOptions) | Exports the current view or a selection of views in DWF format. |
| Public method | Export(String, String, ViewSet, DWFXExportOptions) | Exports the current view or a selection of views in DWFX format. |
| Public method | Export(String, String, ViewSet, FBXExportOptions) | Exports the document in 3D-Studio Max (FBX) format. |
| Public method | Export(String, String, ICollection ElementId , DGNExportOptions) | Exports a selection of views in DGN format. |
| Public method | Export(String, String, ICollection ElementId , DWGExportOptions) | Exports a selection of views in DWG format. |
| Public method | Export(String, String, ICollection ElementId , DXFExportOptions) | Exports a selection of views in DXF format. |
| Public method | Export(String, String, ICollection ElementId , SATExportOptions) | Exports the current view or a selection of views in SAT format. |

# See Also

Document Class

Document Members

Autodesk.Revit.DB Namespace

#### InsertField Method

---

|  |
| --- |
| ScheduleDefinition Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | InsertField(SchedulableField, Int32) | Adds a regular field at the specified position in the list. |
| Public method | InsertField(ScheduleFieldType, Int32) | Adds a regular field at the specified position in the list. |
| Public method | InsertField(ScheduleFieldType, ElementId, Int32) | Adds a regular field at the specified position in the list. |

# See Also

ScheduleDefinition Class

ScheduleDefinition Members

Autodesk.Revit.DB Namespace

#### ElementIsElementTypeFilter Constructor

---

|  |
| --- |
| ElementIsElementTypeFilter Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | ElementIsElementTypeFilter | Constructs a new instance of a filter to match only ElementTypes. |
| Public method | ElementIsElementTypeFilter(Boolean) | Constructs a new instance of a filter to match only ElementTypes, with the option to match all elements which are not ElementTypes. |

# See Also

ElementIsElementTypeFilter Class

ElementIsElementTypeFilter Members

Autodesk.Revit.DB Namespace

#### BoundingBoxUV Constructor

---

|  |
| --- |
| BoundingBoxUV Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | BoundingBoxUV | default constructor |
| Public method | BoundingBoxUV(Double, Double, Double, Double) | Creates object with supplied values. |

# See Also

BoundingBoxUV Class

BoundingBoxUV Members

Autodesk.Revit.DB Namespace

#### InitialFluxIntensity Constructor

---

|  |
| --- |
| InitialFluxIntensity Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | InitialFluxIntensity(Double) | Creates an initial flux intensity object with the given document and flux values. |
| Public method | InitialFluxIntensity(InitialFluxIntensity) | Creates a copy of the given initial flux intensity object |

# See Also

InitialFluxIntensity Class

InitialFluxIntensity Members

Autodesk.Revit.DB.Lighting Namespace

#### ExportLinetypeKey Constructor

---

|  |
| --- |
| ExportLinetypeKey Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | ExportLinetypeKey | Constructs a new default ExportLinetypeKey. |
| Public method | ExportLinetypeKey(String) | Constructs a new default ExportLinetypeKey using the original line type name as input. |
| Public method | ExportLinetypeKey(ExportLinetypeKey) | Constructs a new copy of the input ExportLinetypeKey object. |

# See Also

ExportLinetypeKey Class

ExportLinetypeKey Members

Autodesk.Revit.DB Namespace

#### TransactionGroup Constructor

---

|  |
| --- |
| TransactionGroup Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | TransactionGroup(Document) | Constructs a transaction group object. |
| Public method | TransactionGroup(Document, String) | It constructs a transaction group object |

# See Also

TransactionGroup Class

TransactionGroup Members

Autodesk.Revit.DB Namespace

#### GetActiveServerId Method

---

|  |
| --- |
| SingleServerService Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | GetActiveServerId | Returns the Id of the currently active application-level server of the service. |
| Public method | GetActiveServerId(Document) | Returns the Id of the server currently associated with the given document for the service. |

# See Also

SingleServerService Class

SingleServerService Members

Autodesk.Revit.DB.ExternalService Namespace

#### UnregisterUpdater Method

---

|  |
| --- |
| UpdaterRegistry Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | UnregisterUpdater(UpdaterId) | Removes the updater associated with the input id from the UpdaterRegistry. Also removes all triggers associated with the Updater. |
| Public method Static member | UnregisterUpdater(UpdaterId, Document) | Unregisters an updater for the given document. |

# See Also

UpdaterRegistry Class

UpdaterRegistry Members

Autodesk.Revit.DB Namespace

#### Get Method

---

|  |
| --- |
| Alignment Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Get(Element) | Returns an  Alignment  object given a Revit alignment element. |
| Public method Static member | Get(Document, Guid) | Returns an  Alignment  in the document given its GUID. |

# See Also

Alignment Class

Alignment Members

Autodesk.Revit.DB.Infrastructure Namespace

#### Create Method

---

|  |
| --- |
| Arc Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create(XYZ, XYZ, XYZ) | Creates a new geometric arc object based on three points. |
| Public method Static member | Create(Plane, Double, Double, Double) | Creates a new geometric arc object based on plane, radius, and angles. |
| Public method Static member | Create(XYZ, Double, Double, Double, XYZ, XYZ) | Creates a new geometric arc object based on center, radius, unit vectors, and angles. |

# See Also

Arc Class

Arc Members

Autodesk.Revit.DB Namespace

#### GetCellType Method

---

|  |
| --- |
| TableSectionData Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | GetCellType(Int32) | Returns a column's cell type and if no type exists for this column, it would come from the section |
| Public method | GetCellType(Int32, Int32) | Returns a cell's Type and if no Type exists for this cell, it would come from the column, or the row, or the section |

# See Also

TableSectionData Class

TableSectionData Members

Autodesk.Revit.DB Namespace

#### CreateGreaterRule Method

---

|  |
| --- |
| ParameterFilterRuleFactory Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | CreateGreaterRule(ElementId, ElementId) | Creates a filter rule that determines whether ElementId values from the document are greater than a certain value. |
| Public method Static member | CreateGreaterRule(ElementId, Int32) | Creates a filter rule that determines whether integer values from the document are greater than a certain value. |
| Public method Static member | CreateGreaterRule(ElementId, String) | Creates a filter rule that determines whether strings from the document are greater than a certain value. |
| Public method Static member | CreateGreaterRule(ElementId, Double, Double) | Creates a filter rule that determines whether double-precision values from the document are greater than a certain value. |
| Public method Static member | CreateGreaterRule(ElementId, String, Boolean) | **Obsolete.**   Creates a filter rule that determines whether strings from the document are greater than a certain value. |

# See Also

ParameterFilterRuleFactory Class

ParameterFilterRuleFactory Members

Autodesk.Revit.DB Namespace

#### SpotLightDistribution Constructor

---

|  |
| --- |
| SpotLightDistribution Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | SpotLightDistribution | Creates a spot light distribution object with the following values;  * PI/6 radians spot beam angle * PI/2 radians spot field angle * PI/6 radians tilt angle |
| Public method | SpotLightDistribution(SpotLightDistribution) | Creates a copy of the given spotlight distribution |
| Public method | SpotLightDistribution(Double, Double, Double) | Creates a spot light distribution object with the given values. |

# See Also

SpotLightDistribution Class

SpotLightDistribution Members

Autodesk.Revit.DB.Lighting Namespace

#### Create Method

---

|  |
| --- |
| BeamSystem Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create(Document, IList Curve , SketchPlane, Int32) | Creates a 2D BeamSystem with specified profile curves. |
| Public method Static member | Create(Document, IList Curve , Level, XYZ, Boolean) | Creates a new BeamSystem with specified profile curves. |
| Public method Static member | Create(Document, IList Curve , Level, Int32, Boolean) | Creates a new BeamSystem with specified profile curves. |
| Public method Static member | Create(Document, IList Curve , SketchPlane, XYZ, Boolean) | Creates a new BeamSystem with specified profile curves. |

# See Also

BeamSystem Class

BeamSystem Members

Autodesk.Revit.DB Namespace

#### NumericRevisionSettings Constructor

---

|  |
| --- |
| NumericRevisionSettings Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | NumericRevisionSettings | Constructs a NumericRevisionSettings with a simple, default numbering sequence. |
| Public method | NumericRevisionSettings(NumericRevisionSettings) | Constructs a new copy of the input NumericRevisionSettings object. |
| Public method | NumericRevisionSettings(Int32, String, String) | Constructs a NumericRevisionSettings object. |

# See Also

NumericRevisionSettings Class

NumericRevisionSettings Members

Autodesk.Revit.DB Namespace

#### CreateDuctConnector Method

---

|  |
| --- |
| ConnectorElement Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | CreateDuctConnector(Document, DuctSystemType, ConnectorProfileType, Reference) | Create a new duct ConnectorElement. |
| Public method Static member | CreateDuctConnector(Document, DuctSystemType, ConnectorProfileType, Reference, Edge) | Create a new duct ConnectorElement. |

# See Also

ConnectorElement Class

ConnectorElement Members

Autodesk.Revit.DB Namespace

#### GetLabelFor Method

---

|  |
| --- |
| LabelUtils Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | GetLabelFor(BuiltInCategory) | Gets the user-visible name for a BuiltInCategory. |
| Public method Static member | GetLabelFor(BuiltInParameter) | Gets the user-visible name for a BuiltInParameter. |
| Public method Static member | GetLabelFor(BuiltInParameterGroup) | Gets the user-visible name for a BuiltInParameterGroup. |
| Public method Static member | GetLabelFor(BuiltInParameter, LanguageType) | Gets the user-visible name for a BuiltInParameter in a specific LanguageType. |
| Public method Static member | GetLabelFor(DuctLossMethodType, Document) | Gets the user-visible name for a DuctLossMethodType. |
| Public method Static member | GetLabelFor(gbXMLBuildingType, Document) | Gets the user-visible name for a gbXMLBuildingType. |
| Public method Static member | GetLabelFor(PipeFlowState, Document) | Gets the user-visible name for a PipeFlowState. |
| Public method Static member | GetLabelFor(PipeLossMethodType, Document) | Gets the user-visible name for a PipeLossMethodType. |

# See Also

LabelUtils Class

LabelUtils Members

Autodesk.Revit.DB Namespace

#### SetItalicStatus Method

---

|  |
| --- |
| FormattedText Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | SetItalicStatus(Boolean) | Sets the characters in the entire text to be italic or not italic. |
| Public method | SetItalicStatus(TextRange, Boolean) | Sets the characters in a given text range to be italic or not italic. |

# See Also

FormattedText Class

FormattedText Members

Autodesk.Revit.DB Namespace

#### GetAllExternalResourceReferences Method

---

|  |
| --- |
| ExternalResourceUtils Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | GetAllExternalResourceReferences(Document) | Gets the ids of all elements which refer to external resources. |
| Public method Static member | GetAllExternalResourceReferences(Document, ExternalResourceType) | Gets the ids of all elements which refer to a specific type of external resource. |

# See Also

ExternalResourceUtils Class

ExternalResourceUtils Members

Autodesk.Revit.DB Namespace

#### GetPointLineZone Method

---

|  |
| --- |
| FillGrid Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | GetPointLineZone(UV) | Gets the index of fill grid line closest to the input 2d point. |
| Public method | GetPointLineZone(UV, UV ) | Gets the index of fill grid line and the point on the grid line nearest to the input point. |

# See Also

FillGrid Class

FillGrid Members

Autodesk.Revit.DB Namespace

#### Options Constructor

---

|  |
| --- |
| Options Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | Options | Creates a default Options object. |
| Public method | Options(Options) | Copy constructor. |

# See Also

Options Class

Options Members

Autodesk.Revit.DB Namespace

#### ElementIdParameterValue Constructor

---

|  |
| --- |
| ElementIdParameterValue Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | ElementIdParameterValue | Default constructor |
| Public method | ElementIdParameterValue(ElementId) | Value constructor |

# See Also

ElementIdParameterValue Class

ElementIdParameterValue Members

Autodesk.Revit.DB Namespace

#### IsUserAssignableParameterGroup Method

---

|  |
| --- |
| FamilyManager Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | IsUserAssignableParameterGroup(BuiltInParameterGroup) | Checks if the given parameter group can be assigned to new parameters. |
| Public method | IsUserAssignableParameterGroup(ForgeTypeId) | Checks if the given parameter group can be assigned to new parameters. |

# See Also

FamilyManager Class

FamilyManager Members

Autodesk.Revit.DB Namespace

#### Insert Method

---

|  |
| --- |
| BindingMap Class   See Also |

Creates a new parameter binding.

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | Insert(Definition, Binding) | Creates a new parameter binding between a parameter and a set of categories. (Overrides  DefinitionBindingMap Insert(Definition, Binding)  .) |
| Public method | Insert(Definition, Binding, BuiltInParameterGroup) | Creates a new parameter binding between a parameter and a set of categories in a specified group. |
| Public method | Insert(Definition, Binding, ForgeTypeId) | Creates a new parameter binding between a parameter and a set of categories in a specified group. |

# See Also

BindingMap Class

BindingMap Members

Autodesk.Revit.DB Namespace

#### TryParse Method

---

|  |
| --- |
| UnitFormatUtils Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | TryParse(Units, ForgeTypeId, String, Double ) | Parses a formatted string into a number with units if possible. |
| Public method Static member | TryParse(Units, ForgeTypeId, String, ValueParsingOptions, Double ) | Parses a formatted string into a number with units if possible. |
| Public method Static member | TryParse(Units, ForgeTypeId, String, Double , String ) | Parses a formatted string into a number with units if possible. |
| Public method Static member | TryParse(Units, ForgeTypeId, String, ValueParsingOptions, Double , String ) | Parses a formatted string into a number with units if possible. |

# See Also

UnitFormatUtils Class

UnitFormatUtils Members

Autodesk.Revit.DB Namespace

#### AnalysisDisplayDiagramSettings Constructor

---

|  |
| --- |
| AnalysisDisplayDiagramSettings Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | AnalysisDisplayDiagramSettings | Constructs a default instance of diagram settings. |
| Public method | AnalysisDisplayDiagramSettings(AnalysisDisplayDiagramSettings) | Constructs a new copy of the input AnalysisDisplayDiagramSettings object. |

# See Also

AnalysisDisplayDiagramSettings Class

AnalysisDisplayDiagramSettings Members

Autodesk.Revit.DB.Analysis Namespace

#### ForgeTypeId Constructor

---

|  |
| --- |
| ForgeTypeId Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | ForgeTypeId | Constructs a ForgeTypeId holding an empty schema identifier. |
| Public method | ForgeTypeId(String) | Constructs a ForgeTypeId holding the given schema identifier. |

# See Also

ForgeTypeId Class

ForgeTypeId Members

Autodesk.Revit.DB Namespace

#### Create Method

---

|  |
| --- |
| Wall Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create(Document, IList Curve , Boolean) | Creates a non rectangular profile wall within the project using the default wall type. |
| Public method Static member | Create(Document, Curve, ElementId, Boolean) | Creates a new rectangular profile wall within the project using the default wall style. |
| Public method Static member | Create(Document, IList Curve , ElementId, ElementId, Boolean) | Creates a non rectangular profile wall within the project using the specified wall type. |
| Public method Static member | Create(Document, IList Curve , ElementId, ElementId, Boolean, XYZ) | Creates a non rectangular profile wall within the project using the specified wall type and normal vector. |
| Public method Static member | Create(Document, Curve, ElementId, ElementId, Double, Double, Boolean, Boolean) | Creates a new rectangular profile wall within the project using the specified wall type, height, and offset. |

# See Also

Wall Class

Wall Members

Autodesk.Revit.DB Namespace

#### NewSweptBlend Method

---

|  |
| --- |
| FamilyItemFactory Class   See Also |

Adds a new swept blend into the family document.

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | NewSweptBlend(Boolean, Reference, SweepProfile, SweepProfile) | Adds a new swept blend into the family document, using a selected reference as the path. |
| Public method | NewSweptBlend(Boolean, Curve, SketchPlane, SweepProfile, SweepProfile) | Add a new swept blend into the family document, using a curve as the path. |

# See Also

FamilyItemFactory Class

FamilyItemFactory Members

Autodesk.Revit.Creation Namespace

#### IsValidType Method

---

|  |
| --- |
| Element Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | IsValidType(ElementId) | Checks if given type is valid for this element. |
| Public method Static member | IsValidType(Document, ICollection ElementId , ElementId) | Checks if given type is valid for the set of elements. |

# See Also

Element Class

Element Members

Autodesk.Revit.DB Namespace

#### RectangleLightShape Constructor

---

|  |
| --- |
| RectangleLightShape Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | RectangleLightShape | Creates a rectangle light shape object with 4.0' emit length and a 2.0' emit width. |
| Public method | RectangleLightShape(RectangleLightShape) | Creates a copy of the given rectangle light shape |
| Public method | RectangleLightShape(Double, Double) | Creates a rectangle light shape object with the given emit length and width. |

# See Also

RectangleLightShape Class

RectangleLightShape Members

Autodesk.Revit.DB.Lighting Namespace

#### ToRoom Property

---

|  |
| --- |
| FamilyInstance Class   See Also |

The "To Room" set for the door or window.

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public property | ToRoom | The "To Room" set for the door or window in the last phase of the project. |
| Public property | ToRoom Phase |  |

# See Also

FamilyInstance Class

FamilyInstance Members

Autodesk.Revit.DB Namespace

#### ElementCategoryFilter Constructor

---

|  |
| --- |
| ElementCategoryFilter Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | ElementCategoryFilter(BuiltInCategory) | Constructs a new instance of a filter to match elements by category. |
| Public method | ElementCategoryFilter(ElementId) | Constructs a new instance of a filter to match elements by category. |
| Public method | ElementCategoryFilter(BuiltInCategory, Boolean) | Constructs a new instance of a filter to match elements by category, with the option to match all elements which are not of the given category. |
| Public method | ElementCategoryFilter(ElementId, Boolean) | Constructs a new instance of a filter to match elements by category, with the option to match all elements which are of the given category. |

# See Also

ElementCategoryFilter Class

ElementCategoryFilter Members

Autodesk.Revit.DB Namespace

#### ViewScheduleExportOptions Constructor

---

|  |
| --- |
| ViewScheduleExportOptions Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | ViewScheduleExportOptions | Constructs a new instance of the ViewScheduleExportOptions class |
| Public method | ViewScheduleExportOptions(ViewScheduleExportOptions) | Constructs a new copy of the input ViewScheduleExportOptions object. |

# See Also

ViewScheduleExportOptions Class

ViewScheduleExportOptions Members

Autodesk.Revit.DB Namespace

#### TextRange Constructor

---

|  |
| --- |
| TextRange Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | TextRange | Constructs a TextRange with default values for start and length. |
| Public method | TextRange(TextRange) | Constructs a copy of the input TextRange object. |
| Public method | TextRange(Int32, Int32) | Constructs a TextRange with input start and length. |

# See Also

TextRange Class

TextRange Members

Autodesk.Revit.DB Namespace

#### SaveAs Method

---

|  |
| --- |
| UIDocument Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | SaveAs | Saves the document to a file name obtained from the Revit user without prompting the user to overwrite file if it exists. |
| Public method | SaveAs(UISaveAsOptions) | Saves the document to a file name obtained from the Revit user optionally prompting the user to overwrite file if it exists. |

# See Also

UIDocument Class

UIDocument Members

Autodesk.Revit.UI Namespace

#### Create Method

---

|  |
| --- |
| FilledRegion Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create(Document, ElementId, ElementId, IList CurveLoop ) | Creates a view-specific filled region from the given boundaries. |
| Public method Static member | Create(Document, ElementId, SketchPlane, IList CurveLoop ) | Creates a filled region on a sketch plane in a 3d model family. |

# See Also

FilledRegion Class

FilledRegion Members

Autodesk.Revit.DB Namespace

#### CreateSweptGeometry Method

---

|  |
| --- |
| GeometryCreationUtilities Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | CreateSweptGeometry(CurveLoop, Int32, Double, IList CurveLoop ) | Creates a solid by sweeping one or more closed coplanar curve loops along a path. |
| Public method Static member | CreateSweptGeometry(CurveLoop, Int32, Double, IList CurveLoop , SolidOptions) | Creates a solid by sweeping one or more closed coplanar curve loops along a path. |

# See Also

GeometryCreationUtilities Class

GeometryCreationUtilities Members

Autodesk.Revit.DB Namespace

#### ElementMulticlassFilter Constructor

---

|  |
| --- |
| ElementMulticlassFilter Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | ElementMulticlassFilter(IList Type ) | Constructs a new instance of a filter to find elements whose Element subclasses matches any of a given set of input classes. |
| Public method | ElementMulticlassFilter(IList Type , Boolean) | Constructs a new instance of a filter to find elements whose Element subclasses matches any of a given set of input classes, with an option to instead match elements whose Element subclass does not match the list of input classes. |

# See Also

ElementMulticlassFilter Class

ElementMulticlassFilter Members

Autodesk.Revit.DB Namespace

#### GetCellCategoryId Method

---

|  |
| --- |
| TableSectionData Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | GetCellCategoryId(Int32) | Returns a column's ParamId Associated with the paramId to find the correct element |
| Public method | GetCellCategoryId(Int32, Int32) | Returns a cell's CategoryId and if no CategoryId exists for this cell, it would come from the column. Associated with the paramId to find the correct element. |

# See Also

TableSectionData Class

TableSectionData Members

Autodesk.Revit.DB Namespace

#### SplitRegion Method

---

|  |
| --- |
| CompoundStructure Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | SplitRegion(UV, RectangularGridSegmentOrientation) | Splits the region which contains the specified grid point by a line with the specified direction. |
| Public method | SplitRegion(UV, RectangularGridSegmentOrientation, Int32 ) | Splits the region which contains the specified grid point by a line with the specified direction. |

# See Also

CompoundStructure Class

CompoundStructure Members

Autodesk.Revit.DB Namespace

#### ExecuteService Method

---

|  |
| --- |
| ExternalServiceRegistry Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | ExecuteService(Guid, IExternalData) | Execute a service independently of any document. |
| Public method Static member | ExecuteService(Guid, Document, IExternalData) | Execute the service for the given document. |
| Public method Static member | ExecuteService(Guid, Guid, IExternalData) | Execute the service by the given server. |

# See Also

ExternalServiceRegistry Class

ExternalServiceRegistry Members

Autodesk.Revit.DB.ExternalService Namespace

#### CreateBeginsWithRule Method

---

|  |
| --- |
| ParameterFilterRuleFactory Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | CreateBeginsWithRule(ElementId, String) | Creates a filter rule that determines whether strings from the document begin with a certain string value. |
| Public method Static member | CreateBeginsWithRule(ElementId, String, Boolean) | **Obsolete.**   Creates a filter rule that determines whether strings from the document begin with a certain string value. |

# See Also

ParameterFilterRuleFactory Class

ParameterFilterRuleFactory Members

Autodesk.Revit.DB Namespace

#### DGNImportOptions Constructor

---

|  |
| --- |
| DGNImportOptions Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | DGNImportOptions | Constructs a new instance of DGNImportOptions with default values of all properties. |
| Public method | DGNImportOptions(DGNImportOptions) | Constructs a new instance of DGNImportOptions as a copy of the import options. |

# See Also

DGNImportOptions Class

DGNImportOptions Members

Autodesk.Revit.DB Namespace

#### NewFamilyInstance Method

---

|  |
| --- |
| ItemFactoryBase Class   See Also |

Inserts a new instance of a family into the document.

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | NewFamilyInstance(Face, Line, FamilySymbol) | Inserts a new instance of a family onto a face of an existing element, using a line on that face for its position, and a type/symbol. |
| Public method | NewFamilyInstance(Line, FamilySymbol, View) | Add a line based detail family instance into the Autodesk Revit document, using an line and a view where the instance should be placed. |
| Public method | NewFamilyInstance(Reference, Line, FamilySymbol) | Inserts a new instance of a family onto a face referenced by the input Reference instance, using a line on that face for its position, and a type/symbol. |
| Public method | NewFamilyInstance(XYZ, FamilySymbol, StructuralType) | Inserts a new instance of a family into the document, using a location and a type/symbol. |
| Public method | NewFamilyInstance(XYZ, FamilySymbol, View) | Add a new family instance into the Autodesk Revit document, using an origin and a view where the instance should be placed. |
| Public method | NewFamilyInstance(Face, XYZ, XYZ, FamilySymbol) | Inserts a new instance of a family onto a face of an existing element, using a location, reference direction, and a type/symbol. |
| Public method | NewFamilyInstance(Reference, XYZ, XYZ, FamilySymbol) | Inserts a new instance of a family onto a face referenced by the input Reference instance, using a location, reference direction, and a type/symbol. |
| Public method | NewFamilyInstance(XYZ, FamilySymbol, Element, StructuralType) | Inserts a new instance of a family into the document, using a location, type/symbol, and the host element. |
| Public method | NewFamilyInstance(XYZ, FamilySymbol, XYZ, Element, StructuralType) | Inserts a new instance of a family into the document, using a location, type/symbol, the host element and a reference direction. |

# See Also

ItemFactoryBase Class

ItemFactoryBase Members

Autodesk.Revit.Creation Namespace

#### NewDimension Method

---

|  |
| --- |
| ItemFactoryBase Class   See Also |

Creates a new linear dimension object.

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | NewDimension(View, Line, ReferenceArray) | Creates a new linear dimension object using the default dimension style. |
| Public method | NewDimension(View, Line, ReferenceArray, DimensionType) | Creates a new linear dimension object using the specified dimension style. |

# See Also

ItemFactoryBase Class

ItemFactoryBase Members

Autodesk.Revit.Creation Namespace

#### ElementIsCurveDrivenFilter Constructor

---

|  |
| --- |
| ElementIsCurveDrivenFilter Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | ElementIsCurveDrivenFilter | Constructs a new instance of a filter to match only curve driven elements. |
| Public method | ElementIsCurveDrivenFilter(Boolean) | Constructs a new instance of a filter to match only curve driven elements, with the option to match all elements which are not curve driven elements. |

# See Also

ElementIsCurveDrivenFilter Class

ElementIsCurveDrivenFilter Members

Autodesk.Revit.DB Namespace

#### CreateFromIFC Method

---

|  |
| --- |
| RevitLinkType Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | CreateFromIFC(Document, ExternalResourceReference, String, Boolean, RevitLinkOptions) | Creates a new Revit link type from an existing Revit file created via import by reference of an asscoiated IFC file. |
| Public method Static member | CreateFromIFC(Document, String, String, Boolean, RevitLinkOptions) | Creates a new Revit link type from an existing Revit file created via import by reference of an asscoiated IFC file. |

# See Also

RevitLinkType Class

RevitLinkType Members

Autodesk.Revit.DB Namespace

#### Create Method

---

|  |
| --- |
| IFCProductWrapper Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create(IFCProductWrapper) | Establishes a new product manager for elements and objects derived from a parent product manager. |
| Public method Static member | Create(ExporterIFC, Boolean) | Establishes a new baseline product manager for elements and objects. |
| Public method Static member | Create(IFCProductWrapper, Boolean) | Establishes a new product manager for elements and objects derived from a parent product manager, allowing override of allowRelateToLevel |

# See Also

IFCProductWrapper Class

IFCProductWrapper Members

Autodesk.Revit.DB.IFC Namespace

#### WallSweepInfo Constructor

---

|  |
| --- |
| WallSweepInfo Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | WallSweepInfo(Boolean, WallSweepType) | Constructs a new WallSweepInfo instance. |
| Public method | WallSweepInfo(WallSweepType, Boolean) | Constructs a new WallSweepInfo instance. |

# See Also

WallSweepInfo Class

WallSweepInfo Members

Autodesk.Revit.DB Namespace

#### GetTopLevelLink Method

---

|  |
| --- |
| RevitLinkType Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | GetTopLevelLink(Document, ExternalResourceReference) | Returns the ElementId of the (top-level) linked model with the given ExternalResourceReference. |
| Public method Static member | GetTopLevelLink(Document, ModelPath) | Returns the ElementId of the (top-level) linked model with the given path. |

# See Also

RevitLinkType Class

RevitLinkType Members

Autodesk.Revit.DB Namespace

#### IsInside Method

---

|  |
| --- |
| Face Class   See Also |

Indicates whether the specified point is within this face.

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | IsInside(UV) | Indicates whether the specified point is within this face. |
| Public method | IsInside(UV, IntersectionResult ) | Indicates whether the specified point is within this face and outputs additional information about the point location. |

# See Also

Face Class

Face Members

Autodesk.Revit.DB Namespace

#### AlphanumericRevisionSettings Constructor

---

|  |
| --- |
| AlphanumericRevisionSettings Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | AlphanumericRevisionSettings | Constructs an AlphanumericRevisionSettings with a simple, default sequence. |
| Public method | AlphanumericRevisionSettings(AlphanumericRevisionSettings) | Constructs a new copy of the input AlphanumericRevisionSettings object. |
| Public method | AlphanumericRevisionSettings(IList String , String, String) | Constructs an AlphanumericRevisionSettings object. |

# See Also

AlphanumericRevisionSettings Class

AlphanumericRevisionSettings Members

Autodesk.Revit.DB Namespace

#### Rectangle Constructor

---

|  |
| --- |
| Rectangle Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | Rectangle | Create an empty Rectangle instance with values (0,0,0,0). |
| Public method | Rectangle(Rectangle) | Constructs a new copy of the input ScreenRectangle object. |
| Public method | Rectangle(Int32, Int32, Int32, Int32) | Creates an Rectangle instance with the specified four integers that represent the left, top, right and bottom of a rectangle. |

# See Also

Rectangle Class

Rectangle Members

Autodesk.Revit.DB Namespace

#### GetAlignments Method

---

|  |
| --- |
| Alignment Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | GetAlignments(Document) | Returns all alignments in the given document. |
| Public method Static member | GetAlignments(View) | Returns all alignments visible in the given view. |

# See Also

Alignment Class

Alignment Members

Autodesk.Revit.DB.Infrastructure Namespace

#### Create Method

---

|  |
| --- |
| DeleteElements Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create(Document, ElementId) | Creates an instance of the DeleteElements resolution. |
| Public method Static member | Create(Document, IList ElementId ) | Creates an instance of the DeleteElements resolution. |
| Public method Static member | Create(Document, ISet ElementId ) | Creates an instance of the DeleteElements resolution. |

# See Also

DeleteElements Class

DeleteElements Members

Autodesk.Revit.DB Namespace

#### ExportLayerKey Constructor

---

|  |
| --- |
| ExportLayerKey Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | ExportLayerKey | Constructs a new ExportLayerKey with default values. |
| Public method | ExportLayerKey(String, String, SpecialType) | Constructs a new ExportLayerKey with categoryName, subCategoryName and a special type. |

# See Also

ExportLayerKey Class

ExportLayerKey Members

Autodesk.Revit.DB Namespace

#### CreateInstanceView Method

---

|  |
| --- |
| PanelScheduleView Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | CreateInstanceView(Document, ElementId) | Creates a new instance of this view (using default template) |
| Public method Static member | CreateInstanceView(Document, ElementId, ElementId) | Creates a new instance of this view (using specific template) |

# See Also

PanelScheduleView Class

PanelScheduleView Members

Autodesk.Revit.DB.Electrical Namespace

#### Create Method

---

|  |
| --- |
| FlexDuct Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create(Document, ElementId, ElementId, ElementId, IList XYZ ) | Creates a new flexible duct into the document, using a point array and flexible duct type. |
| Public method Static member | Create(Document, ElementId, ElementId, ElementId, XYZ, XYZ, IList XYZ ) | Creates a new flexible duct into the document, using a point array and flexible duct type. |

# See Also

FlexDuct Class

FlexDuct Members

Autodesk.Revit.DB.Mechanical Namespace

#### WillRuleCheckElements Method

---

|  |
| --- |
| PerformanceAdviser Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | WillRuleCheckElements(Int32) | Reports if rule needs to be executed on individual elements. |
| Public method | WillRuleCheckElements(PerformanceAdviserRuleId) | Reports if rule needs to be executed on individual elements. |

# See Also

PerformanceAdviser Class

PerformanceAdviser Members

Autodesk.Revit.DB Namespace

#### NewReferencePoint Method

---

|  |
| --- |
| FamilyItemFactory Class   See Also |

Creates a reference point.

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | NewReferencePoint(PointElementReference) | Create a reference point on an existing reference in an Autodesk Revit family document. |
| Public method | NewReferencePoint(Transform) | Create a reference point at a given location and with a given coordinate system in an Autodesk Revit family document. |
| Public method | NewReferencePoint(XYZ) | Create a reference point at a given location in an Autodesk Revit family document. |

# See Also

FamilyItemFactory Class

FamilyItemFactory Members

Autodesk.Revit.Creation Namespace

#### PrimaryDesignOptionMemberFilter Constructor

---

|  |
| --- |
| PrimaryDesignOptionMemberFilter Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | PrimaryDesignOptionMemberFilter | Constructs a new instance of a filter to match elements contained in any primary design option of any design option set. |
| Public method | PrimaryDesignOptionMemberFilter(Boolean) | Constructs a new instance of a filter to match elements contained in any primary design option of any design option set, with the option to invert the filter and find elements not contained in any primary design option of any design option set. |

# See Also

PrimaryDesignOptionMemberFilter Class

PrimaryDesignOptionMemberFilter Members

Autodesk.Revit.DB Namespace

#### Create Method

---

|  |
| --- |
| DividedPath Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create(Document, IList Reference ) | Creates a new instance of a divided path with a default layout. |
| Public method Static member | Create(Document, IList Reference , ICollection ElementId ) | Creates a new instance of a divided path whose points are determined by the intersecting elements. |

# See Also

DividedPath Class

DividedPath Members

Autodesk.Revit.DB Namespace

#### Create Method

---

|  |
| --- |
| RevitLinkType Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create(Document, ExternalResourceReference, RevitLinkOptions) | Creates a new Revit link type from an external resource reference and loads the linked document. |
| Public method Static member | Create(Document, ModelPath, RevitLinkOptions) | Creates a new Revit link type and loads the linked document. |

# See Also

RevitLinkType Class

RevitLinkType Members

Autodesk.Revit.DB Namespace

#### RebarBendData Constructor

---

|  |
| --- |
| RebarBendData Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | RebarBendData | Constructs a new RebarBendData with default settings. |
| Public method | RebarBendData(RebarBarType, RebarHookType, RebarHookType, RebarStyle, RebarHookOrientation, RebarHookOrientation) | Constructs a new RebarBendData using the bar type, hook types, style and orientation values. |

# See Also

RebarBendData Class

RebarBendData Members

Autodesk.Revit.DB.Structure Namespace

#### CreateMultiple Method

---

|  |
| --- |
| PathOfTravel Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | CreateMultiple(View, IList XYZ , IList XYZ ) | Creates multiple new paths of travel between same size sets of start and end points. |
| Public method Static member | CreateMultiple(View, IList XYZ , IList XYZ , IList PathOfTravelCalculationStatus ) | Creates multiple new paths of travel between same size sets of start and end points and provides creation result statuses. |

# See Also

PathOfTravel Class

PathOfTravel Members

Autodesk.Revit.DB.Analysis Namespace

#### FieldBuilder Constructor

---

|  |
| --- |
| FieldBuilder Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | FieldBuilder(FieldBuilder) | Constructs a new copy of the input ESFieldBuilder object. |
| Public method | FieldBuilder(Field, SchemaBuilder) | Constructs a new FieldBuilder using the field and associated SchemaBuilder object. |

# See Also

FieldBuilder Class

FieldBuilder Members

Autodesk.Revit.DB.ExtensibleStorage Namespace

#### AppendShape Method

---

|  |
| --- |
| DirectShape Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | AppendShape(IList GeometryObject ) | Appends the collection of GeometryObjects into the model shape representation stored in this DirectShape. |
| Public method | AppendShape(ShapeBuilder) | Appends shape built by the supplied ShapeBuilderObject to shape representation stored in this DirectShape. The data stored in the supplied ShapeBuilder object will be cleared. |
| Public method | AppendShape(IList GeometryObject , DirectShapeTargetViewType) | Appends the collection of GeometryObjects into the model or view specific shape representation stored in this DirectShape. Passing DirectShapeTargetViewType.Default as view type will cause the model shape to be updated. |

# See Also

DirectShape Class

DirectShape Members

Autodesk.Revit.DB Namespace

#### OpenAndActivateDocument Method

---

|  |
| --- |
| UIApplication Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | OpenAndActivateDocument(String) | Opens and activates a Revit document. |
| Public method | OpenAndActivateDocument(ModelPath, OpenOptions, Boolean) | Opens and activates a Revit document, include both local document or cloud document. |
| Public method | OpenAndActivateDocument(ModelPath, OpenOptions, Boolean, IOpenFromCloudCallback) | Opens and activates a Revit document, include both local document or cloud document. |

# See Also

UIApplication Class

UIApplication Members

Autodesk.Revit.UI Namespace

#### NewArcLengthDimension Method

---

|  |
| --- |
| FamilyItemFactory Class   See Also |

Creates a new arc length dimension object.

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | NewArcLengthDimension(View, Arc, Reference, Reference, Reference) | Creates a new arc length dimension object using the default dimension type. |
| Public method | NewArcLengthDimension(View, Arc, Reference, Reference, Reference, DimensionType) | Creates a new arc length dimension object using the specified dimension type. |

# See Also

FamilyItemFactory Class

FamilyItemFactory Members

Autodesk.Revit.Creation Namespace

#### GetMacroManager Method

---

|  |
| --- |
| MacroManager Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | GetMacroManager(Application) | Gets the Macro manager from the application. |
| Public method Static member | GetMacroManager(Document) | Gets the Macro manager from the document. |

# See Also

MacroManager Class

MacroManager Members

Autodesk.Revit.DB.Macros Namespace

#### Create Method

---

|  |
| --- |
| SketchPlane Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create(Document, ElementId) | Creates a sketch plane from a grid, reference plane, or level. |
| Public method Static member | Create(Document, Plane) | Creates a new sketch plane from a geometric plane. |
| Public method Static member | Create(Document, Reference) | Creates a new sketch plane from a reference to a planar face. |

# See Also

SketchPlane Class

SketchPlane Members

Autodesk.Revit.DB Namespace

#### ShowElements Method

---

|  |
| --- |
| UIDocument Class   See Also |

Shows one or more elements by zoom to fit.

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | ShowElements(Element) | Shows the element by zoom to fit. |
| Public method | ShowElements(ElementId) | Shows the element by zoom to fit. |
| Public method | ShowElements(ICollection ElementId ) | Shows the elements by zoom to fit. |
| Public method | ShowElements(ElementSet) | Shows the elements by zoom to fit. |

# See Also

UIDocument Class

UIDocument Members

Autodesk.Revit.UI Namespace

#### GetSplittingCurves Method

---

|  |
| --- |
| PartUtils Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | GetSplittingCurves(Document, ElementId) | Identifies the curves that were used to create the part. |
| Public method Static member | GetSplittingCurves(Document, ElementId, Plane ) | Identifies the curves that were used to create the part and the plane in which they reside. |

# See Also

PartUtils Class

PartUtils Members

Autodesk.Revit.DB Namespace

#### GetRegisteredUpdaterInfos Method

---

|  |
| --- |
| UpdaterRegistry Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | GetRegisteredUpdaterInfos | Returns UpdaterInfos for all the application-wide updaters. |
| Public method Static member | GetRegisteredUpdaterInfos(Document) | Returns information about all updaters applicable to the given document. |

# See Also

UpdaterRegistry Class

UpdaterRegistry Members

Autodesk.Revit.DB Namespace

#### Intersect Method

---

|  |
| --- |
| Face Class   See Also |

Calculates the intersection of the specified curve with this face.

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | Intersect(Curve) | Calculates the intersection of the specified curve with this face. |
| Public method | Intersect(Face) | Calculates the intersection of the specified face with this face and returns the intersection results. |
| Public method | Intersect(Curve, IntersectionResultArray ) | Calculates the intersection of the specified curve with this face and returns the intersection results. |
| Public method | Intersect(Face, Curve ) | Calculates the intersection of the specified face with this face and returns the intersection results. |

# See Also

Face Class

Face Members

Autodesk.Revit.DB Namespace

#### AdvancedLossFactor Constructor

---

|  |
| --- |
| AdvancedLossFactor Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | AdvancedLossFactor | Creates an advanced loss factor object with values set to no loss. |
| Public method | AdvancedLossFactor(AdvancedLossFactor) | Creates a copy of the given advanced loss factor object |
| Public method | AdvancedLossFactor(Double, Double, Double, Double, Double, Double, Double) | Creates an advanced loss factor object with the given values. |

# See Also

AdvancedLossFactor Class

AdvancedLossFactor Members

Autodesk.Revit.DB.Lighting Namespace

#### AddReferencePoint Method

---

|  |
| --- |
| DirectShapeType Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | AddReferencePoint(XYZ) | Adds a reference point to the DirectShapeType. |
| Public method | AddReferencePoint(XYZ, DirectShapeReferenceOptions) | Adds a reference point to the DirectShapeType. |

# See Also

DirectShapeType Class

DirectShapeType Members

Autodesk.Revit.DB Namespace

#### HasAssociatedParts Method

---

|  |
| --- |
| PartUtils Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | HasAssociatedParts(Document, ElementId) | Checks if an element has associated parts. |
| Public method Static member | HasAssociatedParts(Document, LinkElementId) | Checks if an element has associated parts. |

# See Also

PartUtils Class

PartUtils Members

Autodesk.Revit.DB Namespace

#### CanSuppressTrailingZeros Method

---

|  |
| --- |
| FormatOptions Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | CanSuppressTrailingZeros | Checks whether trailing zeros can be suppressed for the display unit in this FormatOptions. |
| Public method Static member | CanSuppressTrailingZeros(ForgeTypeId) | Checks whether trailing zeros can be suppressed for a given unit. |

# See Also

FormatOptions Class

FormatOptions Members

Autodesk.Revit.DB Namespace

#### BasicLossFactor Constructor

---

|  |
| --- |
| BasicLossFactor Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | BasicLossFactor | Creates a basic loss factor object with no loss. |
| Public method | BasicLossFactor(Double) | Creates a basic loss factor object with the given value. |
| Public method | BasicLossFactor(BasicLossFactor) | Creates a copy of the given basic loss factor object |

# See Also

BasicLossFactor Class

BasicLossFactor Members

Autodesk.Revit.DB.Lighting Namespace

#### Intersect Method

---

|  |
| --- |
| Curve Class   See Also |

Calculates the intersection of this curve with the specified curve.

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | Intersect(Curve) | Calculates the intersection of this curve with the specified curve. |
| Public method | Intersect(Curve, IntersectionResultArray ) | Calculates the intersection of this curve with the specified curve and returns the intersection results. |

# See Also

Curve Class

Curve Members

Autodesk.Revit.DB Namespace

#### GetRibbonPanels Method

---

|  |
| --- |
| ApplicationEntryPoint Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | GetRibbonPanels | (Overrides  UIApplication GetRibbonPanels  .) |
| Public method | GetRibbonPanels(String) | (Overrides  UIApplication GetRibbonPanels(String)  .) |
| Public method | GetRibbonPanels(Tab) | (Overrides  UIApplication GetRibbonPanels(Tab)  .) |

# See Also

ApplicationEntryPoint Class

ApplicationEntryPoint Members

Autodesk.Revit.UI.Macros Namespace

#### SpatialElementGeometryCalculator Constructor

---

|  |
| --- |
| SpatialElementGeometryCalculator Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | SpatialElementGeometryCalculator(Document) | Constructs a new calculator with default options for the geometry of spatial elements. |
| Public method | SpatialElementGeometryCalculator(Document, SpatialElementBoundaryOptions) | Constructs a new calculator for the geometry of spatial elements. |

# See Also

SpatialElementGeometryCalculator Class

SpatialElementGeometryCalculator Members

Autodesk.Revit.DB Namespace

#### CreateNotBeginsWithRule Method

---

|  |
| --- |
| ParameterFilterRuleFactory Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | CreateNotBeginsWithRule(ElementId, String) | Creates a filter rule that determines whether strings from the document do not begin with a certain string value. |
| Public method Static member | CreateNotBeginsWithRule(ElementId, String, Boolean) | **Obsolete.**   Creates a filter rule that determines whether strings from the document do not begin with a certain string value. |

# See Also

ParameterFilterRuleFactory Class

ParameterFilterRuleFactory Members

Autodesk.Revit.DB Namespace

#### FillGrid Constructor

---

|  |
| --- |
| FillGrid Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | FillGrid | Creates a simple fill grid. |
| Public method | FillGrid(FillGrid) | Constructs a new FillGrid with default settings. |
| Public method | FillGrid(Double, Double) | Creates a simple fill grid with given angle and offset. |

# See Also

FillGrid Class

FillGrid Members

Autodesk.Revit.DB Namespace

#### GetCellParamId Method

---

|  |
| --- |
| TableSectionData Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | GetCellParamId(Int32) | Returns a column's ParamId |
| Public method | GetCellParamId(Int32, Int32) | Returns a cell's ParamId and if no ParamId exists for this cell, it would come from the column |

# See Also

TableSectionData Class

TableSectionData Members

Autodesk.Revit.DB Namespace

#### CreateAnalysisDisplayStyle Method

---

|  |
| --- |
| AnalysisDisplayStyle Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | CreateAnalysisDisplayStyle(Document, String, AnalysisDisplayColoredSurfaceSettings, AnalysisDisplayColorSettings, AnalysisDisplayLegendSettings) | Factory method - creates analysis display style object of type Colored Surface for the given document. |
| Public method Static member | CreateAnalysisDisplayStyle(Document, String, AnalysisDisplayDeformedShapeSettings, AnalysisDisplayColorSettings, AnalysisDisplayLegendSettings) | Factory method - creates analysis display style object of type Deformed Shape for the given document. |
| Public method Static member | CreateAnalysisDisplayStyle(Document, String, AnalysisDisplayDiagramSettings, AnalysisDisplayColorSettings, AnalysisDisplayLegendSettings) | Factory method - creates analysis display style object of type Diagram for the given document. |
| Public method Static member | CreateAnalysisDisplayStyle(Document, String, AnalysisDisplayMarkersAndTextSettings, AnalysisDisplayColorSettings, AnalysisDisplayLegendSettings) | Factory method - creates analysis display style object of type Markers and Text for the given document. |
| Public method Static member | CreateAnalysisDisplayStyle(Document, String, AnalysisDisplayVectorSettings, AnalysisDisplayColorSettings, AnalysisDisplayLegendSettings) | Factory method - creates analysis display style object of type Vectors for the given document. |

# See Also

AnalysisDisplayStyle Class

AnalysisDisplayStyle Members

Autodesk.Revit.DB.Analysis Namespace

#### CreateLessOrEqualRule Method

---

|  |
| --- |
| ParameterFilterRuleFactory Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | CreateLessOrEqualRule(ElementId, ElementId) | Creates a filter rule that determines whether ElementId values from the document are less than or equal to a certain value. |
| Public method Static member | CreateLessOrEqualRule(ElementId, Int32) | Creates a filter rule that determines whether integer values from the document are less than or equal to a certain value. |
| Public method Static member | CreateLessOrEqualRule(ElementId, String) | Creates a filter rule that determines whether strings from the document are less than or equal to a certain value. |
| Public method Static member | CreateLessOrEqualRule(ElementId, Double, Double) | Creates a filter rule that determines whether double-precision values from the document are less than or equal to a certain value. |
| Public method Static member | CreateLessOrEqualRule(ElementId, String, Boolean) | **Obsolete.**   Creates a filter rule that determines whether strings from the document are less than or equal to a certain value. |

# See Also

ParameterFilterRuleFactory Class

ParameterFilterRuleFactory Members

Autodesk.Revit.DB Namespace

#### AddDefinition Method

---

|  |
| --- |
| DirectShapeLibrary Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | AddDefinition(String, GeometryObject) | Add a definition to be reused by instances. A definition is a single geometry object. |
| Public method | AddDefinition(String, IList GeometryObject ) | Add a definition to be reused by instances. A definition is a collection of geometry objects. |

# See Also

DirectShapeLibrary Class

DirectShapeLibrary Members

Autodesk.Revit.DB Namespace

#### NewAngularDimension Method

---

|  |
| --- |
| FamilyItemFactory Class   See Also |

Creates a new angular dimension object.

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | NewAngularDimension(View, Arc, Reference, Reference) | Creates a new angular dimension object using the default dimension type. |
| Public method | NewAngularDimension(View, Arc, Reference, Reference, DimensionType) | Creates a new angular dimension object using the specified dimension type. |

# See Also

FamilyItemFactory Class

FamilyItemFactory Members

Autodesk.Revit.Creation Namespace

#### ChangeService Method

---

|  |
| --- |
| FabricationNetworkChangeService Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | ChangeService(ISet ElementId , Int32, Int32) | Changes the service of the selection of fabrication parts. |
| Public method | ChangeService(ISet ElementId , Int32, Int32, Boolean) | Changes the service of the selection of fabrication parts. |

# See Also

FabricationNetworkChangeService Class

FabricationNetworkChangeService Members

Autodesk.Revit.DB.Fabrication Namespace

#### Split Method

---

|  |
| --- |
| ViewSchedule Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | Split(IList Double ) | Splits the schedule into several segments by given height of each segment. |
| Public method | Split(Int32) | Splits the schedule into several segments by given segment number. |

# See Also

ViewSchedule Class

ViewSchedule Members

Autodesk.Revit.DB Namespace

#### AreElementsValidIntersectingReferences Method

---

|  |
| --- |
| PartMakerMethodToDivideVolumes Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | AreElementsValidIntersectingReferences(ICollection ElementId ) | Identifies if provided members are valid. |
| Public method Static member | AreElementsValidIntersectingReferences(Document, ICollection ElementId ) | Identifies if provided members are valid. |

# See Also

PartMakerMethodToDivideVolumes Class

PartMakerMethodToDivideVolumes Members

Autodesk.Revit.DB Namespace

#### Transaction Constructor

---

|  |
| --- |
| Transaction Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | Transaction(Document) | Instantiates a transaction object. |
| Public method | Transaction(Document, String) | Instantiates a transaction object |

# See Also

Transaction Class

Transaction Members

Autodesk.Revit.DB Namespace

#### RevitLinkOptions Constructor

---

|  |
| --- |
| RevitLinkOptions Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | RevitLinkOptions(Boolean) | Creates a RevitLinkOptions object, specifying relative or absolute path type. If the link is workshared, all worksets will be opened. |
| Public method | RevitLinkOptions(RevitLinkOptions) | Constructs a new copy of the input RevitLinkOptions object. |
| Public method | RevitLinkOptions(Boolean, WorksetConfiguration) | Creates a RevitLinkOptions object, specifying relative or absolute path type, and the desired workset configuration. |

# See Also

RevitLinkOptions Class

RevitLinkOptions Members

Autodesk.Revit.DB Namespace

#### PointLightShape Constructor

---

|  |
| --- |
| PointLightShape Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | PointLightShape | Creates a point light shape object. |
| Public method | PointLightShape(PointLightShape) | Creates a copy of the given point light shape |

# See Also

PointLightShape Class

PointLightShape Members

Autodesk.Revit.DB.Lighting Namespace

#### AddResource Method

---

|  |
| --- |
| ExternalResourceBrowserData Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | AddResource(String) | Adds an external resource to the folder path by supplying the resource name. |
| Public method | AddResource(String, IDictionary String, String ) | Adds an external resource to the folder path by supplying the resource name and reference information. |
| Public method | AddResource(String, String) | Adds an external resource to the folder path by supplying the resource name and version. |
| Public method | AddResource(String, String, IDictionary String, String ) | Adds an external resource to the folder path by supplying the resource name, version and reference information. |

# See Also

ExternalResourceBrowserData Class

ExternalResourceBrowserData Members

Autodesk.Revit.DB Namespace

#### GetLabelForBuiltInParameter Method

---

|  |
| --- |
| LabelUtils Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | GetLabelForBuiltInParameter(ForgeTypeId) | Gets the user-visible name for a built-in parameter. |
| Public method Static member | GetLabelForBuiltInParameter(ForgeTypeId, LanguageType) | Gets the user-visible name for a built-in parameter in a specific LanguageType. |

# See Also

LabelUtils Class

LabelUtils Members

Autodesk.Revit.DB Namespace

#### Room Property

---

|  |
| --- |
| FamilyInstance Class   See Also |

The room in which the instance is located.

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public property | Room | The room in which the instance is located (during the last phase of the project). |
| Public property | Room Phase |  |

# See Also

FamilyInstance Class

FamilyInstance Members

Autodesk.Revit.DB Namespace

#### NewOpening Method

---

|  |
| --- |
| Document Class   See Also |

Creates a new opening.

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | NewOpening(Element, CurveArray, eRefFace) | Creates a new opening in a beam, brace and column. |
| Public method | NewOpening(Element, CurveArray, Boolean) | Creates a new opening in a roof, floor and ceiling. |
| Public method | NewOpening(Level, Level, CurveArray) | Creates a new shaft opening between a set of levels. |
| Public method | NewOpening(Wall, XYZ, XYZ) | Creates a rectangular opening on a wall. |

# See Also

Document Class

Document Members

Autodesk.Revit.Creation Namespace

#### SetCurves Method

---

|  |
| --- |
| RebarFreeFormAccessor Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | SetCurves(IList IList Curve ) | Set the curves into a free form Rebar. Will throw exception if the rebar has valid constraints. |
| Public method | SetCurves(IList CurveLoop ) | Set the curves into a free form Rebar. Will throw exception if the rebar has valid constraints. |

# See Also

RebarFreeFormAccessor Class

RebarFreeFormAccessor Members

Autodesk.Revit.DB.Structure Namespace

#### GetCellCalculatedValue Method

---

|  |
| --- |
| TableSectionData Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | GetCellCalculatedValue(Int32) | Gets the calculated value for the specified column |
| Public method | GetCellCalculatedValue(Int32, Int32) | Gets the calculated value for the specified cell |

# See Also

TableSectionData Class

TableSectionData Members

Autodesk.Revit.DB Namespace

#### FabricationSaveJobOptions Constructor

---

|  |
| --- |
| FabricationSaveJobOptions Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | FabricationSaveJobOptions | Default Constructor |
| Public method | FabricationSaveJobOptions(Boolean) | Constructor |

# See Also

FabricationSaveJobOptions Class

FabricationSaveJobOptions Members

Autodesk.Revit.DB.Fabrication Namespace

#### NewSpaces2 Method

---

|  |
| --- |
| Document Class   See Also |

Creates one or more spaces.

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | NewSpaces2(Phase, Int32) | Creates a set of new unplaced spaces on a given phase. |
| Public method | NewSpaces2(Level, Phase, View) | Creates new spaces on the available plan circuits of a the given level. |

# See Also

Document Class

Document Members

Autodesk.Revit.Creation Namespace

#### IsNameUnique Method

---

|  |
| --- |
| FilterElement Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | IsNameUnique(String) | Determines whether a potential filter element name is unique. |
| Public method Static member | IsNameUnique(Document, String) | Determines whether the given name could be applied to a new FilterElement, or if it could not be applied because the name is already in use. |

# See Also

FilterElement Class

FilterElement Members

Autodesk.Revit.DB Namespace

#### FamilyStructuralMaterialTypeFilter Constructor

---

|  |
| --- |
| FamilyStructuralMaterialTypeFilter Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | FamilyStructuralMaterialTypeFilter(StructuralMaterialType) | Constructs a new instance of a filter to match families that have the given structural material type. |
| Public method | FamilyStructuralMaterialTypeFilter(StructuralMaterialType, Boolean) | Constructs a new instance of a filter to match families by structural material type, with the option to match all families which are not of the given structural material type. |

# See Also

FamilyStructuralMaterialTypeFilter Class

FamilyStructuralMaterialTypeFilter Members

Autodesk.Revit.DB.Structure Namespace

#### ImageTypeOptions Constructor

---

|  |
| --- |
| ImageTypeOptions Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | ImageTypeOptions(ExternalResourceReference, ImageTypeSource) | Constructs a new instance of the ImageTypeOptions object. |
| Public method | ImageTypeOptions(String, Boolean, ImageTypeSource) | Constructs a new instance of the ImageTypeOptions object.  The provided string path must specify a local file. The path can be absolute or relative to the project's location.  This constructor saves an additional setting that indicates whether the imagetype will be a link or an import. |

# See Also

ImageTypeOptions Class

ImageTypeOptions Members

Autodesk.Revit.DB Namespace

#### SendBackward Method

---

|  |
| --- |
| DetailElementOrderUtils Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | SendBackward(Document, View, ElementId) | Moves the given detail instance one step closer to the back of all other detail instances in the view. |
| Public method Static member | SendBackward(Document, View, ICollection ElementId ) | Moves the given detail instances one step closer to the back with relation to all other detail instances in the view, while keeping the order of the given ones. |

# See Also

DetailElementOrderUtils Class

DetailElementOrderUtils Members

Autodesk.Revit.DB Namespace

#### IsUpdaterRegistered Method

---

|  |
| --- |
| UpdaterRegistry Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | IsUpdaterRegistered(UpdaterId) | Checks whether updater with the given id is registered |
| Public method Static member | IsUpdaterRegistered(UpdaterId, Document) | Checks whether updater with the given id is registered in a document. |

# See Also

UpdaterRegistry Class

UpdaterRegistry Members

Autodesk.Revit.DB Namespace

#### PlaceOnHost Method

---

|  |
| --- |
| FabricationHostedInfo Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | PlaceOnHost(ElementId, Connector, Double) | Places the part on the specified host. |
| Public method | PlaceOnHost(ElementId, Connector, Double, Double) | Places the part on the specified host. |

# See Also

FabricationHostedInfo Class

FabricationHostedInfo Members

Autodesk.Revit.DB Namespace

#### CreateSweptBlendGeometry Method

---

|  |
| --- |
| GeometryCreationUtilities Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | CreateSweptBlendGeometry(Curve, IList Double , IList CurveLoop , IList ICollection VertexPair ) | Creates a solid by simultaneously sweeping and blending two or more closed planar curve loops along a single curve. |
| Public method Static member | CreateSweptBlendGeometry(Curve, IList Double , IList CurveLoop , IList ICollection VertexPair , SolidOptions) | Creates a solid by simultaneously sweeping and blending two or more closed planar curve loops along a single curve. |

# See Also

GeometryCreationUtilities Class

GeometryCreationUtilities Members

Autodesk.Revit.DB Namespace

#### CanSuppressSpaces Method

---

|  |
| --- |
| FormatOptions Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | CanSuppressSpaces | Checks whether spaces can be suppressed for the display unit in this FormatOptions. |
| Public method Static member | CanSuppressSpaces(ForgeTypeId) | Checks whether spaces can be suppressed for a given unit. |

# See Also

FormatOptions Class

FormatOptions Members

Autodesk.Revit.DB Namespace

#### SetPath Method

---

|  |
| --- |
| ImageTypeOptions Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | SetPath(String) | Update the path of the file that specifies the image to be used.  The provided string path must specify a local file. The path can be absolute or relative to the project's location. ImageType will respectively use an absolute or relative path. |
| Public method | SetPath(String, Boolean) | Update the path of the file that specifies the image to be used.  The provided string path must specify a local file. The path can be absolute or relative to the project's location.  Additionally, indicate whether the path used by ImageType should be absolute or relative. |

# See Also

ImageTypeOptions Class

ImageTypeOptions Members

Autodesk.Revit.DB Namespace

#### SetMemberForces Method

---

|  |
| --- |
| AnalyticalMember Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | SetMemberForces(MemberForces) | Sets Member Forces to Analytical Member. |
| Public method | SetMemberForces(Boolean, XYZ, XYZ) | Sets Member Forces to Analytical Member. |

# See Also

AnalyticalMember Class

AnalyticalMember Members

Autodesk.Revit.DB.Structure Namespace

#### ImagePlacementOptions Constructor

---

|  |
| --- |
| ImagePlacementOptions Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | ImagePlacementOptions | Constructs a new ImagePlacementOptions that will place an  ImageInstance  with its center at the origin of the model |
| Public method | ImagePlacementOptions(XYZ, BoxPlacement) | Constructs a new ImagePlacementOptions for placing an  ImageInstance |

# See Also

ImagePlacementOptions Class

ImagePlacementOptions Members

Autodesk.Revit.DB Namespace

#### Create Method

---

|  |
| --- |
| ZoneEquipment Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create(Document, String) | Creates a new zone equipment |
| Public method Static member | Create(Document, AnalyticalSystemDomain, String) | **Obsolete.**   Creates a new zone equipment |

# See Also

ZoneEquipment Class

ZoneEquipment Members

Autodesk.Revit.DB.Mechanical Namespace

#### GetSuperscriptStatus Method

---

|  |
| --- |
| FormattedText Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | GetSuperscriptStatus | Returns whether  All  ,  None  or a  Mixed  of characters in the entire text are superscripted. |
| Public method | GetSuperscriptStatus(TextRange) | Returns whether  All  ,  None  or a  Mixed  set of characters in a given text range are superscripted. |

# See Also

FormattedText Class

FormattedText Members

Autodesk.Revit.DB Namespace

#### IsNameUnique Method

---

|  |
| --- |
| HVACLoadBuildingType Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | IsNameUnique(String) | Determines whether a potential building type name is unique. |
| Public method Static member | IsNameUnique(Document, String) | Determines whether a potential building type name is unique. |

# See Also

HVACLoadBuildingType Class

HVACLoadBuildingType Members

Autodesk.Revit.DB.Analysis Namespace

#### RebarShapeDefinitionByArc Constructor

---

|  |
| --- |
| RebarShapeDefinitionByArc Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | RebarShapeDefinitionByArc(Document, RebarShapeDefinitionByArcType) | Create a non-spiral shape definition. |
| Public method | RebarShapeDefinitionByArc(Document, Double, Double, Int32, Int32) | Create a spiral shape definition. |

# See Also

RebarShapeDefinitionByArc Class

RebarShapeDefinitionByArc Members

Autodesk.Revit.DB.Structure Namespace

#### CreateMultiPlaneFilter Method

---

|  |
| --- |
| PointCloudFilterFactory Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | CreateMultiPlaneFilter(IList Plane ) | Creates a new point cloud filter based upon planar boundaries. |
| Public method Static member | CreateMultiPlaneFilter(IList Plane , Int32) | Creates a new point cloud filter based upon planar boundaries. |

# See Also

PointCloudFilterFactory Class

PointCloudFilterFactory Members

Autodesk.Revit.DB.PointClouds Namespace

#### IFCRange Constructor

---

|  |
| --- |
| IFCRange Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | IFCRange | Instantiates a default IFCRange object. |
| Public method | IFCRange(IFCRange) | Instantiates an IFCRange object by copy. |
| Public method | IFCRange(Double, Double) | Instantiates an IFCRange object. |

# See Also

IFCRange Class

IFCRange Members

Autodesk.Revit.DB.IFC Namespace

#### GetField Method

---

|  |
| --- |
| ScheduleDefinition Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | GetField(Int32) | Gets a field. |
| Public method | GetField(ScheduleFieldId) | Gets a field. |

# See Also

ScheduleDefinition Class

ScheduleDefinition Members

Autodesk.Revit.DB Namespace

#### AddEdge Method

---

|  |
| --- |
| Form Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | AddEdge(Reference, Reference) | Add an edge to the form, connecting two edges on same/different profile, by a pair of specified points. |
| Public method | AddEdge(Reference, XYZ) | Add an edge to the form, connecting two edges on different profiles, by a specified face of the form and a point on face. |
| Public method | AddEdge(Reference, Double, Reference, Double) | Add an edge to the form, connecting two edges on same/different profile, by a pair of specified edge/param. |

# See Also

Form Class

Form Members

Autodesk.Revit.DB Namespace

#### GetAssociatedParts Method

---

|  |
| --- |
| PartUtils Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | GetAssociatedParts(Document, ElementId, Boolean, Boolean) | Returns all Parts that are associated with the given element. |
| Public method Static member | GetAssociatedParts(Document, LinkElementId, Boolean, Boolean) | Returns all Parts that are associated with the given element |

# See Also

PartUtils Class

PartUtils Members

Autodesk.Revit.DB Namespace

#### DeleteWorksetSettings Constructor

---

|  |
| --- |
| DeleteWorksetSettings Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | DeleteWorksetSettings | Constructs a DeleteWorksetSettings object with DeleteWorksetOption::DeleteAllElements option. |
| Public method | DeleteWorksetSettings(DeleteWorksetOption, WorksetId) | Constructs a DeleteWorksetSettings object. |

# See Also

DeleteWorksetSettings Class

DeleteWorksetSettings Members

Autodesk.Revit.DB Namespace

#### RegisterService Method

---

|  |
| --- |
| ExternalServiceRegistry Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | RegisterService(ISingleServerService, ExternalServiceOptions) | A method to register a single-server service. |
| Public method Static member | RegisterService(IMultiServerService, ExternalServiceOptions, ExecutionPolicy) | A method to register a multi-server service. |
| Public method Static member | RegisterService(ISingleServerService, Guid, ExternalServiceOptions) | A method to register a mandatory, single-server service. |

# See Also

ExternalServiceRegistry Class

ExternalServiceRegistry Members

Autodesk.Revit.DB.ExternalService Namespace

#### PassesFilter Method

---

|  |
| --- |
| ElementFilter Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | PassesFilter(Element) | Applies the filter to a given element. |
| Public method | PassesFilter(Document, ElementId) | Applies the filter to a given element. |

# See Also

ElementFilter Class

ElementFilter Members

Autodesk.Revit.DB Namespace

#### ExportLineweightInfo Constructor

---

|  |
| --- |
| ExportLineweightInfo Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | ExportLineweightInfo | Constructs a new default ExportLineweightInfo. |
| Public method | ExportLineweightInfo(String) | Constructs a new ExportLineweightInfo using the destination line weight name as input. |
| Public method | ExportLineweightInfo(ExportLineweightInfo) | Constructs a new copy of the input ExportLineweightInfo object. |

# See Also

ExportLineweightInfo Class

ExportLineweightInfo Members

Autodesk.Revit.DB Namespace

#### CreateViaOffset Method

---

|  |
| --- |
| CurveLoop Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | CreateViaOffset(CurveLoop, IList Double , XYZ) | Creates a new curve loop that is an offset of the existing curve loop. |
| Public method Static member | CreateViaOffset(CurveLoop, Double, XYZ) | Creates a new curve loop that is an offset of the existing curve loop. |

# See Also

CurveLoop Class

CurveLoop Members

Autodesk.Revit.DB Namespace

#### CreateMaterialTakeoff Method

---

|  |
| --- |
| AssemblyViewUtils Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | CreateMaterialTakeoff(Document, ElementId) | Creates a new material takeoff multicategory schedule assembly view for the assembly instance. |
| Public method Static member | CreateMaterialTakeoff(Document, ElementId, ElementId, Boolean) | Creates a new material takeoff multicategory schedule assembly view for the assembly instance. |

# See Also

AssemblyViewUtils Class

AssemblyViewUtils Members

Autodesk.Revit.DB Namespace

#### STLImportOptions Constructor

---

|  |
| --- |
| STLImportOptions Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | STLImportOptions | Constructs a new instance of STLImportOptions with default values of all properties. |
| Public method | STLImportOptions(STLImportOptions) | Constructs a new instance of STLImportOptions as a copy of the import options. |

# See Also

STLImportOptions Class

STLImportOptions Members

Autodesk.Revit.DB Namespace

#### CreateViaThicken Method

---

|  |
| --- |
| CurveLoop Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | CreateViaThicken(Curve, Double, XYZ) | Creates a new closed curve loop by thickening the input curve with respect to a given plane. |
| Public method Static member | CreateViaThicken(CurveLoop, Double, XYZ) | Creates a new closed curve loop by thickening the input open curve loop with respect to a given plane. |

# See Also

CurveLoop Class

CurveLoop Members

Autodesk.Revit.DB Namespace

#### AddReferenceCurve Method

---

|  |
| --- |
| DirectShape Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | AddReferenceCurve(Curve) | Adds a reference curve to the DirectShape. |
| Public method | AddReferenceCurve(Curve, DirectShapeReferenceOptions) | Adds a reference curve to the DirectShape. |

# See Also

DirectShape Class

DirectShape Members

Autodesk.Revit.DB Namespace

#### Create Method

---

|  |
| --- |
| LinearArray Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create(Document, View, ElementId, Int32, XYZ, ArrayAnchorMember) | Creates a new linear array element from a single element. |
| Public method Static member | Create(Document, View, ICollection ElementId , Int32, XYZ, ArrayAnchorMember) | Creates a new linear array element from a set of elements. |

# See Also

LinearArray Class

LinearArray Members

Autodesk.Revit.DB Namespace

#### SetCellStyle Method

---

|  |
| --- |
| TableSectionData Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | SetCellStyle(TableCellStyle) | Sets a section's style |
| Public method | SetCellStyle(Int32, TableCellStyle) | Sets a column's style. |
| Public method | SetCellStyle(Int32, Int32, TableCellStyle) | Sets a cell's style |

# See Also

TableSectionData Class

TableSectionData Members

Autodesk.Revit.DB Namespace

#### IsValidType Method

---

|  |
| --- |
| PanelScheduleTemplate Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | IsValidType(PanelScheduleType) | Checks if given type is valid for this panel schedule template element. |

# See Also

PanelScheduleTemplate Class

PanelScheduleTemplate Members

Autodesk.Revit.DB.Electrical Namespace

#### Parameter Property

---

|  |
| --- |
| FamilyManager Class   See Also |

Obtains a parameter based on an identifier.

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public property | Parameter Guid | Obtains the parameter of this type with a given GUID for a shared parameter. |
| Public property | Parameter String | Obtains the parameter of this type with a given name. |
| Public property | Parameter BuiltInParameter | Obtains the parameter of this type with a given parameter id. |
| Public property | Parameter Definition | Obtains the parameter of this type with a given definition. |

# See Also

FamilyManager Class

FamilyManager Members

Autodesk.Revit.DB Namespace

#### CreateElectricalConnector Method

---

|  |
| --- |
| ConnectorElement Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | CreateElectricalConnector(Document, ElectricalSystemType, Reference) | Create a new electrical ConnectorElement. |
| Public method Static member | CreateElectricalConnector(Document, ElectricalSystemType, Reference, Edge) | Create a new electrical ConnectorElement. |

# See Also

ConnectorElement Class

ConnectorElement Members

Autodesk.Revit.DB Namespace

#### Create Method

---

|  |
| --- |
| LoadCase Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create(Document, String, ElementId, ElementId) | Creates a new LoadCase. |
| Public method Static member | Create(Document, String, ElementId, LoadCaseCategory) | Creates a new LoadCase. |

# See Also

LoadCase Class

LoadCase Members

Autodesk.Revit.DB.Structure Namespace

#### ExportLinetypeInfo Constructor

---

|  |
| --- |
| ExportLinetypeInfo Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | ExportLinetypeInfo | Constructs a new default ExportLinetypeInfo. |
| Public method | ExportLinetypeInfo(String) | Constructs a new ExportLinetypeInfo using the destination linetype name as input. |
| Public method | ExportLinetypeInfo(ExportLinetypeInfo) | Constructs a new copy of the input ExportLinetypeInfo object. |

# See Also

ExportLinetypeInfo Class

ExportLinetypeInfo Members

Autodesk.Revit.DB Namespace

#### Create Method

---

|  |
| --- |
| ScheduleSheetInstance Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create(Document, ElementId, ElementId, XYZ) | Create an instance of a schedule on a sheet. |
| Public method Static member | Create(Document, ElementId, ElementId, XYZ, Int32) | Creates an instance of a schedule segment on a sheet. |

# See Also

ScheduleSheetInstance Class

ScheduleSheetInstance Members

Autodesk.Revit.DB Namespace

#### IsFlippedOnFace Method

---

|  |
| --- |
| Edge Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | IsFlippedOnFace(Int32) | Determines if this edge's topological direction on the Face is opposite to its parametric direction. |
| Public method | IsFlippedOnFace(Face) | Determines if this edge's topological direction on the Face is opposite to its parametric direction. |

# See Also

Edge Class

Edge Members

Autodesk.Revit.DB Namespace

#### ConnectPipePlaceholdersAtCross Method

---

|  |
| --- |
| PlumbingUtils Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | ConnectPipePlaceholdersAtCross(Document, ElementId, ElementId) | Connects placeholders that looks like Cross connection. |
| Public method Static member | ConnectPipePlaceholdersAtCross(Document, ElementId, ElementId, ElementId) | Connects placeholders that looks like Cross connection. |
| Public method Static member | ConnectPipePlaceholdersAtCross(Document, Connector, Connector, Connector, Connector) | Connects placeholders that looks like Cross connection. |

# See Also

PlumbingUtils Class

PlumbingUtils Members

Autodesk.Revit.DB.Plumbing Namespace

#### CreateCurve Method

---

|  |
| --- |
| NurbSpline Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | CreateCurve(HermiteSpline) | Creates a new geometric Curve object by converting the given HermiteSpline. The created curve may be a NURBSpline or a simpler curve such as line or arc. |
| Public method Static member | CreateCurve(IList XYZ , IList Double ) | Creates a new geometric Curve object from NURBS curve data containing just control points and weights. The created curve may be a NURBSpline or a simpler curve such as line or arc. |
| Public method Static member | CreateCurve(Int32, IList Double , IList XYZ ) | Creates a new geometric Curve object from NURBS curve data, which does not include weights. The created curve may be a NURBSpline or a simpler curve such as line or arc. |
| Public method Static member | CreateCurve(Int32, IList Double , IList XYZ , IList Double ) | Creates a new geometric Curve object from NURBS curve data, which includes weights. The created curve may be a NURBSpline or a simpler curve such as line or arc. |

# See Also

NurbSpline Class

NurbSpline Members

Autodesk.Revit.DB Namespace

#### Show Method

---

|  |
| --- |
| TaskDialog Class   See Also |

Shows a task dialog.

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | Show | Shows the task dialog. |
| Public method Static member | Show(String, String) | Shows a task dialog with title, main instruction and a Close button. |
| Public method Static member | Show(String, String, TaskDialogCommonButtons) | Shows a task dialog with title, main instruction and common buttons. |
| Public method Static member | Show(String, String, TaskDialogCommonButtons, TaskDialogResult) | Shows a task dialog with title, main instruction, common buttons and default buttons. |

# See Also

TaskDialog Class

TaskDialog Members

Autodesk.Revit.UI Namespace

#### EditorInteraction Constructor

---

|  |
| --- |
| EditorInteraction Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | EditorInteraction | Construct a default interaction. |
| Public method | EditorInteraction(EditorInteractionType) | Construct the interaction with the specified type. |

# See Also

EditorInteraction Class

EditorInteraction Members

Autodesk.Revit.UI Namespace

#### ElementWorksetFilter Constructor

---

|  |
| --- |
| ElementWorksetFilter Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | ElementWorksetFilter(WorksetId) | Constructs a new instance of a filter to match elements in a given workset. |
| Public method | ElementWorksetFilter(WorksetId, Boolean) | Constructs a new instance of a filter to match elements in a given workset. |

# See Also

ElementWorksetFilter Class

ElementWorksetFilter Members

Autodesk.Revit.DB Namespace

#### GetInstanceGeometry Method

---

|  |
| --- |
| GeometryInstance Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | GetInstanceGeometry | Computes the geometric representation of the instance. |
| Public method | GetInstanceGeometry(Transform) | Computes a transformation of the geometric representation of the instance. |

# See Also

GeometryInstance Class

GeometryInstance Members

Autodesk.Revit.DB Namespace

#### Create Method

---

|  |
| --- |
| FabricArea Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create(Document, Element, XYZ, ElementId, ElementId) | Creates a FabricArea based on a host boundary. |
| Public method Static member | Create(Document, Element, IList CurveLoop , XYZ, XYZ, ElementId, ElementId) | Creates a FabricArea from an array of curves. |

# See Also

FabricArea Class

FabricArea Members

Autodesk.Revit.DB.Structure Namespace

#### Create Method

---

|  |
| --- |
| TopographySurface Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create(Document, IList XYZ ) | Creates a new topography surface element and adds it to the document. |
| Public method Static member | Create(Document, IList XYZ , IList PolymeshFacet ) | Creates a new topography surface element from facets and adds it to the document. |

# See Also

TopographySurface Class

TopographySurface Members

Autodesk.Revit.DB.Architecture Namespace

#### SetPointCloudScanOverrideSettings Method

---

|  |
| --- |
| PointCloudOverrides Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | SetPointCloudScanOverrideSettings(ElementId, PointCloudOverrideSettings) | Assigns scan override settings to the whole PointCloudInstance element. |
| Public method | SetPointCloudScanOverrideSettings(ElementId, PointCloudOverrideSettings, String, Document) | Assigns scan override settings to a particular scan within a PointCloudInstance element. |

# See Also

PointCloudOverrides Class

PointCloudOverrides Members

Autodesk.Revit.DB.PointClouds Namespace

#### FillPattern Constructor

---

|  |
| --- |
| FillPattern Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | FillPattern | Creates a fill pattern with FillPatternHostOrientation::FPORIENTATION\_TO\_VIEW and FillPatternTarget::FPTARGET\_NONE. |
| Public method | FillPattern(FillPattern) | Constructs a new copy of the input FillPattern object. |
| Public method | FillPattern(String, FillPatternTarget, FillPatternHostOrientation) | Creates a fill pattern based on the given name, FillPatternTarget and FillPatternHostOrientation. |
| Public method | FillPattern(String, FillPatternTarget, FillPatternHostOrientation, Double, Double) | Creates a simple hatch fill pattern based on the given name, angle, spacing, FillPatternTarget and FillPatternHostOrientation. |
| Public method | FillPattern(String, FillPatternTarget, FillPatternHostOrientation, Double, Double, Double) | Creates a simple crosshatch fill pattern based on the given name, angle, spacing, FillPatternTarget and FillPatternHostOrientation. |

# See Also

FillPattern Class

FillPattern Members

Autodesk.Revit.DB Namespace

#### NewTypeBinding Method

---

|  |
| --- |
| Application Class   See Also |

Creates a new type binding object.

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | NewTypeBinding | Creates a new empty type binding object. |
| Public method | NewTypeBinding(CategorySet) | Creates a new type binding object containing the categories passed as a parameter. |

# See Also

Application Class

Application Members

Autodesk.Revit.Creation Namespace

#### CopyElements Method

---

|  |
| --- |
| ElementTransformUtils Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | CopyElements(Document, ICollection ElementId , XYZ) | Copies a set of elements and places the copies at a location indicated by a given translation. |
| Public method Static member | CopyElements(Document, ICollection ElementId , Document, Transform, CopyPasteOptions) | Copies a set of elements from source document to destination document. |
| Public method Static member | CopyElements(View, ICollection ElementId , View, Transform, CopyPasteOptions) | Copies a set of elements from source view to destination view. |

# See Also

ElementTransformUtils Class

ElementTransformUtils Members

Autodesk.Revit.DB Namespace

#### ConnectDuctPlaceholdersAtElbow Method

---

|  |
| --- |
| MechanicalUtils Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | ConnectDuctPlaceholdersAtElbow(Document, Connector, Connector) | Connects a pair of placeholders that can intersect in an Elbow connection. |
| Public method Static member | ConnectDuctPlaceholdersAtElbow(Document, ElementId, ElementId) | Connects a pair of placeholders that can intersect in an Elbow connection. |

# See Also

MechanicalUtils Class

MechanicalUtils Members

Autodesk.Revit.DB.Mechanical Namespace

#### ConnectPipePlaceholdersAtElbow Method

---

|  |
| --- |
| PlumbingUtils Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | ConnectPipePlaceholdersAtElbow(Document, Connector, Connector) | Connects placeholders that looks like elbow connection. |
| Public method Static member | ConnectPipePlaceholdersAtElbow(Document, ElementId, ElementId) | Connects placeholders that looks like elbow connection. |

# See Also

PlumbingUtils Class

PlumbingUtils Members

Autodesk.Revit.DB.Plumbing Namespace

#### Create Method

---

|  |
| --- |
| HermiteSpline Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create(IList XYZ , Boolean) | Creates a Hermite spline with default tangency at its endpoints. |
| Public method Static member | Create(IList XYZ , Boolean, HermiteSplineTangents) | Creates a Hermite spline with specified tangency at its endpoints. |

# See Also

HermiteSpline Class

HermiteSpline Members

Autodesk.Revit.DB Namespace

#### LoadFamilySymbol Method

---

|  |
| --- |
| Document Class   See Also |

Loads only a specified family type/symbol from a family file into the document.

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | LoadFamilySymbol(String, String) | Loads only a specified family type/symbol from a family file into the document. |
| Public method | LoadFamilySymbol(String, String, FamilySymbol ) | Loads only the specified family type/symbol from a family file into the document and provides a reference to the loaded family symbol. |
| Public method | LoadFamilySymbol(String, String, IFamilyLoadOptions, FamilySymbol ) | Loads only the specified family type/symbol from a family file into the document and provides a reference to the loaded family symbol. |

# See Also

Document Class

Document Members

Autodesk.Revit.DB Namespace

#### NewXYZ Method

---

|  |
| --- |
| Application Class   See Also |

Creates a XYZ object representing coordinates in 3-space.

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | NewXYZ | Creates a XYZ object at the origin. |
| Public method | NewXYZ(XYZ) | Creates a XYZ object by copying the supplied XYZ object. |
| Public method | NewXYZ(Double, Double, Double) | Creates a XYZ object representing coordinates in 3-space with supplied values. |

# See Also

Application Class

Application Members

Autodesk.Revit.Creation Namespace

#### UpdateMultiple Method

---

|  |
| --- |
| PathOfTravel Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | UpdateMultiple(Document, IList ElementId ) | Updates the specified paths of travel by recalculating each path using their original start and end points. |
| Public method Static member | UpdateMultiple(Document, IList ElementId , IList PathOfTravelCalculationStatus ) | Updates the specified paths of travel by recalculating each path using their original start and end points and provides creation result statuses. |

# See Also

PathOfTravel Class

PathOfTravel Members

Autodesk.Revit.DB.Analysis Namespace

#### CreateParts Method

---

|  |
| --- |
| PartUtils Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | CreateParts(Document, ICollection ElementId ) | Creates a new set of parts out of the original elements. |
| Public method Static member | CreateParts(Document, ICollection LinkElementId ) | Creates a new set of parts out of the original elements. |

# See Also

PartUtils Class

PartUtils Members

Autodesk.Revit.DB Namespace

#### CanElementsBeDisplaced Method

---

|  |
| --- |
| DisplacementElement Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | CanElementsBeDisplaced(View, ICollection ElementId ) | Indicates if elements can be assigned to a new DisplacementElement. |
| Public method Static member | CanElementsBeDisplaced(View, ICollection ElementId , ElementId ) | Indicates if elements can be assigned to a new DisplacementElement. |

# See Also

DisplacementElement Class

DisplacementElement Members

Autodesk.Revit.DB Namespace

#### GetCategory Method

---

|  |
| --- |
| Category Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | GetCategory(Document, BuiltInCategory) | Retrieves a category object corresponding to a BuiltInCategory id. |
| Public method Static member | GetCategory(Document, ElementId) | Retrieves a category object corresponding to the category id. |

# See Also

Category Class

Category Members

Autodesk.Revit.DB Namespace

#### Create Method

---

|  |
| --- |
| TextNote Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create(Document, ElementId, XYZ, String, ElementId) | Creates a new unwrapped TextNote element with the given properties. |
| Public method Static member | Create(Document, ElementId, XYZ, String, TextNoteOptions) | Creates a new unwrapped text note element with the given properties. |
| Public method Static member | Create(Document, ElementId, XYZ, Double, String, ElementId) | Creates a new line-wrapping text note element of the given width and properties. |
| Public method Static member | Create(Document, ElementId, XYZ, Double, String, TextNoteOptions) | Creates a new line-wrapping text note element of the given width and properties. |

# See Also

TextNote Class

TextNote Members

Autodesk.Revit.DB Namespace

#### IsValid Method

---

|  |
| --- |
| Alignment Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | IsValid | Checks if this object is a valid alignment. |
| Public method Static member | IsValid(Element) | Checks if the element is a valid alignment. |

# See Also

Alignment Class

Alignment Members

Autodesk.Revit.DB.Infrastructure Namespace

#### SelectableInViewFilter Constructor

---

|  |
| --- |
| SelectableInViewFilter Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | SelectableInViewFilter(Document, ElementId) | Constructs a new instance of an SelectableInViewFilter. |
| Public method | SelectableInViewFilter(Document, ElementId, Boolean) | Constructs a new instance of an SelectableInViewFilter, with the option to pass all non-selectable elements. |

# See Also

SelectableInViewFilter Class

SelectableInViewFilter Members

Autodesk.Revit.UI.Selection Namespace

#### MEPCalculationServerInfo Constructor

---

|  |
| --- |
| MEPCalculationServerInfo Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | MEPCalculationServerInfo | Constructs a new MEPCalculationServerInfo with default settings. |
| Public method | MEPCalculationServerInfo(IExternalServer) | Create a new MEPCalculationServerInfo by an external server. |
| Public method | MEPCalculationServerInfo(MEPCalculationServerInfo) | Constructs a new copy of the input MEPCalculationServerInfo object. |

# See Also

MEPCalculationServerInfo Class

MEPCalculationServerInfo Members

Autodesk.Revit.DB Namespace

#### ChangeTypeId Method

---

|  |
| --- |
| Element Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | ChangeTypeId(ElementId) | Changes the type of the element. |
| Public method Static member | ChangeTypeId(Document, ICollection ElementId , ElementId) | Changes the type of all elements in the given set. |

# See Also

Element Class

Element Members

Autodesk.Revit.DB Namespace

#### Frame Constructor

---

|  |
| --- |
| Frame Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | Frame | Default constructor. Uses global origin and standard basis vectors. |
| Public method | Frame(XYZ, XYZ, XYZ, XYZ) | Constructor that takes the frame's base point and three basis vectors. |

# See Also

Frame Class

Frame Members

Autodesk.Revit.DB Namespace

#### CanSuppressLeadingZeros Method

---

|  |
| --- |
| FormatOptions Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | CanSuppressLeadingZeros | Checks whether leading zeros can be suppressed for the display unit in this FormatOptions. |
| Public method Static member | CanSuppressLeadingZeros(ForgeTypeId) | Checks whether leading zeros can be suppressed for a given unit. |

# See Also

FormatOptions Class

FormatOptions Members

Autodesk.Revit.DB Namespace

#### SetSuperscriptStatus Method

---

|  |
| --- |
| FormattedText Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | SetSuperscriptStatus(Boolean) | Sets the characters in the entire text to be superscript or not superscript. |
| Public method | SetSuperscriptStatus(TextRange, Boolean) | Sets the characters in a given text range to be superscript or not superscript. |

# See Also

FormattedText Class

FormattedText Members

Autodesk.Revit.DB Namespace

#### FieldDomainPointsByUV Constructor

---

|  |
| --- |
| FieldDomainPointsByUV Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | FieldDomainPointsByUV(IList UV ) | Creates object from an array of two-dimensional point coordinates |
| Public method | FieldDomainPointsByUV(IList UV , ICollection Double , ICollection Double ) | Creates object from an array of two-dimensional point coordinates |

# See Also

FieldDomainPointsByUV Class

FieldDomainPointsByUV Members

Autodesk.Revit.DB.Analysis Namespace

#### GetRuleName Method

---

|  |
| --- |
| PerformanceAdviser Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | GetRuleName(Int32) | Retrieves the name of the rule. |
| Public method | GetRuleName(PerformanceAdviserRuleId) | Retrieves the name of the rule. |

# See Also

PerformanceAdviser Class

PerformanceAdviser Members

Autodesk.Revit.DB Namespace

#### FormatOptions Constructor

---

|  |
| --- |
| FormatOptions Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | FormatOptions | Creates a new FormatOptions object that represents default formatting. |
| Public method | FormatOptions(ForgeTypeId) | Creates a new FormatOptions object that represents custom formatting. |
| Public method | FormatOptions(FormatOptions) | Creates a copy of a FormatOptions object. |
| Public method | FormatOptions(ForgeTypeId, ForgeTypeId) | Creates a new FormatOptions object that represents custom formatting. |

# See Also

FormatOptions Class

FormatOptions Members

Autodesk.Revit.DB Namespace

#### AXMImportOptions Constructor

---

|  |
| --- |
| AXMImportOptions Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | AXMImportOptions | Constructs a new instance of AXMImportOptions with default values of all properties. |
| Public method | AXMImportOptions(AXMImportOptions) | Constructs a new instance of AXMImportOptions as a copy of the provided import options. |

# See Also

AXMImportOptions Class

AXMImportOptions Members

Autodesk.Revit.DB Namespace

#### SetActiveServer Method

---

|  |
| --- |
| SingleServerService Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | SetActiveServer(Guid) | Set an active server applicable application-wide for the service. |
| Public method | SetActiveServer(Guid, Document) | Change the active server for a specific document. |

# See Also

SingleServerService Class

SingleServerService Members

Autodesk.Revit.DB.ExternalService Namespace

#### ElementStructuralTypeFilter Constructor

---

|  |
| --- |
| ElementStructuralTypeFilter Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | ElementStructuralTypeFilter(StructuralType) | Constructs a new instance of a filter to match elements by structural type. |
| Public method | ElementStructuralTypeFilter(StructuralType, Boolean) | Constructs a new instance of a filter to match elements by structural type, with the option to match all elements which are of the given structural type. |

# See Also

ElementStructuralTypeFilter Class

ElementStructuralTypeFilter Members

Autodesk.Revit.DB Namespace

#### IsValid Method

---

|  |
| --- |
| AlignmentStationLabel Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | IsValid | Checks if this object is a valid alignment station label. |
| Public method Static member | IsValid(Element) | Checks if the element is a valid alignment station label. |

# See Also

AlignmentStationLabel Class

AlignmentStationLabel Members

Autodesk.Revit.DB.Infrastructure Namespace

#### SchedulableField Constructor

---

|  |
| --- |
| SchedulableField Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | SchedulableField | Creates a new SchedulableField. |
| Public method | SchedulableField(ScheduleFieldType) | Creates a new SchedulableField. |
| Public method | SchedulableField(ScheduleFieldType, ElementId) | Creates a new SchedulableField. |

# See Also

SchedulableField Class

SchedulableField Members

Autodesk.Revit.DB Namespace

#### Create Method

---

|  |
| --- |
| ExportDGNSettings Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create(Document, String) | Create a DGN export settings with default values. |
| Public method Static member | Create(Document, String, DGNExportOptions) | Create DGN export settings with specified values in DGNExportOptions. |

# See Also

ExportDGNSettings Class

ExportDGNSettings Members

Autodesk.Revit.DB Namespace

#### GetSymbolGeometry Method

---

|  |
| --- |
| GeometryInstance Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | GetSymbolGeometry | Computes the geometric representation of the symbol which generates this instance. |
| Public method | GetSymbolGeometry(Transform) | Computes a transformation of the geometric representation of the symbol which generates this instance. |

# See Also

GeometryInstance Class

GeometryInstance Members

Autodesk.Revit.DB Namespace

#### AnalysisDisplayColorSettings Constructor

---

|  |
| --- |
| AnalysisDisplayColorSettings Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | AnalysisDisplayColorSettings | Constructs a default instance of color settings. |
| Public method | AnalysisDisplayColorSettings(AnalysisDisplayColorSettings) | Constructs a new copy of the input AnalysisDisplayColorSettings object. |

# See Also

AnalysisDisplayColorSettings Class

AnalysisDisplayColorSettings Members

Autodesk.Revit.DB.Analysis Namespace

#### GetItalicStatus Method

---

|  |
| --- |
| FormattedText Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | GetItalicStatus | Returns whether  All  ,  None  or a  Mixed  of characters in the entire text are italic. |
| Public method | GetItalicStatus(TextRange) | Returns whether  All  ,  None  or a  Mixed  set of characters in a given text range are italic. |

# See Also

FormattedText Class

FormattedText Members

Autodesk.Revit.DB Namespace

#### ExecuteRules Method

---

|  |
| --- |
| PerformanceAdviser Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | ExecuteRules(Document, IList PerformanceAdviserRuleId ) | Executes selected rules on a given document. |
| Public method | ExecuteRules(Document, IList Int32 ) | Executes selected rules on a given document. |

# See Also

PerformanceAdviser Class

PerformanceAdviser Members

Autodesk.Revit.DB Namespace

#### LogicalOrFilter Constructor

---

|  |
| --- |
| LogicalOrFilter Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | LogicalOrFilter(IList ElementFilter ) | Constructs a new instance of the logical filter with any number of input filters. |
| Public method | LogicalOrFilter(ElementFilter, ElementFilter) | Constructs a new instance of the logical filter with two input filters. |

# See Also

LogicalOrFilter Class

LogicalOrFilter Members

Autodesk.Revit.DB Namespace

#### DirectContext3DHandleSettings Constructor

---

|  |
| --- |
| DirectContext3DHandleSettings Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | DirectContext3DHandleSettings | Constructs an instance of settings with default values. |
| Public method | DirectContext3DHandleSettings(DirectContext3DHandleSettings) | Constructs a copy of source object. |
| Public method | DirectContext3DHandleSettings(Boolean, Int32) | Constructs an instance of settings with provided values. |

# See Also

DirectContext3DHandleSettings Class

DirectContext3DHandleSettings Members

Autodesk.Revit.DB.DirectContext3D Namespace

#### GetElement Method

---

|  |
| --- |
| Document Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | GetElement(String) | Gets the Element referenced by a unique id string. |
| Public method | GetElement(ElementId) | Gets the Element referenced by the input ElementId. |
| Public method | GetElement(Reference) | Gets the Element referenced by the input reference. |

# See Also

Document Class

Document Members

Autodesk.Revit.DB Namespace

#### DockablePaneState Constructor

---

|  |
| --- |
| DockablePaneState Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | DockablePaneState | Creates a new DockablePaneState object. |
| Public method | DockablePaneState(DockablePaneState) | Constructs a new copy of the input DockablePaneState object. |

# See Also

DockablePaneState Class

DockablePaneState Members

Autodesk.Revit.UI Namespace

#### CheckoutElements Method

---

|  |
| --- |
| WorksharingUtils Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | CheckoutElements(Document, ICollection ElementId ) | Obtains ownership for the current user of as many specified elements as possible. |
| Public method Static member | CheckoutElements(Document, ISet ElementId , TransactWithCentralOptions) | Obtains ownership for the current user of as many specified elements as possible. |

# See Also

WorksharingUtils Class

WorksharingUtils Members

Autodesk.Revit.DB Namespace

#### GetCellCombinedParameters Method

---

|  |
| --- |
| TableSectionData Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | GetCellCombinedParameters(Int32) | Returns an array of combined parameter data for the specified column |
| Public method | GetCellCombinedParameters(Int32, Int32) | Returns an array of combined parameter data for the specified cell |

# See Also

TableSectionData Class

TableSectionData Members

Autodesk.Revit.DB Namespace

#### LoadFrom Method

---

|  |
| --- |
| CADLinkType Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | LoadFrom(String) | Loads or reloads the DWG link from the given file path. |
| Public method | LoadFrom(ExternalResourceReference) | Loads or reloads the DWG link from the given external resource reference. |

# See Also

CADLinkType Class

CADLinkType Members

Autodesk.Revit.DB Namespace

#### ReInsert Method

---

|  |
| --- |
| BindingMap Class   See Also |

Removes an existing parameter and creates a new binding for a given parameter.

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | ReInsert(Definition, Binding) | Removes an existing parameter and creates a new binding for a given parameter. |
| Public method | ReInsert(Definition, Binding, BuiltInParameterGroup) | Removes an existing parameter and creates a new binding for a given parameter in a specified group. |
| Public method | ReInsert(Definition, Binding, ForgeTypeId) | Removes an existing parameter and creates a new binding for a given parameter in a specified group. |

# See Also

BindingMap Class

BindingMap Members

Autodesk.Revit.DB Namespace

#### StructuralInstanceUsageFilter Constructor

---

|  |
| --- |
| StructuralInstanceUsageFilter Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | StructuralInstanceUsageFilter(StructuralInstanceUsage) | Constructs a new instance of a filter to match structural family instances (typically columns, beams, or braces) of the given structural usage. |
| Public method | StructuralInstanceUsageFilter(StructuralInstanceUsage, Boolean) | Constructs a new instance of a filter to match family instances by structural usage, with the option to match all family instances which are not of the given structural usage. |

# See Also

StructuralInstanceUsageFilter Class

StructuralInstanceUsageFilter Members

Autodesk.Revit.DB.Structure Namespace

#### Clear Method

---

|  |
| --- |
| Entity Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | Clear(String) | Resets the field to its default value. |
| Public method | Clear(Field) | Resets the field to its default value. |

# See Also

Entity Class

Entity Members

Autodesk.Revit.DB.ExtensibleStorage Namespace

#### OBJExportOptions Constructor

---

|  |
| --- |
| OBJExportOptions Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | OBJExportOptions | Constructs a new instance of OBJExportOptions with default values of all properties. |
| Public method | OBJExportOptions(ExportResolution) | Constructs a new instance of OBJExportOptions with all predefined tessellation settings, depending on export resolution type. Note: in case of Custom resolution type, tessellation settings won't be predefined and will have default values. |

# See Also

OBJExportOptions Class

OBJExportOptions Members

Autodesk.Revit.DB Namespace

#### Create Method

---

|  |
| --- |
| MechanicalSystem Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create(Document, ElementId) | Creates a new instance of a mechanical system and adds it to the document. |
| Public method Static member | Create(Document, ElementId, String) | Creates a new instance of a mechanical system and adds it to the document. |

# See Also

MechanicalSystem Class

MechanicalSystem Members

Autodesk.Revit.DB.Mechanical Namespace

#### AddBarGeometry Method

---

|  |
| --- |
| RebarCurvesData Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | AddBarGeometry(IList Curve ) | Adds a new bar to the new rebar geometry. This information is set to the rebar after the API execution is finished successfully. |
| Public method | AddBarGeometry(CurveLoop) | Adds a new bar to the new rebar geometry. This information is set to the rebar after the API execution is finished successfully. |

# See Also

RebarCurvesData Class

RebarCurvesData Members

Autodesk.Revit.DB.Structure Namespace

#### NewFascia Method

---

|  |
| --- |
| Document Class   See Also |

Creates a fascia.

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | NewFascia(FasciaType, Reference) | Creates a fascia along a reference. |
| Public method | NewFascia(FasciaType, ReferenceArray) | Creates a fascia along a reference array. |

# See Also

Document Class

Document Members

Autodesk.Revit.Creation Namespace

#### ElementDesignOptionFilter Constructor

---

|  |
| --- |
| ElementDesignOptionFilter Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | ElementDesignOptionFilter(ElementId) | Constructs a new instance of a filter to match elements contained within a particular design option. |
| Public method | ElementDesignOptionFilter(ElementId, Boolean) | Constructs a new instance of a filter to match elements contained within a particular design option, with the option to invert the filter and find elements not contained within a particular design option. |

# See Also

ElementDesignOptionFilter Class

ElementDesignOptionFilter Members

Autodesk.Revit.DB Namespace

#### LinkLoadResult Constructor

---

|  |
| --- |
| LinkLoadResult Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | LinkLoadResult | Constructs a new uninitialized LinkLoadResult object. |
| Public method | LinkLoadResult(LinkLoadResult) | Constructs a new copy of the input LinkLoadResult object. |

# See Also

LinkLoadResult Class

LinkLoadResult Members

Autodesk.Revit.DB Namespace

#### StructuralMaterialTypeFilter Constructor

---

|  |
| --- |
| StructuralMaterialTypeFilter Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | StructuralMaterialTypeFilter(StructuralMaterialType) | Constructs a new instance of a filter to match family instances that have the given structural material type. |
| Public method | StructuralMaterialTypeFilter(StructuralMaterialType, Boolean) | Constructs a new instance of a filter to match family instances by structural material type, with the option to match all families which are not of the given structural material type. |

# See Also

StructuralMaterialTypeFilter Class

StructuralMaterialTypeFilter Members

Autodesk.Revit.DB.Structure Namespace

#### ElementPhaseStatusFilter Constructor

---

|  |
| --- |
| ElementPhaseStatusFilter Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | ElementPhaseStatusFilter(ElementId, ElementOnPhaseStatus) | Constructs a new instance of a file to match elements that have a given phase status on the input phase. |
| Public method | ElementPhaseStatusFilter(ElementId, ICollection ElementOnPhaseStatus ) | Constructs a new instance of a file to match elements that have a given phase statuses on the input phase. |
| Public method | ElementPhaseStatusFilter(ElementId, ElementOnPhaseStatus, Boolean) | Constructs a new instance of a file to match elements that have a given phase status on the input phase, with the option to match all elements that have a phase status other than the input status. |
| Public method | ElementPhaseStatusFilter(ElementId, ICollection ElementOnPhaseStatus , Boolean) | Constructs a new instance of a file to match elements that have a given phase statuses on the input phase, with the option to match all elements that have a phase status other than the input statuses. |

# See Also

ElementPhaseStatusFilter Class

ElementPhaseStatusFilter Members

Autodesk.Revit.DB Namespace

#### GetSubscriptStatus Method

---

|  |
| --- |
| FormattedText Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | GetSubscriptStatus | Returns whether  All  ,  None  or a  Mixed  of characters in the entire text are subscripted. |
| Public method | GetSubscriptStatus(TextRange) | Returns whether  All  ,  None  or a  Mixed  set of characters in a given text range are subscripted. |

# See Also

FormattedText Class

FormattedText Members

Autodesk.Revit.DB Namespace

#### ModifySubElement Method

---

|  |
| --- |
| SlabShapeEditor Class   See Also |

Manipulates an entity on the corresponding slab, roof or floor.

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | ModifySubElement(SlabShapeCrease, Double) | Manipulates the crease on the corresponding slab, roof or floor. |
| Public method | ModifySubElement(SlabShapeVertex, Double) | Manipulates the vertex on the corresponding slab, roof or floor. |

# See Also

SlabShapeEditor Class

SlabShapeEditor Members

Autodesk.Revit.DB Namespace

#### NewFamilyInstanceCreationData Method

---

|  |
| --- |
| Application Class   See Also |

Creates an adaptive component which wraps the arguments of NewFamilyInstance() for batch creation.

Creates an object which wraps the arguments of NewFamilyInstance() for batch creation.

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | NewFamilyInstanceCreationData(FamilySymbol, IList XYZ ) | Creates an object which wraps the arguments of NewFamilyInstance() for batch creation. |
| Public method | NewFamilyInstanceCreationData(Face, Line, FamilySymbol) | Creates an object which wraps the arguments of NewFamilyInstance() for batch creation. |
| Public method | NewFamilyInstanceCreationData(XYZ, FamilySymbol, StructuralType) | Creates an object which wraps the arguments of NewFamilyInstance() for batch creation. |
| Public method | NewFamilyInstanceCreationData(Curve, FamilySymbol, Level, StructuralType) | Creates an object which wraps the arguments of NewFamilyInstance() for batch creation. |
| Public method | NewFamilyInstanceCreationData(Face, XYZ, XYZ, FamilySymbol) | Creates an object which wraps the arguments of NewFamilyInstance() for batch creation. |
| Public method | NewFamilyInstanceCreationData(XYZ, FamilySymbol, Element, StructuralType) | Creates an object which wraps the arguments of NewFamilyInstance() for batch creation. |
| Public method | NewFamilyInstanceCreationData(XYZ, FamilySymbol, Level, StructuralType) | Creates an object which wraps the arguments of NewFamilyInstance() for batch creation. |
| Public method | NewFamilyInstanceCreationData(XYZ, FamilySymbol, Element, Level, StructuralType) | Creates an object which wraps the arguments of NewFamilyInstance() for batch creation. |
| Public method | NewFamilyInstanceCreationData(XYZ, FamilySymbol, XYZ, Element, StructuralType) | Creates an object which wraps the arguments of NewFamilyInstance() for batch creation. |

# See Also

Application Class

Application Members

Autodesk.Revit.Creation Namespace

#### SetCellType Method

---

|  |
| --- |
| TableSectionData Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | SetCellType(Int32, CellType) | Sets a column's cell type |
| Public method | SetCellType(Int32, Int32, CellType) | Sets a cell's Type |

# See Also

TableSectionData Class

TableSectionData Members

Autodesk.Revit.DB Namespace

#### Set Method

---

|  |
| --- |
| Parameter Class   See Also |

Sets the parameter to a new value.

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | Set(Double) | Sets the parameter to a new real number value. |
| Public method | Set(Int32) | Sets the parameter to a new integer value. |
| Public method | Set(String) | Sets the parameter to a new string of text. |
| Public method | Set(ElementId) | Sets the parameter to a new element id. |

# See Also

Parameter Class

Parameter Members

Autodesk.Revit.DB Namespace

#### CreateMapped Method

---

|  |
| --- |
| PathOfTravel Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | CreateMapped(View, IList XYZ , IList XYZ ) | Creates multiple new paths of travel by mapping each of a set of start points to each of a set of end points. |
| Public method Static member | CreateMapped(View, IList XYZ , IList XYZ , IList PathOfTravelCalculationStatus ) | Creates multiple new paths of travel by mapping each of a set of start points to each of a set of end points and provides creation result statuses. |

# See Also

PathOfTravel Class

PathOfTravel Members

Autodesk.Revit.DB.Analysis Namespace

#### GetUnderlineStatus Method

---

|  |
| --- |
| FormattedText Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | GetUnderlineStatus | Returns whether  All  ,  None  or a  Mixed  of characters in the entire text are underlined. |
| Public method | GetUnderlineStatus(TextRange) | Returns whether  All  ,  None  or a  Mixed  set of characters in a given text range are underlined. |

# See Also

FormattedText Class

FormattedText Members

Autodesk.Revit.DB Namespace

#### TessellatedFace Constructor

---

|  |
| --- |
| TessellatedFace Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | TessellatedFace(IList XYZ , ElementId) | Constructs a tessellated face without holes. Face data is always set, even if the input data are invalid (e.g., describes a wildly non-planar face). A TessellatedShepeBuilder's function is used to check the data and heal them if possible. |
| Public method | TessellatedFace(IList IList XYZ , ElementId) | Constructs a tessellated face, which, may be, have holes. Face data is always set, even if the input data are invalid (e.g., describes a wildly non-planar face). A TessellatedShepeBuilder's function is used to check the data and heal them if possible. |

# See Also

TessellatedFace Class

TessellatedFace Members

Autodesk.Revit.DB Namespace

#### Create Method

---

|  |
| --- |
| RuledSurface Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create(Curve, Curve) | Creates a Surface object coincident with the ruled surface joining two bounded generating curves. |
| Public method Static member | Create(Curve, XYZ) | Creates a Surface object coincident with the ruled surface joining a bounded generating curve to a point. |

# See Also

RuledSurface Class

RuledSurface Members

Autodesk.Revit.DB Namespace

#### IsCellOverridden Method

---

|  |
| --- |
| TableSectionData Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | IsCellOverridden(Int32) | Indicates if the column is overridden or not. |
| Public method | IsCellOverridden(Int32, Int32) | Indicates if the cell is overridden or not. |

# See Also

TableSectionData Class

TableSectionData Members

Autodesk.Revit.DB Namespace

#### AddCutBetweenSolids Method

---

|  |
| --- |
| SolidSolidCutUtils Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | AddCutBetweenSolids(Document, Element, Element) | Adds a solid-solid cut for the two elements. |
| Public method Static member | AddCutBetweenSolids(Document, Element, Element, Boolean) | Adds a solid-solid cut for the two elements with the option to control splitting of faces of the cutting solid. |

# See Also

SolidSolidCutUtils Class

SolidSolidCutUtils Members

Autodesk.Revit.DB Namespace

#### Transform2D Constructor

---

|  |
| --- |
| Transform2D Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | Transform2D(Transform2D) | The copy constructor. |
| Public method | Transform2D(UV, UV, UV) | Constructs the transformation by specifying the vectors and the origin. |

# See Also

Transform2D Class

Transform2D Members

Autodesk.Revit.DB Namespace

#### ConnectDuctPlaceholdersAtCross Method

---

|  |
| --- |
| MechanicalUtils Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | ConnectDuctPlaceholdersAtCross(Document, ElementId, ElementId) | Connects a pair of placeholders that can intersect in a Cross connection. |
| Public method Static member | ConnectDuctPlaceholdersAtCross(Document, ElementId, ElementId, ElementId) | Connects a trio of placeholders that can intersect in a Cross connection. |
| Public method Static member | ConnectDuctPlaceholdersAtCross(Document, Connector, Connector, Connector, Connector) | Connects a group of placeholders that can intersect in a Cross connection. |

# See Also

MechanicalUtils Class

MechanicalUtils Members

Autodesk.Revit.DB.Mechanical Namespace

#### NewAreaBoundaryConditions Method

---

|  |
| --- |
| Document Class   See Also |

Creates a new Area BoundaryConditions element.

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | NewAreaBoundaryConditions(Element, TranslationRotationValue, Double, TranslationRotationValue, Double, TranslationRotationValue, Double) | Creates a new Area BoundaryConditions element on a host element. |
| Public method | NewAreaBoundaryConditions(Reference, TranslationRotationValue, Double, TranslationRotationValue, Double, TranslationRotationValue, Double) | Creates a new Area BoundaryConditions element on a reference. |

# See Also

Document Class

Document Members

Autodesk.Revit.Creation Namespace

#### ConnectDuctPlaceholdersAtTee Method

---

|  |
| --- |
| MechanicalUtils Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | ConnectDuctPlaceholdersAtTee(Document, ElementId, ElementId) | Connects a pair of placeholders that can intersect in a Tee connection. |
| Public method Static member | ConnectDuctPlaceholdersAtTee(Document, Connector, Connector, Connector) | Connects a trio of placeholders that can intersect in a Tee connection. |

# See Also

MechanicalUtils Class

MechanicalUtils Members

Autodesk.Revit.DB.Mechanical Namespace

#### AddBarGeometry Method

---

|  |
| --- |
| RebarTrimExtendData Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | AddBarGeometry(IList Curve ) | Adds a new rebar geometry. This information is set to the rebar after the API execution is finished successfully. |
| Public method | AddBarGeometry(CurveLoop) | Adds a new rebar geometry. This information is set to the rebar after the API execution is finished successfully. |

# See Also

RebarTrimExtendData Class

RebarTrimExtendData Members

Autodesk.Revit.DB.Structure Namespace

#### GetPointCloudRegionOverrideSettings Method

---

|  |
| --- |
| PointCloudOverrides Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | GetPointCloudRegionOverrideSettings(ElementId) | Gets region override settings assigned to the whole PointCloudInstance element. |
| Public method | GetPointCloudRegionOverrideSettings(ElementId, String, Document) | Gets override settings assigned to a particular region within a PointCloudInstance element. |

# See Also

PointCloudOverrides Class

PointCloudOverrides Members

Autodesk.Revit.DB.PointClouds Namespace

#### CADLinkOptions Constructor

---

|  |
| --- |
| CADLinkOptions Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | CADLinkOptions(CADLinkOptions) | Constructs a new copy of the input CADLinkOptions object. |
| Public method | CADLinkOptions(Boolean, ElementId) | Creates a CADLinkOptions object, specifying whether to preserve graphic overrides, and what view to use if the link's view has been deleted. |

# See Also

CADLinkOptions Class

CADLinkOptions Members

Autodesk.Revit.DB Namespace

#### GetConstraintCandidatesForHandle Method

---

|  |
| --- |
| RebarConstraintsManager Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | GetConstraintCandidatesForHandle(RebarConstrainedHandle) | For shape driven rebar returns all possible RebarConstraints that could be used for a specified RebarConstrainedHandle.  For free form rebar will return an empty list. |
| Public method | GetConstraintCandidatesForHandle(RebarConstrainedHandle, ElementId) | For shape driven rebar returns all possible RebarConstraints belonging to references from the provided element that could be used for a specified RebarConstrainedHandle.  For free form rebar will return an empty list. |
| Public method | GetConstraintCandidatesForHandle(RebarConstrainedHandle, Reference) | For shape driven rebar returns all possible RebarConstraints that will constrain RebarConstrainedHandle to the provided reference.  For free form rebar will return an empty lists. |

# See Also

RebarConstraintsManager Class

RebarConstraintsManager Members

Autodesk.Revit.DB.Structure Namespace

#### BringForward Method

---

|  |
| --- |
| DetailElementOrderUtils Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | BringForward(Document, View, ElementId) | Moves the given detail instance one step closer to the front of all other detail instances in the view. |
| Public method Static member | BringForward(Document, View, ICollection ElementId ) | Moves the given detail instances one step closer to the front of all other detail instances in the view, while keeping the order of the given ones. |

# See Also

DetailElementOrderUtils Class

DetailElementOrderUtils Members

Autodesk.Revit.DB Namespace

#### PickBox Method

---

|  |
| --- |
| Selection Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | PickBox(PickBoxStyle) | Invokes a general purpose two-click editor that lets the user to specify a rectangular area on the screen. |
| Public method | PickBox(PickBoxStyle, String) | Invokes a general purpose two-click editor that lets the user to specify a rectangular area on the screen. |

# See Also

Selection Class

Selection Members

Autodesk.Revit.UI.Selection Namespace

#### NewGutter Method

---

|  |
| --- |
| Document Class   See Also |

Creates a gutter.

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | NewGutter(GutterType, Reference) | Creates a gutter along a reference. |
| Public method | NewGutter(GutterType, ReferenceArray) | Creates a gutter along a reference array. |

# See Also

Document Class

Document Members

Autodesk.Revit.Creation Namespace

#### ToggleButtonData Constructor

---

|  |
| --- |
| ToggleButtonData Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | ToggleButtonData(String, String) | Constructs a new instance of ToggleButtonData, where the ToggleButton will not be associated to an ExternalCommand. |
| Public method | ToggleButtonData(String, String, String, String) | Constructs a new instance of ToggleButtonData, where the ToggleButton will execute an ExternalCommand when clicked. |

# See Also

ToggleButtonData Class

ToggleButtonData Members

Autodesk.Revit.UI Namespace

#### Space Property

---

|  |
| --- |
| FamilyInstance Class   See Also |

The space in which the instance is located.

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public property | Space | The space in which the instance is located (during the last phase of the project). |
| Public property | Space Phase |  |

# See Also

FamilyInstance Class

FamilyInstance Members

Autodesk.Revit.DB Namespace

#### AnalysisDisplayDeformedShapeSettings Constructor

---

|  |
| --- |
| AnalysisDisplayDeformedShapeSettings Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | AnalysisDisplayDeformedShapeSettings | Constructs a default instance of deformed shape settings. |
| Public method | AnalysisDisplayDeformedShapeSettings(AnalysisDisplayDeformedShapeSettings) | Constructs a new copy of the input AnalysisDisplayDeformedShapeSettings object. |

# See Also

AnalysisDisplayDeformedShapeSettings Class

AnalysisDisplayDeformedShapeSettings Members

Autodesk.Revit.DB.Analysis Namespace

#### InitialWattageIntensity Constructor

---

|  |
| --- |
| InitialWattageIntensity Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | InitialWattageIntensity(InitialWattageIntensity) | Creates a copy of the given initial wattage intensity object |
| Public method | InitialWattageIntensity(Double, Double) | Creates an initial wattage intensity object with the given values. |

# See Also

InitialWattageIntensity Class

InitialWattageIntensity Members

Autodesk.Revit.DB.Lighting Namespace

#### InCanvasControlData Constructor

---

|  |
| --- |
| InCanvasControlData Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | InCanvasControlData(String) | Constructs an InCanvasControlData with specific values assigned. |
| Public method | InCanvasControlData(String, XYZ) | Constructs an InCanvasControlData with specific values assigned. |

# See Also

InCanvasControlData Class

InCanvasControlData Members

Autodesk.Revit.DB Namespace

#### CalculateExtrusionData Method

---

|  |
| --- |
| IFCExtrusionCalculatorUtils Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | CalculateExtrusionData(IFCExtrusionCalculatorOptions, GeometryObject) | Calculates the extrusion data from a Revit geometry object. |
| Public method Static member | CalculateExtrusionData(IFCExtrusionCalculatorOptions, IList Face ) |  |

# See Also

IFCExtrusionCalculatorUtils Class

IFCExtrusionCalculatorUtils Members

Autodesk.Revit.DB.IFC Namespace

#### UpdateFromIFC Method

---

|  |
| --- |
| RevitLinkType Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | UpdateFromIFC(Document, ExternalResourceReference, String, Boolean) | Updates a Revit link type from an IFC file and loads the linked document. |
| Public method | UpdateFromIFC(Document, String, String, Boolean) | Updates a Revit link type from an IFC file and loads the linked document. |

# See Also

RevitLinkType Class

RevitLinkType Members

Autodesk.Revit.DB Namespace

#### GetBoldStatus Method

---

|  |
| --- |
| FormattedText Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | GetBoldStatus | Returns whether  All  ,  None  or a  Mixed  of characters in the entire text are bold. |
| Public method | GetBoldStatus(TextRange) | Returns whether  All  ,  None  or a  Mixed  set of characters in a given text range are bold. |

# See Also

FormattedText Class

FormattedText Members

Autodesk.Revit.DB Namespace

#### SetActiveServers Method

---

|  |
| --- |
| MultiServerService Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | SetActiveServers(IList Guid ) | Changes the active servers and/or their order. |
| Public method | SetActiveServers(IList Guid , Document) | Changes the active servers and/or their order for the given document. |

# See Also

MultiServerService Class

MultiServerService Members

Autodesk.Revit.DB.ExternalService Namespace

#### DissolveForms Method

---

|  |
| --- |
| FormUtils Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | DissolveForms(Document, ICollection ElementId ) | Dissolves a collection of form elements into their defining elements. |
| Public method Static member | DissolveForms(Document, ICollection ElementId , ICollection ElementId ) | Dissolves a collection of form elements into their defining elements. |

# See Also

FormUtils Class

FormUtils Members

Autodesk.Revit.DB Namespace

#### Create Method

---

|  |
| --- |
| IndependentTag Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create(Document, ElementId, ElementId, Reference, Boolean, TagOrientation, XYZ) | Places a tag on an element or subelement. |
| Public method Static member | Create(Document, ElementId, Reference, Boolean, TagMode, TagOrientation, XYZ) | Places a tag on an element or subelement. |

# See Also

IndependentTag Class

IndependentTag Members

Autodesk.Revit.DB Namespace

#### CreateEndsWithRule Method

---

|  |
| --- |
| ParameterFilterRuleFactory Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | CreateEndsWithRule(ElementId, String) | Creates a filter rule that determines whether strings from the document end with a certain string value. |
| Public method Static member | CreateEndsWithRule(ElementId, String, Boolean) | **Obsolete.**   Creates a filter rule that determines whether strings from the document end with a certain string value. |

# See Also

ParameterFilterRuleFactory Class

ParameterFilterRuleFactory Members

Autodesk.Revit.DB Namespace

#### CreatePointSetIterator Method

---

|  |
| --- |
| IPointCloudAccess Interface   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | CreatePointSetIterator(PointCloudFilter, ElementId) | Implement this method to return an iterator for iterating over blocks of this point cloud. |
| Public method | CreatePointSetIterator(PointCloudFilter, Double, ElementId) | Implement this method to return an iterator for iterating over blocks of this point cloud. |

# See Also

IPointCloudAccess Interface

IPointCloudAccess Members

Autodesk.Revit.DB.PointClouds Namespace

#### AnalyticalModelSelector Constructor

---

|  |
| --- |
| AnalyticalModelSelector Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | AnalyticalModelSelector | Creates a selector for the analytical model geometry. |
| Public method | AnalyticalModelSelector(AnalyticalCurveSelector) | Creates a selector for the analytical model geometry. |
| Public method | AnalyticalModelSelector(Curve) | Creates a selector based on a specific analytical curve. |
| Public method | AnalyticalModelSelector(Curve, AnalyticalCurveSelector) | Creates a selector based on one portion of a specific analytical curve. |

# See Also

AnalyticalModelSelector Class

AnalyticalModelSelector Members

Autodesk.Revit.DB.Structure Namespace

#### Create Method

---

|  |
| --- |
| PropertySetElement Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create(Document, StructuralAsset) | Creates a new PropertySetElement to contain the given asset. |
| Public method Static member | Create(Document, ThermalAsset) | Creates a new PropertySetElement to contain the given asset. |

# See Also

PropertySetElement Class

PropertySetElement Members

Autodesk.Revit.DB Namespace

#### AddStackedItems Method

---

|  |
| --- |
| RibbonPanel Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | AddStackedItems(RibbonItemData, RibbonItemData) | Adds two stacked items to the panel. |
| Public method | AddStackedItems(RibbonItemData, RibbonItemData, RibbonItemData) | Adds three stacked items to the panel. |

# See Also

RibbonPanel Class

RibbonPanel Members

Autodesk.Revit.UI Namespace

#### XYZ Constructor

---

|  |
| --- |
| XYZ Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | XYZ | Creates a default XYZ with the values (0, 0, 0). |
| Public method | XYZ(Double, Double, Double) | Creates an XYZ with the supplied coordinates. |

# See Also

XYZ Class

XYZ Members

Autodesk.Revit.DB Namespace

#### Create Method

---

|  |
| --- |
| PointLoad Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create(Document, ElementId, AnalyticalElementSelector, XYZ, XYZ, PointLoadType) | Creates a new hosted point load within the project. |
| Public method Static member | Create(Document, XYZ, XYZ, XYZ, PointLoadType, SketchPlane) | Creates a new non-hosted point load within the project using data at point. |

# See Also

PointLoad Class

PointLoad Members

Autodesk.Revit.DB.Structure Namespace

#### IsAlmostEqualTo Method

---

|  |
| --- |
| UV Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | IsAlmostEqualTo(UV) | Determines whether this 2-D vector and the specified 2-D vector are the same within the tolerance (1.0e-09). |
| Public method | IsAlmostEqualTo(UV, Double) | Determines whether this 2-D vector and the specified 2-D vector are the same within a specified tolerance. |

# See Also

UV Class

UV Members

Autodesk.Revit.DB Namespace

#### ResetCellOverride Method

---

|  |
| --- |
| TableSectionData Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | ResetCellOverride(Int32) | Resets the override of the column. |
| Public method | ResetCellOverride(Int32, Int32) | Resets the override of the cell. |

# See Also

TableSectionData Class

TableSectionData Members

Autodesk.Revit.DB Namespace

#### PickPoint Method

---

|  |
| --- |
| Selection Class   See Also |

Prompts the user to pick a point on the active work plane.

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | PickPoint | Prompts the user to pick a point on the active work plane. |
| Public method | PickPoint(String) | Prompts the user to pick a point on the active work plane while showing a custom status prompt string. |
| Public method | PickPoint(ObjectSnapTypes) | Prompts the user to pick a point on the active work plane using specified snap settings. |
| Public method | PickPoint(ObjectSnapTypes, String) | Prompts the user to pick a point on the active work plane using specified snap settings while showing a custom status prompt string. |

# See Also

Selection Class

Selection Members

Autodesk.Revit.UI.Selection Namespace

#### SetShape Method

---

|  |
| --- |
| DirectShapeType Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | SetShape(IList GeometryObject ) | Builds the type shape from the supplied collection of GeometryObjects. The objects are copied. If the new shape is identical to the old one, the old shape will be kept. |
| Public method | SetShape(ShapeBuilder) | Sets the shape of this object to the one accumulated in the supplied Builder object. If the new shape is identical to the old one, the old shape will be kept. |

# See Also

DirectShapeType Class

DirectShapeType Members

Autodesk.Revit.DB Namespace

#### CreateSingleLayerCompoundStructure Method

---

|  |
| --- |
| CompoundStructure Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | CreateSingleLayerCompoundStructure(MaterialFunctionAssignment, Double, ElementId) | Creates a CompoundStructure containing a single layer. |
| Public method Static member | CreateSingleLayerCompoundStructure(Double, MaterialFunctionAssignment, Double, ElementId) | Creates a vertically compound CompoundStructure with one layer. |

# See Also

CompoundStructure Class

CompoundStructure Members

Autodesk.Revit.DB Namespace

#### LineLightShape Constructor

---

|  |
| --- |
| LineLightShape Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | LineLightShape | Creates a line light shape object with 2.0' emit length. |
| Public method | LineLightShape(Double) | Creates a line light shape object with the given emit length. |
| Public method | LineLightShape(LineLightShape) | Creates a copy of the given line light shape |

# See Also

LineLightShape Class

LineLightShape Members

Autodesk.Revit.DB.Lighting Namespace

#### SplitStraight Method

---

|  |
| --- |
| FabricationPart Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | SplitStraight(XYZ) | Splits the straight into two at the passed in point. |
| Public method | SplitStraight(Document, ElementId, XYZ) | Splits the straight into two at the passed in point. |

# See Also

FabricationPart Class

FabricationPart Members

Autodesk.Revit.DB Namespace

#### CanBeDivisionProfile Method

---

|  |
| --- |
| PartMakerMethodToDivideVolumes Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | CanBeDivisionProfile(ElementId) | Checks whether a family defines a profile which can be used by this method. |
| Public method Static member | CanBeDivisionProfile(ElementId, Document) | Checks whether a family defines a profile which can be used by this method. |

# See Also

PartMakerMethodToDivideVolumes Class

PartMakerMethodToDivideVolumes Members

Autodesk.Revit.DB Namespace

#### AddReferencePoint Method

---

|  |
| --- |
| DirectShape Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | AddReferencePoint(XYZ) | Adds a reference point to the DirectShape. |
| Public method | AddReferencePoint(XYZ, DirectShapeReferenceOptions) | Adds a reference point to the DirectShape. |

# See Also

DirectShape Class

DirectShape Members

Autodesk.Revit.DB Namespace

#### IsRuleEnabled Method

---

|  |
| --- |
| PerformanceAdviser Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | IsRuleEnabled(Int32) | Retrieves an enabled/disabled status for the given rule. |
| Public method | IsRuleEnabled(PerformanceAdviserRuleId) | Retrieves an enabled/disabled status for the given rule. |

# See Also

PerformanceAdviser Class

PerformanceAdviser Members

Autodesk.Revit.DB Namespace

#### Create Method

---

|  |
| --- |
| RevolvedSurface Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create(Frame, Curve) | Creates a Surface object coincident with the surface of revolution defined by a coordinate frame and a profile curve. |
| Public method Static member | Create(XYZ, XYZ, Curve) | Creates a Surface object coincident with the surface of revolution defined by an axis and a profile curve. |
| Public method Static member | Create(Frame, Curve, Double, Double) | Creates a Surface object coincident with the surface of revolution defined by a coordinate frame, a profile curve, and start and end angles of revolution. |
| Public method Static member | Create(XYZ, XYZ, Curve, Double, Double) | Creates a Surface object coincident with the surface of revolution defined by an axis, a profile curve, and start and end angles of revolution. |

# See Also

RevolvedSurface Class

RevolvedSurface Members

Autodesk.Revit.DB Namespace

#### SetConfiguration Method

---

|  |
| --- |
| FabricationConfiguration Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | SetConfiguration(FabricationConfigurationInfo) | Set the fabrication configuration with global profile. |
| Public method | SetConfiguration(FabricationConfigurationInfo, String) | Set the fabrication configuration with specific profile. |

# See Also

FabricationConfiguration Class

FabricationConfiguration Members

Autodesk.Revit.DB Namespace

#### CreateNURBSSurface Method

---

|  |
| --- |
| BRepBuilderSurfaceGeometry Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | CreateNURBSSurface(Int32, Int32, IList Double , IList Double , IList XYZ , Boolean, BoundingBoxUV) | Construct a BRepBuilderSurfaceGeometry based on NURBS surface data, where the weights are not supplied. In this case, the NURBS surface will be a piecewise polynomial surface. |
| Public method Static member | CreateNURBSSurface(Int32, Int32, IList Double , IList Double , IList XYZ , IList Double , Boolean, BoundingBoxUV) | Construct BRepBuilderSurfaceGeometry based on NURBS surface data, where the weights are supplied. In this case, the NURBS surface will be a piecewise rational polynomial surface. |

# See Also

BRepBuilderSurfaceGeometry Class

BRepBuilderSurfaceGeometry Members

Autodesk.Revit.DB Namespace

#### Parameter Property

---

|  |
| --- |
| Element Class   See Also |

Retrieves a parameter from the element given an identifier.

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public property | Parameter Guid | Retrieves a parameter from the element given a GUID for a shared parameter. |
| Public property | Parameter BuiltInParameter | Retrieves a parameter from the element given a parameter id. |
| Public property | Parameter Definition | Retrieves a parameter from the element based on its definition. |

# See Also

Element Class

Element Members

Autodesk.Revit.DB Namespace

#### SetRuleEnabled Method

---

|  |
| --- |
| PerformanceAdviser Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | SetRuleEnabled(Int32, Boolean) | Retrieves an enabled/disabled status for the given rule. |
| Public method | SetRuleEnabled(PerformanceAdviserRuleId, Boolean) | Retrieves an enabled/disabled status for the given rule. |

# See Also

PerformanceAdviser Class

PerformanceAdviser Members

Autodesk.Revit.DB Namespace

#### CanHaveTypeAssigned Method

---

|  |
| --- |
| Element Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | CanHaveTypeAssigned | Identifies if the element can have a type assigned. |
| Public method Static member | CanHaveTypeAssigned(Document, ICollection ElementId ) | Checks if all elements in the set can have a type assigned. |

# See Also

Element Class

Element Members

Autodesk.Revit.DB Namespace

#### GetActiveServerIds Method

---

|  |
| --- |
| MultiServerService Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | GetActiveServerIds | Returns Ids of the currently active application-level servers registered for the service. |
| Public method | GetActiveServerIds(Document) | Returns Ids of the servers currently applicable to the given document for the service. |

# See Also

MultiServerService Class

MultiServerService Members

Autodesk.Revit.DB.ExternalService Namespace

#### NewLinearDimension Method

---

|  |
| --- |
| FamilyItemFactory Class   See Also |

Creates a new linear dimension object.

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | NewLinearDimension(View, Line, ReferenceArray) | Generate a new linear dimension object using the default dimension type. |
| Public method | NewLinearDimension(View, Line, ReferenceArray, DimensionType) | Creates a new linear dimension object using the specified dimension type. |

# See Also

FamilyItemFactory Class

FamilyItemFactory Members

Autodesk.Revit.Creation Namespace

#### FilteredElementCollector Constructor

---

|  |
| --- |
| FilteredElementCollector Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | FilteredElementCollector(Document) | Constructs a new FilteredElementCollector that will search and filter the set of elements in a document. |
| Public method | FilteredElementCollector(Document, ElementId) | Constructs a new FilteredElementCollector that will search and filter the visible elements in a view. |
| Public method | FilteredElementCollector(Document, ICollection ElementId ) | Constructs a new FilteredElementCollector that will search and filter a specified set of elements. |

# See Also

FilteredElementCollector Class

FilteredElementCollector Members

Autodesk.Revit.DB Namespace

#### IsValidSymbol Method

---

|  |
| --- |
| FormatOptions Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | IsValidSymbol(ForgeTypeId) | Checks whether a symbol is valid for the unit in this FormatOptions. |
| Public method Static member | IsValidSymbol(ForgeTypeId, ForgeTypeId) | Checks whether a symbol is valid for a given unit. |

# See Also

FormatOptions Class

FormatOptions Members

Autodesk.Revit.DB Namespace

#### Create Method

---

|  |
| --- |
| RadialArray Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create(Document, View, ElementId, Int32, Line, Double, ArrayAnchorMember) | Creates a new radial array element from a single element based on an input rotation axis. |
| Public method Static member | Create(Document, View, ICollection ElementId , Int32, Line, Double, ArrayAnchorMember) | Creates a new radial array element from a set of elements based on an input rotation axis. |

# See Also

RadialArray Class

RadialArray Members

Autodesk.Revit.DB Namespace

#### Set Method

---

|  |
| --- |
| FamilyManager Class   See Also |

Set the value of a family parameter of the current family type.

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | Set(FamilyParameter, ElementId) | Set the ElementId value of a family parameter of the current family type. |
| Public method | Set(FamilyParameter, Double) | Set the double value of a family parameter of the current family type. |
| Public method | Set(FamilyParameter, Int32) | Set the integer value of a family parameter of the current family type. |
| Public method | Set(FamilyParameter, String) | Set the string value of a family parameter of the current family type. |

# See Also

FamilyManager Class

FamilyManager Members

Autodesk.Revit.DB Namespace

#### Create Method

---

|  |
| --- |
| BRepBuilderEdgeGeometry Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create(Curve) | Construct BRepBuilderEdgeGeometry based on any GCurve, including GLine and GArc. The curve will be simplified if possible, and the concrete type of the returned value will reflect that simplification: BRepBuilderLinearEdgeGeometry if the curve could be simplified to a line, BRepBuilderArcEdgeGeometry if it could be simplified to an arc, BRepBuilderGenericCurveEdgeGeometry otherwise. |
| Public method Static member | Create(XYZ, XYZ) | Constructs a BRepBuilderEdgeGeometry representing a straight line between the two given points. |

# See Also

BRepBuilderEdgeGeometry Class

BRepBuilderEdgeGeometry Members

Autodesk.Revit.DB Namespace

#### CanHaveSymbol Method

---

|  |
| --- |
| FormatOptions Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | CanHaveSymbol | Checks whether a symbol can be specified to display the unit in this FormatOptions. |
| Public method Static member | CanHaveSymbol(ForgeTypeId) | Checks whether a symbol can be specified to display a given unit. |

# See Also

FormatOptions Class

FormatOptions Members

Autodesk.Revit.DB Namespace

#### GetMinimumAllowedWidth Method

---

|  |
| --- |
| TextElement Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | GetMinimumAllowedWidth | Returns the minimum width the text element can be assigned. |
| Public method Static member | GetMinimumAllowedWidth(Document, ElementId) | Returns the minimum width a text element can be created with. |

# See Also

TextElement Class

TextElement Members

Autodesk.Revit.DB Namespace

#### IsValidHost Method

---

|  |
| --- |
| FabricSheet Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | IsValidHost(Element) | Checks whether an element is a valid host for fabric sheet. |
| Public method Static member | IsValidHost(Document, ElementId) | Checks whether an element is a valid host for fabric sheet. |

# See Also

FabricSheet Class

FabricSheet Members

Autodesk.Revit.DB.Structure Namespace

#### CreateFreeForm Method

---

|  |
| --- |
| Rebar Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | CreateFreeForm(Document, Guid, RebarBarType, Element) | Creates a free form rebar that can have constraints. |
| Public method Static member | CreateFreeForm(Document, RebarBarType, Element, IList CurveLoop , RebarFreeFormValidationResult ) | Creates a free form rebar that will be unconstrained. Constraints can't be added later to this rebar. |
| Public method Static member | CreateFreeForm(Document, RebarBarType, Element, IList IList Curve , RebarFreeFormValidationResult ) | Creates a free form rebar that will be unconstrained. Constraints can't be added later to this rebar. |

# See Also

Rebar Class

Rebar Members

Autodesk.Revit.DB.Structure Namespace

#### CreateHanger Method

---

|  |
| --- |
| FabricationPart Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | CreateHanger(Document, FabricationServiceButton, Int32, ElementId) | Creates a free placed hanger. |
| Public method Static member | CreateHanger(Document, FabricationServiceButton, ElementId, Connector, Double, Boolean) | Creates a hanger on the fabrication part. |
| Public method Static member | CreateHanger(Document, FabricationServiceButton, Int32, ElementId, Connector, Double, Boolean) | Creates a hanger on the fabrication part. |

# See Also

FabricationPart Class

FabricationPart Members

Autodesk.Revit.DB Namespace

#### IsValidHost Method

---

|  |
| --- |
| RebarHostData Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | IsValidHost | Reports whether the element is a valid rebar host. |
| Public method Static member | IsValidHost(Element) | Identifies whether a given element can host reinforcement. |

# See Also

RebarHostData Class

RebarHostData Members

Autodesk.Revit.DB.Structure Namespace

#### Create Method

---

|  |
| --- |
| RevitLinkInstance Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create(Document, ElementId) | Creates a new instance of a linked Revit project (RevitLinkType). |
| Public method Static member | Create(Document, ElementId, ImportPlacement) | Creates a new instance of a linked Revit project (RevitLinkType). |

# See Also

RevitLinkInstance Class

RevitLinkInstance Members

Autodesk.Revit.DB Namespace

#### NewUV Method

---

|  |
| --- |
| Application Class   See Also |

Creates a UV object representing coordinates in 2-space.

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | NewUV | Creates a UV object at the origin. |
| Public method | NewUV(UV) | Creates a UV object by copying the supplied UV object. |
| Public method | NewUV(Double, Double) | Creates a UV object representing coordinates in 2-space with supplied values. |

# See Also

Application Class

Application Members

Autodesk.Revit.Creation Namespace

#### GetDisplacedElementIds Method

---

|  |
| --- |
| DisplacementElement Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | GetDisplacedElementIds | The ids of the elements affected by this DisplacementElement. |
| Public method Static member | GetDisplacedElementIds(View) | Returns the element ids of all displaced elements in the specified view. |

# See Also

DisplacementElement Class

DisplacementElement Members

Autodesk.Revit.DB Namespace

#### GetRoomAtPoint Method

---

|  |
| --- |
| Document Class   See Also |

Gets a room containing the point.

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | GetRoomAtPoint(XYZ) | Gets a room containing the point. |
| Public method | GetRoomAtPoint(XYZ, Phase) | Gets a room containing the point. |

# See Also

Document Class

Document Members

Autodesk.Revit.DB Namespace

#### SetAllCapsStatus Method

---

|  |
| --- |
| FormattedText Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | SetAllCapsStatus(Boolean) | Sets the characters in the entire text to be in all caps or not. |
| Public method | SetAllCapsStatus(TextRange, Boolean) | Sets the characters in a given text range to be in all caps or not. |

# See Also

FormattedText Class

FormattedText Members

Autodesk.Revit.DB Namespace

#### Create Method

---

|  |
| --- |
| AreaLoad Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create(Document, ElementId, XYZ, AreaLoadType) | Creates a new hosted area load within the project. |
| Public method Static member | Create(Document, IList CurveLoop , XYZ, AreaLoadType) | Creates a new non-hosted area load within the project. |
| Public method Static member | Create(Document, IList CurveLoop , IList XYZ , IList Int32 , IList Int32 , AreaLoadType) | Creates a new non-hosted area load within the project. |

# See Also

AreaLoad Class

AreaLoad Members

Autodesk.Revit.DB.Structure Namespace

#### GetTargetHostFaceReference Method

---

|  |
| --- |
| RebarConstraint Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | GetTargetHostFaceReference | Returns a reference to the host Element face to which the RebarConstraint is attached. The RebarConstraintType of the RebarConstraint must be 'FixedDistanceToHostFace' or 'ToCover.' Will throw exception if it's a multi target constraint. |
| Public method | GetTargetHostFaceReference(Int32) | Returns a reference that corresponds to the face to which the RebarConstraint is attached specified by the targetIndex. The RebarConstraintType of the RebarConstraint must be 'FixedDistanceToHostFace' or 'ToCover.' |

# See Also

RebarConstraint Class

RebarConstraint Members

Autodesk.Revit.DB.Structure Namespace

#### AddReferencePlane Method

---

|  |
| --- |
| DirectShapeType Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | AddReferencePlane(Plane) | Adds a reference plane to the DirectShapeType. The reference plane can either be bounded or unbounded. |
| Public method | AddReferencePlane(Plane, BoundingBoxUV) | Adds a reference plane to the DirectShapeType. The reference plane can either be bounded or unbounded. |
| Public method | AddReferencePlane(Plane, DirectShapeReferenceOptions) | Adds a reference plane to the DirectShapeType. The reference plane can either be bounded or unbounded. |
| Public method | AddReferencePlane(Plane, BoundingBoxUV, DirectShapeReferenceOptions) | Adds a reference plane to the DirectShapeType. The reference plane can either be bounded or unbounded. |

# See Also

DirectShapeType Class

DirectShapeType Members

Autodesk.Revit.DB Namespace

#### TextNoteOptions Constructor

---

|  |
| --- |
| TextNoteOptions Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | TextNoteOptions | Default constructor; populates the options with their respective default values. |
| Public method | TextNoteOptions(ElementId) | Constructs text options to create text of the given type. |

# See Also

TextNoteOptions Class

TextNoteOptions Members

Autodesk.Revit.DB Namespace

#### CanUsePlusPrefix Method

---

|  |
| --- |
| FormatOptions Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | CanUsePlusPrefix | Checks whether a plus prefix can be displayed for the display unit in this FormatOptions. |
| Public method Static member | CanUsePlusPrefix(ForgeTypeId) | Checks whether a plus prefix can be displayed for a given unit. |

# See Also

FormatOptions Class

FormatOptions Members

Autodesk.Revit.DB Namespace

#### Equals Method

---

|  |
| --- |
| ThermalAsset Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | Equals(ThermalAsset) | Determines whether this thermal asset is equal to another. |

# See Also

ThermalAsset Class

ThermalAsset Members

Autodesk.Revit.DB Namespace

#### PromptForFamilyInstancePlacement Method

---

|  |
| --- |
| UIDocument Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | PromptForFamilyInstancePlacement(FamilySymbol) | Prompts the user to place instances of the specified FamilySymbol. |
| Public method | PromptForFamilyInstancePlacement(FamilySymbol, PromptForFamilyInstancePlacementOptions) | Prompts the user to place instances of the specified FamilySymbol. |

# See Also

UIDocument Class

UIDocument Members

Autodesk.Revit.UI Namespace

#### IsInside Method

---

|  |
| --- |
| Curve Class   See Also |

Indicates whether the specified parameter value is within this curve's bounds.

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | IsInside(Double) | Indicates whether the specified parameter value is within this curve's bounds. |
| Public method | IsInside(Double, Int32 ) | Indicates whether the specified parameter value is within this curve's bounds and outputs the end index. |

# See Also

Curve Class

Curve Members

Autodesk.Revit.DB Namespace

#### GetWidth Method

---

|  |
| --- |
| CompoundStructure Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | GetWidth | The width implied by this compound structure. |
| Public method | GetWidth(Int32) | Computes the width of the envelope (2d bounding box) of the specified region. |

# See Also

CompoundStructure Class

CompoundStructure Members

Autodesk.Revit.DB Namespace

#### UV Constructor

---

|  |
| --- |
| UV Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | UV | Creates a default UV with the values (0, 0). |
| Public method | UV(Double, Double) | Creates a UV with the supplied coordinates. |

# See Also

UV Class

UV Members

Autodesk.Revit.DB Namespace

#### Triangulate Method

---

|  |
| --- |
| Face Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | Triangulate | Returns a triangular mesh approximation to the face. |
| Public method | Triangulate(Double) | Returns a triangular mesh approximation to the face. |

# See Also

Face Class

Face Members

Autodesk.Revit.DB Namespace

#### CreateNotContainsRule Method

---

|  |
| --- |
| ParameterFilterRuleFactory Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | CreateNotContainsRule(ElementId, String) | Creates a filter rule that determines whether strings from the document do not contain a certain string value. |
| Public method Static member | CreateNotContainsRule(ElementId, String, Boolean) | **Obsolete.**   Creates a filter rule that determines whether strings from the document do not contain a certain string value. |

# See Also

ParameterFilterRuleFactory Class

ParameterFilterRuleFactory Members

Autodesk.Revit.DB Namespace

#### Create Method

---

|  |
| --- |
| ElectricalSystem Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create(Connector, ElectricalSystemType) | Creates a new MEP Electrical System element from an unused Connector. |
| Public method Static member | Create(Document, IList ElementId , ElectricalSystemType) | Creates a new MEP Electrical System element from a set of electrical components. |

# See Also

ElectricalSystem Class

ElectricalSystem Members

Autodesk.Revit.DB.Electrical Namespace

#### GetWorkset Method

---

|  |
| --- |
| WorksetTable Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | GetWorkset(Guid) | Returns the workset from a input Guid. |
| Public method | GetWorkset(WorksetId) | Returns the workset from a input WorksetId. |

# See Also

WorksetTable Class

WorksetTable Members

Autodesk.Revit.DB Namespace

#### PickElementsByRectangle Method

---

|  |
| --- |
| Selection Class   See Also |

Prompts the user to select multiple elements by drawing a rectangle.

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | PickElementsByRectangle | Prompts the user to select multiple elements by drawing a rectangle. |
| Public method | PickElementsByRectangle(String) | Prompts the user to select multiple elements by drawing a rectangle while showing a custom status prompt string. |
| Public method | PickElementsByRectangle(ISelectionFilter) | Prompts the user to select multiple elements by drawing a rectangle which pass a customer filter. |
| Public method | PickElementsByRectangle(ISelectionFilter, String) | Prompts the user to select multiple elements by drawing a rectangle which pass a customer filter while showing a custom status prompt string. |

# See Also

Selection Class

Selection Members

Autodesk.Revit.UI.Selection Namespace

#### ValidateCurve Method

---

|  |
| --- |
| ViewShapeBuilder Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | ValidateCurve(Curve) | Validates curve to be added to the view-specific shape being constructed. Called by AddCurve() to validate input. Expects a valid view normal to be set prior to the call. |
| Public method Static member | ValidateCurve(Curve, DirectShapeTargetViewType) | Validates curve to be added to the view-specific shape being constructed. Called by AddCurve() to validate input. This function may be used to pre-validate the geometry being added to avoid AddCurve() throwing an InvalidArgumentException |

# See Also

ViewShapeBuilder Class

ViewShapeBuilder Members

Autodesk.Revit.DB Namespace

#### IsValidProfileCurve Method

---

|  |
| --- |
| RevolvedSurface Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | IsValidProfileCurve(Frame, Curve) | Checks if the input profile curve is valid to create a surface of revolution in the given frame of reference. |
| Public method Static member | IsValidProfileCurve(XYZ, XYZ, Curve) | Checks if the input profile curve is valid to create a surface of revolution around the given axis. |

# See Also

RevolvedSurface Class

RevolvedSurface Members

Autodesk.Revit.DB Namespace

#### IsValidShape Method

---

|  |
| --- |
| DirectShapeType Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | IsValidShape(IList GeometryObject ) | Validates shape to be stored in a DirectShapeType. |
| Public method | IsValidShape(IList GeometryObject , DirectShapeTargetViewType) | Validates view-specific shape to be stored in a DirectShapeType. Expects a non-default view type. |

# See Also

DirectShapeType Class

DirectShapeType Members

Autodesk.Revit.DB Namespace

#### ConnectionInputPointInfo Constructor

---

|  |
| --- |
| ConnectionInputPointInfo Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | ConnectionInputPointInfo | Construct a default input point. |
| Public method | ConnectionInputPointInfo(String, Int32, String) | Construct an input point info. |

# See Also

ConnectionInputPointInfo Class

ConnectionInputPointInfo Members

Autodesk.Revit.DB.Structure Namespace

#### OpenIFCDocument Method

---

|  |
| --- |
| Application Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | OpenIFCDocument(String) | Opens an IFC document from disk using default options. |
| Public method | OpenIFCDocument(String, IFCImportOptions) | Opens an IFC document from disk using custom options. |

# See Also

Application Class

Application Members

Autodesk.Revit.ApplicationServices Namespace

#### Create Method

---

|  |
| --- |
| ExportDWGSettings Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create(Document, String) | Create a DWG export settings with default values. |
| Public method Static member | Create(Document, String, DWGExportOptions) | Create a DWG export settings with default values. |
| Public method Static member | Create(Document, String, DXFExportOptions) | Create a DWG export settings with default values. |

# See Also

ExportDWGSettings Class

ExportDWGSettings Members

Autodesk.Revit.DB Namespace

#### Remove Method

---

|  |
| --- |
| MEPSystem Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | Remove(ConnectorSet) | Removes connectors from system. |
| Public method | Remove(ICollection ElementId ) | Remove elements from system. |

# See Also

MEPSystem Class

MEPSystem Members

Autodesk.Revit.DB Namespace

#### GetValidSymbols Method

---

|  |
| --- |
| FormatOptions Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | GetValidSymbols | Gets the identifiers of all valid symbols for the unit in this FormatOptions. |
| Public method Static member | GetValidSymbols(ForgeTypeId) | Gets the identifiers of all valid symbols for a given unit. |

# See Also

FormatOptions Class

FormatOptions Members

Autodesk.Revit.DB Namespace

#### Entity Constructor

---

|  |
| --- |
| Entity Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | Entity | The default-constructed Entity is invalid. |
| Public method | Entity(Guid) | Creates a new Entity corresponding to the Schema of the specified GUID. |
| Public method | Entity(Entity) | Constructs a new copy of the input ESEntity object. |
| Public method | Entity(Schema) | Creates a new Entity corresponding to the Schema. |

# See Also

Entity Class

Entity Members

Autodesk.Revit.DB.ExtensibleStorage Namespace

#### SATImportOptions Constructor

---

|  |
| --- |
| SATImportOptions Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | SATImportOptions | Constructs a new instance of SATImportOptions with default values of all properties. |
| Public method | SATImportOptions(SATImportOptions) | Constructs a new instance of SATImportOptions as a copy of the import options. |

# See Also

SATImportOptions Class

SATImportOptions Members

Autodesk.Revit.DB Namespace

#### Equals Method

---

|  |
| --- |
| StructuralAsset Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | Equals(StructuralAsset) | Determines whether this structural asset is equal to another. |

# See Also

StructuralAsset Class

StructuralAsset Members

Autodesk.Revit.DB Namespace

#### Commit Method

---

|  |
| --- |
| Transaction Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | Commit | Commits all changes made to the model during the transaction. |
| Public method | Commit(FailureHandlingOptions) | Commits all changes made to the model during the transaction. |

# See Also

Transaction Class

Transaction Members

Autodesk.Revit.DB Namespace

#### GetCenterlineCurves Method

---

|  |
| --- |
| RebarContainerItem Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | GetCenterlineCurves(Boolean, Boolean, Boolean) | A chain of curves representing the centerline of the rebar. |
| Public method | GetCenterlineCurves(Boolean, Boolean, Boolean, MultiplanarOption) | A chain of curves representing the centerline of the rebar. |

# See Also

RebarContainerItem Class

RebarContainerItem Members

Autodesk.Revit.DB.Structure Namespace

#### Create Method

---

|  |
| --- |
| Duct Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create(Document, ElementId, ElementId, Connector, Connector) | Creates a new duct that connects to two connectors. |
| Public method Static member | Create(Document, ElementId, ElementId, Connector, XYZ) | Creates a new duct that connects to the connector. |
| Public method Static member | Create(Document, ElementId, ElementId, ElementId, XYZ, XYZ) | Creates a new duct from two points. |

# See Also

Duct Class

Duct Members

Autodesk.Revit.DB.Mechanical Namespace

#### ElementIntersectsElementFilter Constructor

---

|  |
| --- |
| ElementIntersectsElementFilter Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | ElementIntersectsElementFilter(Element) | Constructs a filter to match elements which intersect the given element. |
| Public method | ElementIntersectsElementFilter(Element, Boolean) | Constructs a filter to match elements which intersect the given element, with the option to match all elements not intersecting the given element. |

# See Also

ElementIntersectsElementFilter Class

ElementIntersectsElementFilter Members

Autodesk.Revit.DB Namespace

#### IsElementsDeletionPermitted Method

---

|  |
| --- |
| FailuresAccessor Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | IsElementsDeletionPermitted | Checks if resolution of the failures by deleting failure elements is permitted. |
| Public method | IsElementsDeletionPermitted(IList ElementId ) | Checks if resolution of the failures by deleting given collection of elements is permitted. |
| Public method | IsElementsDeletionPermitted(IList ElementId , String ) | Checks if resolution of the failures by deleting given collection of elements is permitted. |

# See Also

FailuresAccessor Class

FailuresAccessor Members

Autodesk.Revit.DB Namespace

#### CreateNotEndsWithRule Method

---

|  |
| --- |
| ParameterFilterRuleFactory Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | CreateNotEndsWithRule(ElementId, String) | Creates a filter rule that determines whether strings from the document do not end with a certain string value. |
| Public method Static member | CreateNotEndsWithRule(ElementId, String, Boolean) | **Obsolete.**   Creates a filter rule that determines whether strings from the document do not end with a certain string value. |

# See Also

ParameterFilterRuleFactory Class

ParameterFilterRuleFactory Members

Autodesk.Revit.DB Namespace

#### Create Method

---

|  |
| --- |
| EndTreatmentType Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create(Document) | Creates a new EndTreatmentType in a document. |
| Public method Static member | Create(Document, String) | Creates a new EndTreatmentType in a document and adds the input string to the endTreatment parameter. |

# See Also

EndTreatmentType Class

EndTreatmentType Members

Autodesk.Revit.DB.Structure Namespace

#### GetKeyBasedTreeEntryErrors Method

---

|  |
| --- |
| KeyBasedTreeEntriesLoadResults Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | GetKeyBasedTreeEntryErrors | Gets information about KeyBasedTreeEntry objects that could not be included in the KeyBasedTreeEntries object due to errors. |
| Public method | GetKeyBasedTreeEntryErrors(KeyBasedTreeEntryErrorType) | Gets information about specific KeyBasedTreeEntry objects that could not be included in the KeyBasedTreeEntries object due to errors of a particular type. |

# See Also

KeyBasedTreeEntriesLoadResults Class

KeyBasedTreeEntriesLoadResults Members

Autodesk.Revit.DB Namespace

#### Create Method

---

|  |
| --- |
| LineLoad Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create(Document, ElementId, XYZ, XYZ, LineLoadType) | Creates a new hosted line load within the project. |
| Public method Static member | Create(Document, ElementId, Int32, XYZ, XYZ, LineLoadType) | Creates a new hosted line load within the project. |
| Public method Static member | Create(Document, XYZ, XYZ, XYZ, XYZ, LineLoadType, SketchPlane) | Creates a new non-hosted line load within the project using data at point. |

# See Also

LineLoad Class

LineLoad Members

Autodesk.Revit.DB.Structure Namespace

#### ValueAtPoint Constructor

---

|  |
| --- |
| ValueAtPoint Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | ValueAtPoint(IList Double ) | Creates object from an array of values |
| Public method | ValueAtPoint(ValueAtPoint) | Creates a copy of the given ValueAtPoint instance. |

# See Also

ValueAtPoint Class

ValueAtPoint Members

Autodesk.Revit.DB.Analysis Namespace

#### GetCheckoutStatus Method

---

|  |
| --- |
| WorksharingUtils Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | GetCheckoutStatus(Document, ElementId) | Gets the ownership status of an element. |
| Public method Static member | GetCheckoutStatus(Document, ElementId, String ) | Gets the ownership status and outputs the owner of an element. |

# See Also

WorksharingUtils Class

WorksharingUtils Members

Autodesk.Revit.DB Namespace

#### GetRebarConstraintTargetHostFaceType Method

---

|  |
| --- |
| RebarConstraint Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | GetRebarConstraintTargetHostFaceType | Returns the RebarConstraintTargetHostFaceType of the host Element face to which the RebarConstraint is attached. The RebarConstraintType of the RebarConstraint must be 'FixedDistanceToHostFace' or 'ToCover.' Will throw exception if it's a multi target constraint. |
| Public method | GetRebarConstraintTargetHostFaceType(Int32) | Returns the RebarConstraintTargetHostFaceType of the host Element face to which the RebarConstraint is attached. The RebarConstraintType of the RebarConstraint must be 'FixedDistanceToHostFace' or 'ToCover.' |

# See Also

RebarConstraint Class

RebarConstraint Members

Autodesk.Revit.DB.Structure Namespace

#### Create Method

---

|  |
| --- |
| HermiteSurface Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create(Int32, Int32, IList XYZ ) | Create a non-periodic Hermite surface using a net of 3D points as input. |
| Public method Static member | Create(Int32, Int32, IList XYZ , Boolean, Boolean) | Create a Hermite surface using a net of 3D points as input. Specify periodicity in U and V direction. |

# See Also

HermiteSurface Class

HermiteSurface Members

Autodesk.Revit.DB Namespace

#### CreateExtrusionGeometry Method

---

|  |
| --- |
| GeometryCreationUtilities Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | CreateExtrusionGeometry(IList CurveLoop , XYZ, Double) | Creates a solid by linearly extruding one or more closed coplanar curve loops. |
| Public method Static member | CreateExtrusionGeometry(IList CurveLoop , XYZ, Double, SolidOptions) | Creates a solid by linearly extruding one or more closed coplanar curve loops. |

# See Also

GeometryCreationUtilities Class

GeometryCreationUtilities Members

Autodesk.Revit.DB Namespace

#### GetElementFilterFromRule Method

---

|  |
| --- |
| PerformanceAdviser Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | GetElementFilterFromRule(Int32, Document) | Retrieves a filter to restrict elements to be checked. |
| Public method | GetElementFilterFromRule(PerformanceAdviserRuleId, Document) | Retrieves a filter to restrict elements to be checked. |

# See Also

PerformanceAdviser Class

PerformanceAdviser Members

Autodesk.Revit.DB Namespace

#### CreateNotEqualsRule Method

---

|  |
| --- |
| ParameterFilterRuleFactory Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | CreateNotEqualsRule(ElementId, ElementId) | Creates a filter rule that determines whether ElementId values from the document do not equal a certain value. |
| Public method Static member | CreateNotEqualsRule(ElementId, Int32) | Creates a filter rule that determines whether integer values from the document do not equal a certain value. |
| Public method Static member | CreateNotEqualsRule(ElementId, String) | Creates a filter rule that determines whether strings from the document do not equal a certain value. |
| Public method Static member | CreateNotEqualsRule(ElementId, Double, Double) | Creates a filter rule that determines whether double-precision values from the document do not equal a certain value. |
| Public method Static member | CreateNotEqualsRule(ElementId, String, Boolean) | **Obsolete.**   Creates a filter rule that determines whether strings from the document do not equal a certain value. |

# See Also

ParameterFilterRuleFactory Class

ParameterFilterRuleFactory Members

Autodesk.Revit.DB Namespace

#### ImportOptions3DM Constructor

---

|  |
| --- |
| ImportOptions3DM Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | ImportOptions3DM | Constructs a new instance of ImportOptions3DM with default values of all properties. |
| Public method | ImportOptions3DM(ImportOptions3DM) | Constructs a new instance of ImportOptions3DM as a copy of the provided import options. |

# See Also

ImportOptions3DM Class

ImportOptions3DM Members

Autodesk.Revit.DB Namespace

#### IsAcceptableParamIdAndCategoryId Method

---

|  |
| --- |
| TableSectionData Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | IsAcceptableParamIdAndCategoryId(ElementId, ElementId) | Identifies if the given parameter id and category id can be assigned to a cell in this table. |
| Public method | IsAcceptableParamIdAndCategoryId(Int32, ElementId, ElementId) | Identifies if the given parameter id and category id can be assigned to a cell in the given row in this table. |

# See Also

TableSectionData Class

TableSectionData Members

Autodesk.Revit.DB Namespace

#### GetNearestLevelId Method

---

|  |
| --- |
| Level Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | GetNearestLevelId(Document, Double) | Returns id of the Level which is closest to the specified elevation. |
| Public method Static member | GetNearestLevelId(Document, Double, Double ) | Returns id of the Level which is closest to the specified elevation. |

# See Also

Level Class

Level Members

Autodesk.Revit.DB Namespace

#### ProjectPosition Constructor

---

|  |
| --- |
| ProjectPosition Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | ProjectPosition(ProjectPosition) | Creates a copy of the ProjectPosition. |
| Public method | ProjectPosition(Double, Double, Double, Double) | Construct a new ProjectPosition with the specified East/West offset, North/South offset, elevation offset, and angle of rotation. |

# See Also

ProjectPosition Class

ProjectPosition Members

Autodesk.Revit.DB Namespace

#### ChangeHostReference Method

---

|  |
| --- |
| ConnectorElement Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | ChangeHostReference(Reference) | Changes the connector host reference to a new planar face. |
| Public method | ChangeHostReference(Reference, Edge) | Changes the connector host reference to a new planar face and a new edge loop. |

# See Also

ConnectorElement Class

ConnectorElement Members

Autodesk.Revit.DB Namespace

#### CircleLightShape Constructor

---

|  |
| --- |
| CircleLightShape Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | CircleLightShape | Creates a circle light shape object with 2.0' emit diameter. |
| Public method | CircleLightShape(Double) | Creates a circle light shape object with the given emit diameter. |
| Public method | CircleLightShape(CircleLightShape) | Creates a copy of the given circle light shape |

# See Also

CircleLightShape Class

CircleLightShape Members

Autodesk.Revit.DB.Lighting Namespace

#### GetRibbonPanels Method

---

|  |
| --- |
| UIControlledApplication Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | GetRibbonPanels | Get all the custom Panels on Add-Ins tab of Revit. |
| Public method | GetRibbonPanels(String) | Get all the custom Panels on a designated Revit tab. |
| Public method | GetRibbonPanels(Tab) | Get all the custom Panels on a designated standard Revit tab. |

# See Also

UIControlledApplication Class

UIControlledApplication Members

Autodesk.Revit.UI Namespace

#### SaveAs Method

---

|  |
| --- |
| Document Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | SaveAs(String) | Saves the document to a given file path. |
| Public method | SaveAs(String, SaveAsOptions) | Saves the document to a given file path. |
| Public method | SaveAs(ModelPath, SaveAsOptions) | Saves the document to a given path. |

# See Also

Document Class

Document Members

Autodesk.Revit.DB Namespace

#### CreatePipeConnector Method

---

|  |
| --- |
| ConnectorElement Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | CreatePipeConnector(Document, PipeSystemType, Reference) | Create a new pipe ConnectorElement. |
| Public method Static member | CreatePipeConnector(Document, PipeSystemType, Reference, Edge) | Create a new pipe ConnectorElement with a face and an edge. |

# See Also

ConnectorElement Class

ConnectorElement Members

Autodesk.Revit.DB Namespace

#### PresetInitialColor Constructor

---

|  |
| --- |
| PresetInitialColor Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | PresetInitialColor(ColorPreset) | Creates an initial color preset object with the given preset value. |
| Public method | PresetInitialColor(PresetInitialColor) | Creates a copy of the given preset initial color |

# See Also

PresetInitialColor Class

PresetInitialColor Members

Autodesk.Revit.DB.Lighting Namespace

#### SetPointCloudRegionOverrideSettings Method

---

|  |
| --- |
| PointCloudOverrides Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | SetPointCloudRegionOverrideSettings(ElementId, PointCloudOverrideSettings) | Assigns region override settings to the whole PointCloudInstance element. |
| Public method | SetPointCloudRegionOverrideSettings(ElementId, PointCloudOverrideSettings, String, Document) | Assigns override settings to a particular region within a PointCloudInstance element. |

# See Also

PointCloudOverrides Class

PointCloudOverrides Members

Autodesk.Revit.DB.PointClouds Namespace

#### StructuralSectionAnalysisParams Constructor

---

|  |
| --- |
| StructuralSectionAnalysisParams Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | StructuralSectionAnalysisParams | Creates a new instance of StructuralSectionAnalysisParams. |
| Public method | StructuralSectionAnalysisParams(Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double) | Creates a new instance of StructuralSectionAnalysisParams. |

# See Also

StructuralSectionAnalysisParams Class

StructuralSectionAnalysisParams Members

Autodesk.Revit.DB.Structure.StructuralSections Namespace

#### SphericalLightDistribution Constructor

---

|  |
| --- |
| SphericalLightDistribution Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | SphericalLightDistribution | Creates a spherical light distribution object. |
| Public method | SphericalLightDistribution(SphericalLightDistribution) | Creates a copy of the given spherical light distribution |

# See Also

SphericalLightDistribution Class

SphericalLightDistribution Members

Autodesk.Revit.DB.Lighting Namespace

#### Item Property

---

|  |
| --- |
| Categories Class   See Also |

Retrieves a category object matching an identifier.

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public property | Item String | Gets a category which has the specified name from this list of top-level categories. (Overrides  CategoryNameMap Item String  .) |
| Public property | Item BuiltInCategory | Retrieves a category object corresponding to a BuiltInCategory id. |

# See Also

Categories Class

Categories Members

Autodesk.Revit.DB Namespace

#### Transform1D Constructor

---

|  |
| --- |
| Transform1D Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | Transform1D(Double) | Constructs the transformation by specifying the scale only. |
| Public method | Transform1D(Transform1D) | The copy constructor. |
| Public method | Transform1D(Double, Double) | Constructs the transformation by specifying the scale and the translation. |

# See Also

Transform1D Class

Transform1D Members

Autodesk.Revit.DB Namespace

#### Set Method

---

|  |
| --- |
| Entity Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | Set FieldType (String, FieldType) | Stores the value of the field in the entity. |
| Public method | Set FieldType (Field, FieldType) | Stores the value of the field in the entity. |
| Public method | Set FieldType (String, FieldType, ForgeTypeId) | Stores the value of the field in the entity. |
| Public method | Set FieldType (Field, FieldType, ForgeTypeId) | Stores the value of the field in the entity. |

# See Also

Entity Class

Entity Members

Autodesk.Revit.DB.ExtensibleStorage Namespace

#### ViewShapeBuilder Constructor

---

|  |
| --- |
| ViewShapeBuilder Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | ViewShapeBuilder | Default constructor for an ViewShapeBuilder object. |
| Public method | ViewShapeBuilder(DirectShapeTargetViewType) | A constructor for an ViewShapeBuilder object that takes a view type. It will infer the view normal from view type. View normal and view type are used to validate the geometry to be stored as a view-specific shape representation of a DirectShape object. |

# See Also

ViewShapeBuilder Class

ViewShapeBuilder Members

Autodesk.Revit.DB Namespace

#### CreateRibbonPanel Method

---

|  |
| --- |
| ApplicationEntryPoint Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | CreateRibbonPanel(String) | (Overrides  UIApplication CreateRibbonPanel(String)  .) |
| Public method | CreateRibbonPanel(String, String) | (Overrides  UIApplication CreateRibbonPanel(String, String)  .) |
| Public method | CreateRibbonPanel(Tab, String) | (Overrides  UIApplication CreateRibbonPanel(Tab, String)  .) |

# See Also

ApplicationEntryPoint Class

ApplicationEntryPoint Members

Autodesk.Revit.UI.Macros Namespace

#### AddSubFolder Method

---

|  |
| --- |
| ExternalResourceBrowserData Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | AddSubFolder(String) | Adds a subfolder to the folder path with the given name. |
| Public method | AddSubFolder(String, String) | Adds a subfolder to the folder path with the given name and icon type. |

# See Also

ExternalResourceBrowserData Class

ExternalResourceBrowserData Members

Autodesk.Revit.DB Namespace

#### CreateStyle Method

---

|  |
| --- |
| IFCFile Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | CreateStyle(ExporterIFC, IFCAnyHandle) | Creates and populates an IfcStyledItem for an IfcRepresentationItem with a IfcSurfaceStyle, IfcCurveStyle, and/or an IfcFillStyle, and assigns them to the file. |
| Public method | CreateStyle(ExporterIFC, IFCAnyHandle, Color, ElementId) | Creates and populates an IfcStyledItem for an IfcRepresentationItem with a IfcSurfaceStyle, IfcCurveStyle, and/or an IfcFillStyle, and assigns them to the file. |

# See Also

IFCFile Class

IFCFile Members

Autodesk.Revit.DB.IFC Namespace

#### RemoveColumnAttachment Method

---

|  |
| --- |
| ColumnAttachment Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | RemoveColumnAttachment(FamilyInstance, ElementId) | Removes any attachment of the column to the specified target. |
| Public method Static member | RemoveColumnAttachment(FamilyInstance, Int32) | Removes an attachment at the top or base of a column, if there is one. |

# See Also

ColumnAttachment Class

ColumnAttachment Members

Autodesk.Revit.DB Namespace

#### Create Method

---

|  |
| --- |
| LoadCombination Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create(Document, String) | Creates a new default LoadCombination. |
| Public method Static member | Create(Document, String, LoadCombinationType, LoadCombinationState) | Creates a new LoadCombination. |

# See Also

LoadCombination Class

LoadCombination Members

Autodesk.Revit.DB.Structure Namespace

#### IFCExportOptions Constructor

---

|  |
| --- |
| IFCExportOptions Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | IFCExportOptions | Default constructor. Initializes FileVersion to Default. WallAndColumnSplitting and ExportBaseQuantities are set to false. FamilyMappingFile is set to empty. |
| Public method | IFCExportOptions(IFCExportOptions) | Creates a copy of an IFCExportOptions. |

# See Also

IFCExportOptions Class

IFCExportOptions Members

Autodesk.Revit.DB Namespace

#### FilterDialog Constructor

---

|  |
| --- |
| FilterDialog Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | FilterDialog(Document, ElementId) | Constructs a new instance of the FilterDialog class, while setting the id of the FilterElement to be selected when the dialog is shown. |
| Public method | FilterDialog(Document, String) | Constructs a new instance of the FilterDialog class, while setting the name of the new ParameterFilterElement to be created and selected for editing. |

# See Also

FilterDialog Class

FilterDialog Members

Autodesk.Revit.UI Namespace

#### PickObject Method

---

|  |
| --- |
| Selection Class   See Also |

Prompts the user to select one object.

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | PickObject(ObjectType) | Prompts the user to select one object. |
| Public method | PickObject(ObjectType, ISelectionFilter) | Prompts the user to select one object which passes a custom filter. |
| Public method | PickObject(ObjectType, String) | Prompts the user to select one object while showing a custom status prompt string. |
| Public method | PickObject(ObjectType, ISelectionFilter, String) | Prompts the user to select one object which passes a custom filter while showing a custom status prompt string. |

# See Also

Selection Class

Selection Members

Autodesk.Revit.UI.Selection Namespace

#### AllRuleParametersApplicable Method

---

|  |
| --- |
| ParameterFilterElement Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | AllRuleParametersApplicable(ElementFilter) | Checks that the parameters of the rules used by the given ElementFilter are valid for this filter's categories. |
| Public method Static member | AllRuleParametersApplicable(Document, ICollection ElementId , ElementFilter) | Checks that the parameters of the given ElementFilter (representing a combination of rules) are valid for the given set of categories. |

# See Also

ParameterFilterElement Class

ParameterFilterElement Members

Autodesk.Revit.DB Namespace

#### GetTargetElement Method

---

|  |
| --- |
| RebarConstraint Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | GetTargetElement | Gets the Element object (either Host or Rebar) which provides the constraint. Will throw exception if it's a multi target constraint. |
| Public method | GetTargetElement(Int32) | Gets the Element object (either Host or Rebar) which provides the constraint. Will return the Element which contains the face at targetIndex. |

# See Also

RebarConstraint Class

RebarConstraint Members

Autodesk.Revit.DB.Structure Namespace

#### GetGraphicOverrides Method

---

|  |
| --- |
| WorksharingDisplaySettings Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | GetGraphicOverrides(String) | Returns the graphic overrides assigned for elements owned by a particular user. |
| Public method | GetGraphicOverrides(CheckoutStatus) | Returns the graphic overrides associated with a particular ownership status. |
| Public method | GetGraphicOverrides(ModelUpdatesStatus) | Returns the graphic overrides assigned to a particular model update status. |
| Public method | GetGraphicOverrides(WorksetId) | Returns the graphic overrides assigned to elements in a particular workset. |

# See Also

WorksharingDisplaySettings Class

WorksharingDisplaySettings Members

Autodesk.Revit.DB Namespace

#### Create Method

---

|  |
| --- |
| AreaReinforcement Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create(Document, Element, XYZ, ElementId, ElementId, ElementId) | Creates a new AreaReinforcement object based on a host boundary. |
| Public method Static member | Create(Document, Element, IList Curve , XYZ, ElementId, ElementId, ElementId) | Creates a new AreaReinforcement object from an array of curves. This method replaces the NewAreaReinforcement method, which has been deprecated. |

# See Also

AreaReinforcement Class

AreaReinforcement Members

Autodesk.Revit.DB.Structure Namespace

#### StructuralWallUsageFilter Constructor

---

|  |
| --- |
| StructuralWallUsageFilter Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | StructuralWallUsageFilter(StructuralWallUsage) | Constructs a new instance of a filter to match walls that have the given structural wall usage. |
| Public method | StructuralWallUsageFilter(StructuralWallUsage, Boolean) | Constructs a new instance of a filter to match walls that have the given structural wall usage, with the option to match all walls which are not of the given structural wall usage. |

# See Also

StructuralWallUsageFilter Class

StructuralWallUsageFilter Members

Autodesk.Revit.DB.Structure Namespace

#### NewFlexDuct Method

---

|  |
| --- |
| Document Class   See Also |

Adds a new flexible duct into the document.

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | NewFlexDuct(IList XYZ , FlexDuctType) | Adds a new flexible duct into the document, using a point array and duct type. |
| Public method | NewFlexDuct(Connector, Connector, FlexDuctType) | Adds a new flexible duct into the document, using two connector, and duct type. |
| Public method | NewFlexDuct(Connector, IList XYZ , FlexDuctType) | Adds a new flexible duct into the document, using a connector, point array and duct type. |

# See Also

Document Class

Document Members

Autodesk.Revit.Creation Namespace

#### SetPlainText Method

---

|  |
| --- |
| FormattedText Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | SetPlainText(String) | Sets the entire text with the given text in a plain text form. |
| Public method | SetPlainText(TextRange, String) | Sets the text with the given text in a plain text form in a range. |

# See Also

FormattedText Class

FormattedText Members

Autodesk.Revit.DB Namespace

#### Create Method

---

|  |
| --- |
| FluidType Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create(Document, String) | Creates a new empty fluid type and adds it to the document. |
| Public method Static member | Create(Document, String, FluidType) | Creates a new fluid type and adds it to the document. |

# See Also

FluidType Class

FluidType Members

Autodesk.Revit.DB.Plumbing Namespace

#### PointCloudOverrideSettings Constructor

---

|  |
| --- |
| PointCloudOverrideSettings Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | PointCloudOverrideSettings | Constructs a settings object with default values. |
| Public method | PointCloudOverrideSettings(PointCloudOverrideSettings) | Constructs a copy of source object. |

# See Also

PointCloudOverrideSettings Class

PointCloudOverrideSettings Members

Autodesk.Revit.DB.PointClouds Namespace

#### GetPlainText Method

---

|  |
| --- |
| FormattedText Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | GetPlainText | Returns the entire text in a plain text form. |
| Public method | GetPlainText(TextRange) | Returns a substring of the text in a plain text form. The start and end of the substring is identified by a given  TextRange  . |

# See Also

FormattedText Class

FormattedText Members

Autodesk.Revit.DB Namespace

#### SetGraphicOverrides Method

---

|  |
| --- |
| WorksharingDisplaySettings Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | SetGraphicOverrides(String, WorksharingDisplayGraphicSettings) | Sets the graphic overrides assigned to elements owned by a particular user. The username cannot be on the list of removed usernames. |
| Public method | SetGraphicOverrides(CheckoutStatus, WorksharingDisplayGraphicSettings) | Sets the graphic overrides assigned to elements with a particular ownership status. |
| Public method | SetGraphicOverrides(ModelUpdatesStatus, WorksharingDisplayGraphicSettings) | Sets the graphic overrides assigned to elements with a particular status in the central model. |
| Public method | SetGraphicOverrides(WorksetId, WorksharingDisplayGraphicSettings) | Sets the graphic overrides assigned to elements in a particular user workset. |

# See Also

WorksharingDisplaySettings Class

WorksharingDisplaySettings Members

Autodesk.Revit.DB Namespace

#### ReleaseConditions Constructor

---

|  |
| --- |
| ReleaseConditions Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | ReleaseConditions(Boolean) | Creates a new instance of ReleaseConditions. |
| Public method | ReleaseConditions(Boolean, Boolean, Boolean, Boolean, Boolean, Boolean, Boolean) | Creates a new instance of ReleaseConditions. |

# See Also

ReleaseConditions Class

ReleaseConditions Members

Autodesk.Revit.DB.Structure Namespace

#### GetAssociatedPartMaker Method

---

|  |
| --- |
| PartUtils Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | GetAssociatedPartMaker(Document, ElementId) | Gets associated PartMaker for an element. |
| Public method Static member | GetAssociatedPartMaker(Document, LinkElementId) | Gets associated PartMaker for an element. |

# See Also

PartUtils Class

PartUtils Members

Autodesk.Revit.DB Namespace

#### TableCellStyleOverrideOptions Constructor

---

|  |
| --- |
| TableCellStyleOverrideOptions Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | TableCellStyleOverrideOptions | Creates a new instance with no style characteristics overridden. |
| Public method | TableCellStyleOverrideOptions(TableCellStyleOverrideOptions) | Creates a new instance by copying an existing instance. |

# See Also

TableCellStyleOverrideOptions Class

TableCellStyleOverrideOptions Members

Autodesk.Revit.DB Namespace

#### Start Method

---

|  |
| --- |
| TransactionGroup Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | Start | Starts the transaction group |
| Public method | Start(String) | Starts the transaction group with an assigned name. |

# See Also

TransactionGroup Class

TransactionGroup Members

Autodesk.Revit.DB Namespace

#### ScheduleFilter Constructor

---

|  |
| --- |
| ScheduleFilter Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | ScheduleFilter | Creates a new ScheduleFilter. |
| Public method | ScheduleFilter(ScheduleFieldId, ScheduleFilterType) | Creates a new ScheduleFilter. |
| Public method | ScheduleFilter(ScheduleFieldId, ScheduleFilterType, ElementId) | Creates a new ScheduleFilter. |
| Public method | ScheduleFilter(ScheduleFieldId, ScheduleFilterType, Double) | Creates a new ScheduleFilter. |
| Public method | ScheduleFilter(ScheduleFieldId, ScheduleFilterType, Int32) | Creates a new ScheduleFilter. |
| Public method | ScheduleFilter(ScheduleFieldId, ScheduleFilterType, String) | Creates a new ScheduleFilter. |

# See Also

ScheduleFilter Class

ScheduleFilter Members

Autodesk.Revit.DB Namespace

#### AppendShape Method

---

|  |
| --- |
| DirectShapeType Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | AppendShape(IList GeometryObject ) | Appends the collection of GeometryObjects into the model shape representation stored in this DirectShape. |
| Public method | AppendShape(ShapeBuilder) | Append shape built by the supplied ShapeBuilderObject to shape representation stored in this DirectShapeType. The data stored in the supplied ShapeBuilder object will be cleared. |
| Public method | AppendShape(IList GeometryObject , DirectShapeTargetViewType) | Appends the collection of GeometryObjects into the model or view specific shape representation stored in this DirectShapeType. Passing DirectShapeTargetViewType.Default as view type will cause the model shape to be updated. |

# See Also

DirectShapeType Class

DirectShapeType Members

Autodesk.Revit.DB Namespace

#### Create Method

---

|  |
| --- |
| SiteSubRegion Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create(Document, IList CurveLoop ) | Creates a new SiteSubRegion element and adds it to the document. |
| Public method Static member | Create(Document, IList CurveLoop , ElementId) | Creates a new SiteSubRegion element with assigned TopographySurface to be hosted and adds it to the document. |

# See Also

SiteSubRegion Class

SiteSubRegion Members

Autodesk.Revit.DB.Architecture Namespace

#### ElementLevelFilter Constructor

---

|  |
| --- |
| ElementLevelFilter Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | ElementLevelFilter(ElementId) | Constructs a new instance of an ElementLevelFilter. |
| Public method | ElementLevelFilter(ElementId, Boolean) | Constructs a new instance of an ElementLevelFilter, with the option to match all elements not associated to the given level id. |

# See Also

ElementLevelFilter Class

ElementLevelFilter Members

Autodesk.Revit.DB Namespace

#### GetResult Method

---

|  |
| --- |
| BRepBuilder Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | GetResult | Get the Geometry object built by this BRepBuilder. This will clear the built Geometry stored in the BRepBuilder. This function will throw if this BRepBuilder hasn't completed building the b-rep. Use IsResultAvailable() to verify that this BRepBuilder contains a valid result. |
| Public method | GetResult(ExternalGeometryId, BRepBuilderPersistentIds) | Get the Geometry object built by this BRepBuilder. This will clear the built Geometry stored in the BRepBuilder. This function will throw if this BRepBuilder hasn't completed building the b-rep. Use IsResultAvailable() to verify that this BRepBuilder contains a valid result. |

# See Also

BRepBuilder Class

BRepBuilder Members

Autodesk.Revit.DB Namespace

#### GetValidTypes Method

---

|  |
| --- |
| Element Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | GetValidTypes | Obtains a set of types that are valid for this element. |
| Public method Static member | GetValidTypes(Document, ICollection ElementId ) | Obtains a set of types that are valid for all given elements. |

# See Also

Element Class

Element Members

Autodesk.Revit.DB Namespace

#### InitialLuminousIntensity Constructor

---

|  |
| --- |
| InitialLuminousIntensity Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | InitialLuminousIntensity(Double) | Creates an initial luminous intensity object with the given document and luminosity values. |
| Public method | InitialLuminousIntensity(InitialLuminousIntensity) | Creates a copy of the given initial luminous intensity object |

# See Also

InitialLuminousIntensity Class

InitialLuminousIntensity Members

Autodesk.Revit.DB.Lighting Namespace

#### NewProjectDocument Method

---

|  |
| --- |
| Application Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | NewProjectDocument(String) | New project document |
| Public method | NewProjectDocument(UnitSystem) | Creates a new project document with no template file specified. |

# See Also

Application Class

Application Members

Autodesk.Revit.ApplicationServices Namespace

#### RepeaterCoordinates Constructor

---

|  |
| --- |
| RepeaterCoordinates Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | RepeaterCoordinates | Creates zero dimensional coordinates. |
| Public method | RepeaterCoordinates(Int32) | Creates one dimensional coordinates. |
| Public method | RepeaterCoordinates(Int32, Int32) | Creates two dimensional coordinates. |

# See Also

RepeaterCoordinates Class

RepeaterCoordinates Members

Autodesk.Revit.DB Namespace

#### AddOverride Method

---

|  |
| --- |
| RebarContainerParameterManager Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | AddOverride(ElementId, ElementId) | Adds an override for the given parameter as its value will be displayed for the Rebar Container element. |
| Public method | AddOverride(ElementId, Double) | Adds an override for the given parameter as its value will be displayed for the Rebar Container element. |
| Public method | AddOverride(ElementId, Int32) | Adds an override for the given parameter as its value will be displayed for the Rebar Container element. |
| Public method | AddOverride(ElementId, String) | Adds an override for the given parameter as its value will be displayed for the Rebar Container element. |

# See Also

RebarContainerParameterManager Class

RebarContainerParameterManager Members

Autodesk.Revit.DB.Structure Namespace

#### ConnectionInputPoint Constructor

---

|  |
| --- |
| ConnectionInputPoint Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | ConnectionInputPoint | Construct a default input point. |
| Public method | ConnectionInputPoint(XYZ) | Construct an input point from 3d point. A new valid id will be auto-generated. |
| Public method | ConnectionInputPoint(XYZ, Guid) | Construct an input point from 3d point and id. |

# See Also

ConnectionInputPoint Class

ConnectionInputPoint Members

Autodesk.Revit.DB.Structure Namespace

#### NewSpace Method

---

|  |
| --- |
| Document Class   See Also |

Creates a new space.

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | NewSpace(Phase) | Creates a new unplaced space on a given phase. |
| Public method | NewSpace(Level, UV) | Creates a new space element on the given level at the given location. |
| Public method | NewSpace(Level, Phase, UV) | Creates a new space element on the given level, at the given location, and assigned to the given phase. |

# See Also

Document Class

Document Members

Autodesk.Revit.Creation Namespace

#### IsBuiltInParameter Method

---

|  |
| --- |
| ParameterUtils Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | IsBuiltInParameter(ElementId) | Checks whether an ElementId identifies a built-in parameter. |
| Public method Static member | IsBuiltInParameter(ForgeTypeId) | Checks whether a ForgeTypeId identifies a built-in parameter. |

# See Also

ParameterUtils Class

ParameterUtils Members

Autodesk.Revit.DB Namespace

#### Create3DOrthographic Method

---

|  |
| --- |
| AssemblyViewUtils Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create3DOrthographic(Document, ElementId) | Creates a new orthographic 3D assembly view for the assembly instance. |
| Public method Static member | Create3DOrthographic(Document, ElementId, ElementId, Boolean) | Creates a new orthographic 3D assembly view for the assembly instance. The view will have the same orientation as the Default 3D view. The document must be regenerated before using the 3D view. |

# See Also

AssemblyViewUtils Class

AssemblyViewUtils Members

Autodesk.Revit.DB Namespace

#### CreateFromCurvesAndShape Method

---

|  |
| --- |
| Rebar Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | CreateFromCurvesAndShape(Document, RebarShape, RebarBarType, RebarHookType, RebarHookType, Element, XYZ, IList Curve , RebarHookOrientation, RebarHookOrientation) | Creates a new instance of a shape driven Rebar element within the project. The instance will have the default shape parameters from the RebarShape. If the RebarShapeDefinesHooks flag in ReinforcementSettings has been set to true, then both the curves and hooks must match the RebarShape definition. Otherwise, the hooks can be different than the defaults specified in the RebarShape |
| Public method Static member | CreateFromCurvesAndShape(Document, RebarShape, RebarBarType, RebarHookType, RebarHookType, Element, XYZ, IList Curve , RebarHookOrientation, RebarHookOrientation, Double, Double, ElementId, ElementId) | Creates a new instance of a shape driven Rebar element within the project. The instance will have the default shape parameters from the RebarShape. If the RebarShapeDefinesHooks flag in ReinforcementSettings has been set to true, then curves, hook types and hook rotation angles should match the rebar shape definition. Otherwise, the hooks can be different than the defaults specified in the RebarShape. If the RebarShapeDefinesEndTreatment flag in ReinforcementSettings has been set to true, then curves and end treatment types should match the rebar shape definition. Otherwise, the end treatment types can be different than the defaults specified in the RebarShape. |

# See Also

Rebar Class

Rebar Members

Autodesk.Revit.DB.Structure Namespace

#### ExportLineweightKey Constructor

---

|  |
| --- |
| ExportLineweightKey Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | ExportLineweightKey | Constructs a new default ExportLineweightKey. |
| Public method | ExportLineweightKey(Int32) | Constructs a new default ExportLineweightKey using the original line weight as input. |
| Public method | ExportLineweightKey(ExportLineweightKey) | Constructs a new copy of the input ExportLineweightKey object. |

# See Also

ExportLineweightKey Class

ExportLineweightKey Members

Autodesk.Revit.DB Namespace

#### CustomInitialColor Constructor

---

|  |
| --- |
| CustomInitialColor Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | CustomInitialColor(Double) | Creates a custom initial color set to the given color |
| Public method | CustomInitialColor(CustomInitialColor) | Creates a copy of the given custom initial color |

# See Also

CustomInitialColor Class

CustomInitialColor Members

Autodesk.Revit.DB.Lighting Namespace

#### SetShape Method

---

|  |
| --- |
| DirectShape Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | SetShape(IList GeometryObject ) | Builds the shape of this object from the supplied collection of GeometryObjects. The objects are copied. If the new shape is identical to the old one, the old shape will be kept. |
| Public method | SetShape(ShapeBuilder) | Sets the shape of this object to the one accumulated in the supplied Builder object. If the new shape is identical to the old one, the old shape will be kept. |
| Public method | SetShape(IList GeometryObject , DirectShapeTargetViewType) | Builds the shape of this object from the supplied collection of GeometryObjects. The objects are copied. If the new shape is identical to the old one, the old shape will be kept. |

# See Also

DirectShape Class

DirectShape Members

Autodesk.Revit.DB Namespace

#### Close Method

---

|  |
| --- |
| Document Class   See Also |

Closes the document.

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | Close | Closes the document, save the changes if there are. |
| Public method | Close(Boolean) | Closes the document with the option to save. |

# See Also

Document Class

Document Members

Autodesk.Revit.DB Namespace

#### CompoundStructureLayer Constructor

---

|  |
| --- |
| CompoundStructureLayer Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | CompoundStructureLayer | Creates a compound structure layer using default settings. |
| Public method | CompoundStructureLayer(CompoundStructureLayer) | Creates a copy of a compound structure layer. |
| Public method | CompoundStructureLayer(Double, MaterialFunctionAssignment, ElementId) | Creates a default compound structure layer based on the given width, function and material element id. |

# See Also

CompoundStructureLayer Class

CompoundStructureLayer Members

Autodesk.Revit.DB Namespace

#### NewSlabEdge Method

---

|  |
| --- |
| Document Class   See Also |

Creates a slab edge.

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | NewSlabEdge(SlabEdgeType, Reference) | Creates a slab edge along a reference. |
| Public method | NewSlabEdge(SlabEdgeType, ReferenceArray) | Creates a slab edge along a reference array. |

# See Also

Document Class

Document Members

Autodesk.Revit.Creation Namespace

#### IsElementValidIntersectingReference Method

---

|  |
| --- |
| PartMakerMethodToDivideVolumes Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | IsElementValidIntersectingReference(ElementId) | Identifies if the provided member is valid. |
| Public method Static member | IsElementValidIntersectingReference(Document, ElementId) | Identifies if the provided member is valid. |

# See Also

PartMakerMethodToDivideVolumes Class

PartMakerMethodToDivideVolumes Members

Autodesk.Revit.DB Namespace

#### Export Method

---

|  |
| --- |
| CustomExporter Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | Export(IList ElementId ) | Exports a collection of 3D or 2D views |
| Public method | Export(View) | Exports one 3D or 2D view |

# See Also

CustomExporter Class

CustomExporter Members

Autodesk.Revit.DB Namespace

#### GetLinePattern Method

---

|  |
| --- |
| LinePatternElement Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | GetLinePattern | Gets the LinePattern associated to this element. |
| Public method Static member | GetLinePattern(Document, ElementId) | Gets the LinePattern associated to an element or from a built-in line pattern. |

# See Also

LinePatternElement Class

LinePatternElement Members

Autodesk.Revit.DB Namespace

#### AnalysisDisplayMarkersAndTextSettings Constructor

---

|  |
| --- |
| AnalysisDisplayMarkersAndTextSettings Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | AnalysisDisplayMarkersAndTextSettings | Constructs a default instance of markers and text settings. |
| Public method | AnalysisDisplayMarkersAndTextSettings(AnalysisDisplayMarkersAndTextSettings) | Constructs a new copy of the input AnalysisDisplayMarkersAndTextSettings object. |

# See Also

AnalysisDisplayMarkersAndTextSettings Class

AnalysisDisplayMarkersAndTextSettings Members

Autodesk.Revit.DB.Analysis Namespace

#### ElementId Constructor

---

|  |
| --- |
| ElementId Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | ElementId(Int32) | Create an ElementId handle with the given integer id. |
| Public method | ElementId(BuiltInCategory) | Create an ElementId handle with the given BuiltInCategory id. |
| Public method | ElementId(BuiltInParameter) | Create an ElementId handle with the given BuiltInParameter id. |

# See Also

ElementId Class

ElementId Members

Autodesk.Revit.DB Namespace

#### RemoveField Method

---

|  |
| --- |
| ScheduleDefinition Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | RemoveField(Int32) | Removes a field. |
| Public method | RemoveField(ScheduleFieldId) | Removes a field. |

# See Also

ScheduleDefinition Class

ScheduleDefinition Members

Autodesk.Revit.DB Namespace

#### ColorWithTransparency Constructor

---

|  |
| --- |
| ColorWithTransparency Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | ColorWithTransparency | color |
| Public method | ColorWithTransparency(UInt32, UInt32, UInt32, UInt32) | color |

# See Also

ColorWithTransparency Class

ColorWithTransparency Members

Autodesk.Revit.DB Namespace

#### IsAlmostEqualTo Method

---

|  |
| --- |
| XYZ Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | IsAlmostEqualTo(XYZ) | Determines whether this vector and the specified vector are the same within the tolerance (1.0e-09). |
| Public method | IsAlmostEqualTo(XYZ, Double) | Determines whether 2 vectors are the same within the given tolerance. |

# See Also

XYZ Class

XYZ Members

Autodesk.Revit.DB Namespace

#### Delete Method

---

|  |
| --- |
| Document Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | Delete(ElementId) | Deletes an element from the document given the id of that element. |
| Public method | Delete(ICollection ElementId ) | Deletes a set of elements from the document. |

# See Also

Document Class

Document Members

Autodesk.Revit.DB Namespace

#### AreaCreationData Constructor

---

|  |
| --- |
| AreaCreationData Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | AreaCreationData(Object) | Initializes a new instance of the  AreaCreationData  class |
| Public method | AreaCreationData(ViewPlan, UV) | The data needed to create a new area |

# See Also

AreaCreationData Class

AreaCreationData Members

Autodesk.Revit.Creation Namespace

#### Create Method

---

|  |
| --- |
| RebarShape Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create(Document, RebarShapeDefinition, RebarShapeMultiplanarDefinition, RebarStyle, StirrupTieAttachmentType, Int32, RebarHookOrientation, Int32, RebarHookOrientation, Int32) | Create a new instance of a Rebar Shape, which defines the shape of a rebar. |
| Public method Static member | Create(Document, RebarShapeDefinition, RebarShapeMultiplanarDefinition, RebarStyle, StirrupTieAttachmentType, Int32, RebarHookOrientation, Int32, RebarHookOrientation, Int32, Double, Double, ElementId, ElementId) | Create a new instance of a Rebar Shape, which defines the shape of a rebar. |

# See Also

RebarShape Class

RebarShape Members

Autodesk.Revit.DB.Structure Namespace

#### ElementClassFilter Constructor

---

|  |
| --- |
| ElementClassFilter Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | ElementClassFilter(Type) | Constructs a new instance of a filter to match elements by class. |
| Public method | ElementClassFilter(Type, Boolean) | Constructs a new instance of a filter to match elements by class, with the option to match all elements which are not of the given class. |

# See Also

ElementClassFilter Class

ElementClassFilter Members

Autodesk.Revit.DB Namespace

#### Create Method

---

|  |
| --- |
| ImportInstance Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create(Document, ElementId, View) | Creates a new instance of an existing DWG link type. |
| Public method Static member | Create(Document, View, ExternalResourceReference, DGNImportOptions, LinkLoadResult ) | Creates a new instance of DGN link type from an external resource reference and loads the linked file. |
| Public method Static member | Create(Document, View, ExternalResourceReference, DWGImportOptions, LinkLoadResult ) | Creates a new instance of DWG link type from an external resource reference and loads the linked file. |
| Public method Static member | Create(Document, View, ExternalResourceReference, ImportOptions3DM, LinkLoadResult ) | Creates a new instance of 3DM link type from an external resource reference and loads the linked file. |
| Public method Static member | Create(Document, View, ExternalResourceReference, OBJImportOptions, LinkLoadResult ) | Creates a new instance of OBJ link type from an external resource reference and loads the linked file. |
| Public method Static member | Create(Document, View, ExternalResourceReference, SATImportOptions, LinkLoadResult ) | Creates a new instance of SAT link type from an external resource reference and loads the linked file. |
| Public method Static member | Create(Document, View, ExternalResourceReference, SKPImportOptions, LinkLoadResult ) | Creates a new instance of SKP link type from an external resource reference and loads the linked file. |
| Public method Static member | Create(Document, View, ExternalResourceReference, STLImportOptions, LinkLoadResult ) | Creates a new instance of STL link type from an external resource reference and loads the linked file. |
| Public method Static member | Create(Document, View, String, DWGImportOptions, LinkLoadResult ) | Creates a new instance of DWG or DXF link type from a file path and loads the linked file. |

# See Also

ImportInstance Class

ImportInstance Members

Autodesk.Revit.DB Namespace

#### NewRooms2 Method

---

|  |
| --- |
| Document Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | NewRooms2(Level) | Creates new rooms in each plan circuit found in the given level in the last phase. |
| Public method | NewRooms2(Level, Phase) | Creates new rooms in each plan circuit found in the given level in the given phase. |
| Public method | NewRooms2(Phase, Int32) | Creates new unplaced rooms in the given phase. |

# See Also

Document Class

Document Members

Autodesk.Revit.Creation Namespace

#### Create Method

---

|  |
| --- |
| Railing Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create(Document, CurveLoop, ElementId, ElementId) | Creates a new railing by specifying the railing path in the project document. |
| Public method Static member | Create(Document, ElementId, ElementId, RailingPlacementPosition) | Automatically creates new railings with the specified railing type on all sides of a stairs or ramp element. |
| Public method Static member | Create(Document, ElementId, ElementId, ElementId, RailingPlacementPosition) | Creates new railings with the specified railing type on all sides of a stairs instance in a  MultistoryStairs  element. |

# See Also

Railing Class

Railing Members

Autodesk.Revit.DB.Architecture Namespace

#### ReplaceParameter Method

---

|  |
| --- |
| FamilyManager Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | ReplaceParameter(FamilyParameter, ExternalDefinition, BuiltInParameterGroup, Boolean) | Replace a family parameter with a shared parameter. |
| Public method | ReplaceParameter(FamilyParameter, ExternalDefinition, ForgeTypeId, Boolean) | Replace a family parameter with a shared parameter. |
| Public method | ReplaceParameter(FamilyParameter, String, BuiltInParameterGroup, Boolean) | Replace a shared family parameter with a new non-shared family parameter. |
| Public method | ReplaceParameter(FamilyParameter, String, ForgeTypeId, Boolean) | Replace a shared family parameter with a new non-shared family parameter. |

# See Also

FamilyManager Class

FamilyManager Members

Autodesk.Revit.DB Namespace

#### SKPImportOptions Constructor

---

|  |
| --- |
| SKPImportOptions Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | SKPImportOptions | Constructs a new instance of SKPImportOptions with default values of all properties. |
| Public method | SKPImportOptions(SKPImportOptions) | Constructs a new instance of SKPImportOptions as a copy of the import options. |

# See Also

SKPImportOptions Class

SKPImportOptions Members

Autodesk.Revit.DB Namespace

#### DirectShapeReferenceOptions Constructor

---

|  |
| --- |
| DirectShapeReferenceOptions Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | DirectShapeReferenceOptions | Constructs a new DirectShapeRefOptions instance with default settings. |
| Public method | DirectShapeReferenceOptions(DirectShapeReferenceOptions) | Constructs a new copy of the input DirectShapeRefOptions object. |

# See Also

DirectShapeReferenceOptions Class

DirectShapeReferenceOptions Members

Autodesk.Revit.DB Namespace

#### GetAlignmentStationLabels Method

---

|  |
| --- |
| AlignmentStationLabel Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | GetAlignmentStationLabels(Alignment) | Returns all alignment station labels placed on the given alignment. |
| Public method Static member | GetAlignmentStationLabels(Alignment, ElementId) | Returns all alignment station labels placed on the given alignment in the given view. |

# See Also

AlignmentStationLabel Class

AlignmentStationLabel Members

Autodesk.Revit.DB.Infrastructure Namespace

#### Create Method

---

|  |
| --- |
| Ceiling Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create(Document, IList CurveLoop , ElementId, ElementId) | Creates a new instance of ceiling within the project. |
| Public method Static member | Create(Document, IList CurveLoop , ElementId, ElementId, Line, Double) | Creates a new instance of ceiling within the project. |

# See Also

Ceiling Class

Ceiling Members

Autodesk.Revit.DB Namespace

#### GetChangeTypeParameter Method

---

|  |
| --- |
| Element Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | GetChangeTypeParameter(ElementId) | Returns ChangeType associated with a change in a parameter's value |
| Public method Static member | GetChangeTypeParameter(Parameter) | Returns ChangeType associated with a change in a parameter's value |

# See Also

Element Class

Element Members

Autodesk.Revit.DB Namespace

#### Multiply Operator

---

|  |
| --- |
| XYZ Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public operator Static member | Multiply(Double, XYZ) | Multiplies the specified number and the specified vector. |
| Public operator Static member | Multiply(XYZ, Double) | Multiplies the specified number and the specified vector. |

# See Also

XYZ Class

XYZ Members

Autodesk.Revit.DB Namespace

#### ConnectPipePlaceholdersAtTee Method

---

|  |
| --- |
| PlumbingUtils Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | ConnectPipePlaceholdersAtTee(Document, ElementId, ElementId) | Connects two placeholders that looks like Tee connection. |
| Public method Static member | ConnectPipePlaceholdersAtTee(Document, Connector, Connector, Connector) | Connects three placeholders that looks like Tee connection. |

# See Also

PlumbingUtils Class

PlumbingUtils Members

Autodesk.Revit.DB.Plumbing Namespace

#### SetFlags Method

---

|  |
| --- |
| ValueAtPointBase Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | SetFlags(IList Int32 ) | Independently sets the flags associated to all measurements. |
| Public method | SetFlags(Int32) | Sets the flags associated to all measurements to the same value. |
| Public method | SetFlags(Int32, Int32) | Sets the flags associated to a given measurement. |

# See Also

ValueAtPointBase Class

ValueAtPointBase Members

Autodesk.Revit.DB Namespace

#### LinkElementId Constructor

---

|  |
| --- |
| LinkElementId Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | LinkElementId(ElementId) | Creates a new LinkElementId representing an element in the host document. |
| Public method | LinkElementId(ElementId, ElementId) | Creates a new LinkElementId representing an element in a linked document. |

# See Also

LinkElementId Class

LinkElementId Members

Autodesk.Revit.DB Namespace

#### NewSweep Method

---

|  |
| --- |
| FamilyItemFactory Class   See Also |

Adds a new sweep form to the family document.

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | NewSweep(Boolean, ReferenceArray, SweepProfile, Int32, ProfilePlaneLocation) | Adds a new sweep form into the family document, using an array of selected references as a 3D path. |
| Public method | NewSweep(Boolean, CurveArray, SketchPlane, SweepProfile, Int32, ProfilePlaneLocation) | Adds a new sweep form to the family document, using a path of curve elements. |

# See Also

FamilyItemFactory Class

FamilyItemFactory Members

Autodesk.Revit.Creation Namespace

#### PromptForFamilyInstancePlacementOptions Constructor

---

|  |
| --- |
| PromptForFamilyInstancePlacementOptions Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | PromptForFamilyInstancePlacementOptions | Creates a new PromptForFamilyInstancePlacementOptions using default options. |
| Public method | PromptForFamilyInstancePlacementOptions(PromptForFamilyInstancePlacementOptions) | Creates a copy of an existing options object. |

# See Also

PromptForFamilyInstancePlacementOptions Class

PromptForFamilyInstancePlacementOptions Members

Autodesk.Revit.UI Namespace

#### IsNameUnique Method

---

|  |
| --- |
| HVACLoadSpaceType Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | IsNameUnique(String) | Determines whether a potential space type name is unique. |
| Public method Static member | IsNameUnique(Document, String) | Determines whether a potential space type name is unique. |

# See Also

HVACLoadSpaceType Class

HVACLoadSpaceType Members

Autodesk.Revit.DB.Analysis Namespace

#### CreateLessRule Method

---

|  |
| --- |
| ParameterFilterRuleFactory Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | CreateLessRule(ElementId, ElementId) | Creates a filter rule that determines whether ElementId values from the document are less than a certain value. |
| Public method Static member | CreateLessRule(ElementId, Int32) | Creates a filter rule that determines whether integer values from the document are less than a certain value. |
| Public method Static member | CreateLessRule(ElementId, String) | Creates a filter rule that determines whether strings from the document are less than a certain value. |
| Public method Static member | CreateLessRule(ElementId, Double, Double) | Creates a filter rule that determines whether double-precision values from the document are less than a certain value. |
| Public method Static member | CreateLessRule(ElementId, String, Boolean) | **Obsolete.**   Creates a filter rule that determines whether strings from the document are less than a certain value. |

# See Also

ParameterFilterRuleFactory Class

ParameterFilterRuleFactory Members

Autodesk.Revit.DB Namespace

#### AnalysisDisplayColoredSurfaceSettings Constructor

---

|  |
| --- |
| AnalysisDisplayColoredSurfaceSettings Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | AnalysisDisplayColoredSurfaceSettings | Constructs a default instance of colored surface settings. |
| Public method | AnalysisDisplayColoredSurfaceSettings(AnalysisDisplayColoredSurfaceSettings) | Constructs a new copy of the input AnalysisDisplayColoredSurfaceSettings object. |

# See Also

AnalysisDisplayColoredSurfaceSettings Class

AnalysisDisplayColoredSurfaceSettings Members

Autodesk.Revit.DB.Analysis Namespace

#### ReferenceIntersector Constructor

---

|  |
| --- |
| ReferenceIntersector Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | ReferenceIntersector(View3D) | Constructs a ReferenceIntersector which is set to return intersections from all elements and representing all reference target types. |
| Public method | ReferenceIntersector(ElementFilter, FindReferenceTarget, View3D) | Constructs a ReferenceIntersector which is set to return intersections from any element which passes an input filter. |
| Public method | ReferenceIntersector(ElementId, FindReferenceTarget, View3D) | Constructs a ReferenceIntersector which is set to return intersections from a single target element only. |
| Public method | ReferenceIntersector(ICollection ElementId , FindReferenceTarget, View3D) | Constructs a ReferenceIntersector which is set to return intersections from any of a set of target elements. |

# See Also

ReferenceIntersector Class

ReferenceIntersector Members

Autodesk.Revit.DB Namespace

#### Print Method

---

|  |
| --- |
| Document Class   See Also |

Prints a set of views.

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | Print(ViewSet) | Prints a set of views with default view template and default print settings. |
| Public method | Print(ViewSet, View) | Prints a set of views with a specified view template and default print settings. |
| Public method | Print(ViewSet, Boolean) | Prints a set of views with default view template and default print settings. |
| Public method | Print(ViewSet, View, Boolean) | Prints a set of views with a specified view template and default print settings. |

# See Also

Document Class

Document Members

Autodesk.Revit.DB Namespace

#### Create Method

---

|  |
| --- |
| NumberSystem Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create(Document, ElementId, LinkElementId, Reference) | Creates a new instance of a NumberSystem associated to a host element and a view. |
| Public method Static member | Create(Document, ElementId, LinkElementId, StairsNumberSystemReferenceOption, LinkElementId) | Creates a new instance of a NumberSystem associated to a host element, a view, and a reference level of stairs if in a multistory stairs. |

# See Also

NumberSystem Class

NumberSystem Members

Autodesk.Revit.DB Namespace

#### CreateRevolvedGeometry Method

---

|  |
| --- |
| GeometryCreationUtilities Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | CreateRevolvedGeometry(Frame, IList CurveLoop , Double, Double) | Creates a solid of revolution by revolving a set of closed curve loops around an axis by a specified angle. |
| Public method Static member | CreateRevolvedGeometry(Frame, IList CurveLoop , Double, Double, SolidOptions) | Creates a solid of revolution by revolving a set of closed curve loops around an axis by a specified angle. |

# See Also

GeometryCreationUtilities Class

GeometryCreationUtilities Members

Autodesk.Revit.DB Namespace

#### PickObjects Method

---

|  |
| --- |
| Selection Class   See Also |

Prompts the user to select multiple objects.

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | PickObjects(ObjectType) | Prompts the user to select multiple objects. |
| Public method | PickObjects(ObjectType, ISelectionFilter) | Prompts the user to select multiple objects which pass a customer filter. |
| Public method | PickObjects(ObjectType, String) | Prompts the user to select multiple objects while showing a custom status prompt string. |
| Public method | PickObjects(ObjectType, ISelectionFilter, String) | Prompts the user to select multiple objects which pass a custom filter while showing a custom status prompt string. |
| Public method | PickObjects(ObjectType, ISelectionFilter, String, IList Reference ) | Prompts the user to select multiple objects which pass a custom filter while showing a custom status prompt string. A preselected set of objects may be supplied and will be selected at the start of the selection. |

# See Also

Selection Class

Selection Members

Autodesk.Revit.UI.Selection Namespace

#### CreateSingleCategorySchedule Method

---

|  |
| --- |
| AssemblyViewUtils Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | CreateSingleCategorySchedule(Document, ElementId, ElementId) | Creates a new single-category schedule assembly view for the assembly instance. |
| Public method Static member | CreateSingleCategorySchedule(Document, ElementId, ElementId, ElementId, Boolean) | Creates a new single-category schedule assembly view for the assembly instance. |

# See Also

AssemblyViewUtils Class

AssemblyViewUtils Members

Autodesk.Revit.DB Namespace

#### Multiply Operator

---

|  |
| --- |
| UV Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public operator Static member | Multiply(Double, UV) | The product of the specified number and the specified 2-D vector. |
| Public operator Static member | Multiply(UV, Double) | The product of the specified number and the specified 2-D vector. |

# See Also

UV Class

UV Members

Autodesk.Revit.DB Namespace

#### Create Method

---

|  |
| --- |
| StructuralConnectionHandlerType Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create(Document, String, Guid, String) | Creates a new StructuralConnectionHandlerType object. |
| Public method Static member | Create(Document, String, Guid, String, ElementId) | Creates a new StructuralConnectionHandlerType object. |
| Public method Static member | Create(Document, String, Guid, String, ElementId, IList ConnectionInputPointInfo ) | Creates a new StructuralConnectionHandlerType object. |

# See Also

StructuralConnectionHandlerType Class

StructuralConnectionHandlerType Members

Autodesk.Revit.DB.Structure Namespace

#### CreateRibbonPanel Method

---

|  |
| --- |
| UIControlledApplication Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | CreateRibbonPanel(String) | Create a new RibbonPanel on the Add-Ins tab. |
| Public method | CreateRibbonPanel(String, String) | Create a new RibbonPanel on the specified tab. |
| Public method | CreateRibbonPanel(Tab, String) | Create a new RibbonPanel on the designated standard Revit tab. |

# See Also

UIControlledApplication Class

UIControlledApplication Members

Autodesk.Revit.UI Namespace

#### GetColumnAttachment Method

---

|  |
| --- |
| ColumnAttachment Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | GetColumnAttachment(FamilyInstance, ElementId) | Look up a column attachment by specifying the target id. |
| Public method Static member | GetColumnAttachment(FamilyInstance, Int32) | Look up a column attachment. There is at most one attachment on the base and one on the top. |

# See Also

ColumnAttachment Class

ColumnAttachment Members

Autodesk.Revit.DB Namespace

#### AddField Method

---

|  |
| --- |
| ScheduleDefinition Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | AddField(SchedulableField) | Adds a regular field at the end of the list. |
| Public method | AddField(ScheduleFieldType) | Adds a regular field at the end of the list. |
| Public method | AddField(ScheduleFieldType, ElementId) | Adds a regular field at the end of the list. |

# See Also

ScheduleDefinition Class

ScheduleDefinition Members

Autodesk.Revit.DB Namespace

#### ElectricalDemandFactorValue Constructor

---

|  |
| --- |
| ElectricalDemandFactorValue Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | ElectricalDemandFactorValue | Default constructor. Initializes factor to 1.0 or 100%. Min and max range are set to 0.0 |
| Public method | ElectricalDemandFactorValue(Double, Double, Double) | Constructor. Initializes factor, minimum range and maximum range to values passed in. |

# See Also

ElectricalDemandFactorValue Class

ElectricalDemandFactorValue Members

Autodesk.Revit.DB.Electrical Namespace

#### SetValue Method

---

|  |
| --- |
| ScheduleFilter Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | SetValue(Double) | Set the filter value to a double. |
| Public method | SetValue(Int32) | Set the filter value to an integer. |
| Public method | SetValue(String) | Set the filter value to a string. |
| Public method | SetValue(ElementId) | Set the filter value to an ElementId. |

# See Also

ScheduleFilter Class

ScheduleFilter Members

Autodesk.Revit.DB Namespace

#### IsValidValue Method

---

|  |
| --- |
| AssetPropertyDoubleArray4d Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | IsValidValue(IList Double ) | Checks that the value is a valid value for this property. |
| Public method | IsValidValue(Color) | Checks that the value is a valid value for this property. |

# See Also

AssetPropertyDoubleArray4d Class

AssetPropertyDoubleArray4d Members

Autodesk.Revit.DB.Visual Namespace

#### AnalysisDisplayColorEntry Constructor

---

|  |
| --- |
| AnalysisDisplayColorEntry Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | AnalysisDisplayColorEntry | Constructs a new AnalysisDisplayColorEntry with default settings. |
| Public method | AnalysisDisplayColorEntry(Color) | Constructs a color entry with no value assigned. |
| Public method | AnalysisDisplayColorEntry(Color, Double) | Constructs a color entry with a specific value assigned. |

# See Also

AnalysisDisplayColorEntry Class

AnalysisDisplayColorEntry Members

Autodesk.Revit.DB.Analysis Namespace

#### GetModifiedElementIds Method

---

|  |
| --- |
| DocumentChangedEventArgs Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | GetModifiedElementIds | Returns set of elements that were modified. |
| Public method | GetModifiedElementIds(ElementFilter) | Returns set of elements that were modified according to the given element filter. |

# See Also

DocumentChangedEventArgs Class

DocumentChangedEventArgs Members

Autodesk.Revit.DB.Events Namespace

#### EdgeEndPoint Constructor

---

|  |
| --- |
| EdgeEndPoint Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | EdgeEndPoint(EdgeEndPoint) | Creates a copy of the given EdgeEndPoint instance. |
| Public method | EdgeEndPoint(Edge, Int32) | Constructs an instance of EdgeEndPoint. |

# See Also

EdgeEndPoint Class

EdgeEndPoint Members

Autodesk.Revit.DB Namespace

#### CreateSchedule Method

---

|  |
| --- |
| ViewSchedule Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | CreateSchedule(Document, ElementId) | Creates a regular schedule. |
| Public method Static member | CreateSchedule(Document, ElementId, ElementId) | Creates a regular schedule that can relate to a specific area scheme. |

# See Also

ViewSchedule Class

ViewSchedule Members

Autodesk.Revit.DB Namespace

#### PhotometricWebLightDistribution Constructor

---

|  |
| --- |
| PhotometricWebLightDistribution Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | PhotometricWebLightDistribution(PhotometricWebLightDistribution) | Creates a copy of the given photometric web light distribution |
| Public method | PhotometricWebLightDistribution(String, Double) | Creates a photometric web light distribution object with the given filename and tilt. |

# See Also

PhotometricWebLightDistribution Class

PhotometricWebLightDistribution Members

Autodesk.Revit.DB.Lighting Namespace

#### PointCloudColorSettings Constructor

---

|  |
| --- |
| PointCloudColorSettings Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | PointCloudColorSettings | Constructs color settings object with default colors. |
| Public method | PointCloudColorSettings(PointCloudColorMode) | Constructs color settings object with default color for given color mode. |
| Public method | PointCloudColorSettings(PointCloudColorSettings) | Constructs a copy of source object. |
| Public method | PointCloudColorSettings(Color, Color) | Constructs color settings object from given colors. |

# See Also

PointCloudColorSettings Class

PointCloudColorSettings Members

Autodesk.Revit.DB.PointClouds Namespace

#### CreateFixedReferenceSweptGeometry Method

---

|  |
| --- |
| GeometryCreationUtilities Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | CreateFixedReferenceSweptGeometry(CurveLoop, Int32, Double, IList CurveLoop , XYZ) | Creates a solid by sweeping one or more closed coplanar curve loops along a path while keeping the profile plane oriented so that a line in the plane that is initially perpendicular to a given fixed direction remains perpendicular as the profile is swept along the path. |
| Public method Static member | CreateFixedReferenceSweptGeometry(CurveLoop, Int32, Double, IList CurveLoop , XYZ, SolidOptions) | Creates a solid by sweeping one or more closed coplanar curve loops along a path while keeping the profile plane oriented so that a line in the plane that is initially perpendicular to a given fixed direction remains perpendicular as the profile is swept along the path. |

# See Also

GeometryCreationUtilities Class

GeometryCreationUtilities Members

Autodesk.Revit.DB Namespace

#### GetCellFormatOptions Method

---

|  |
| --- |
| TableSectionData Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | GetCellFormatOptions(Int32, Document) | Returns a column's cell FormatOptions and if no FormatOptions exists for this column, it would come from the section. |
| Public method | GetCellFormatOptions(Int32, Int32, Document) | Returns a cell's FormatOptions and if no FormatOptions exists for this cell, it would come from the column, or the row, or the section. |

# See Also

TableSectionData Class

TableSectionData Members

Autodesk.Revit.DB Namespace

#### SetSubscriptStatus Method

---

|  |
| --- |
| FormattedText Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | SetSubscriptStatus(Boolean) | Sets the characters in the entire text to be subscript or not subscript. |
| Public method | SetSubscriptStatus(TextRange, Boolean) | Sets the characters in a given text range to be subscript or not subscript. |

# See Also

FormattedText Class

FormattedText Members

Autodesk.Revit.DB Namespace

#### HemisphericalLightDistribution Constructor

---

|  |
| --- |
| HemisphericalLightDistribution Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | HemisphericalLightDistribution | Creates a hemispherical light distribution object. |
| Public method | HemisphericalLightDistribution(HemisphericalLightDistribution) | Creates a copy of the given hemispherical light distribution |

# See Also

HemisphericalLightDistribution Class

HemisphericalLightDistribution Members

Autodesk.Revit.DB.Lighting Namespace

#### CreateContainsRule Method

---

|  |
| --- |
| ParameterFilterRuleFactory Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | CreateContainsRule(ElementId, String) | Creates a filter rule that determines whether strings from the document contain a certain string value. |
| Public method Static member | CreateContainsRule(ElementId, String, Boolean) | **Obsolete.**   Creates a filter rule that determines whether strings from the document contain a certain string value. |

# See Also

ParameterFilterRuleFactory Class

ParameterFilterRuleFactory Members

Autodesk.Revit.DB Namespace

#### SendToBack Method

---

|  |
| --- |
| DetailElementOrderUtils Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | SendToBack(Document, View, ElementId) | Places the given detail instance behind all detail instances in the view. |
| Public method Static member | SendToBack(Document, View, ICollection ElementId ) | Places the given detail instances behind all other detail instances in the view, while keeping the order of the given ones. |

# See Also

DetailElementOrderUtils Class

DetailElementOrderUtils Members

Autodesk.Revit.DB Namespace

#### Create Method

---

|  |
| --- |
| PipingSystem Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create(Document, ElementId) | Creates a new instance of a piping system and adds it to the document. |
| Public method Static member | Create(Document, ElementId, String) | Creates a new instance of a piping system and adds it to the document. |

# See Also

PipingSystem Class

PipingSystem Members

Autodesk.Revit.DB.Plumbing Namespace

#### ElementIntersectsSolidFilter Constructor

---

|  |
| --- |
| ElementIntersectsSolidFilter Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | ElementIntersectsSolidFilter(Solid) | Constructs a filter to match elements which intersect the given element. |
| Public method | ElementIntersectsSolidFilter(Solid, Boolean) | Constructs a filter to match elements which intersect the given element, with the option to match all elements not intersecting the given element. |

# See Also

ElementIntersectsSolidFilter Class

ElementIntersectsSolidFilter Members

Autodesk.Revit.DB Namespace

#### NewRoom Method

---

|  |
| --- |
| Document Class   See Also |

Creates a new room.

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | NewRoom(Phase) | Creates a new unplaced room and with an assigned phase. |
| Public method | NewRoom(Level, UV) | Creates a new room on a level at a specified point. |
| Public method | NewRoom(Room, PlanCircuit) | Creates a new room within the confines of a plan circuit, or places an unplaced room within the confines of the plan circuit. |

# See Also

Document Class

Document Members

Autodesk.Revit.Creation Namespace

#### CreateRibbonPanel Method

---

|  |
| --- |
| UIApplication Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | CreateRibbonPanel(String) | Create a new RibbonPanel on the Add-Ins tab. |
| Public method | CreateRibbonPanel(String, String) | Create a new RibbonPanel on the specified tab. |
| Public method | CreateRibbonPanel(Tab, String) | Create a new RibbonPanel on the designated standard Revit tab. |

# See Also

UIApplication Class

UIApplication Members

Autodesk.Revit.UI Namespace

#### GetAllCapsStatus Method

---

|  |
| --- |
| FormattedText Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | GetAllCapsStatus | Returns whether  All  ,  None  or a  Mixed  of characters in the entire text are in all caps. |
| Public method | GetAllCapsStatus(TextRange) | Returns whether  All  ,  None  or a  Mixed  set of characters in a given text range are in all caps. |

# See Also

FormattedText Class

FormattedText Members

Autodesk.Revit.DB Namespace

#### InitialIlluminanceIntensity Constructor

---

|  |
| --- |
| InitialIlluminanceIntensity Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | InitialIlluminanceIntensity(InitialIlluminanceIntensity) | Creates a copy of the given initial illuminance intensity object |
| Public method | InitialIlluminanceIntensity(Double, Double) | Creates an initial illuminance intensity object with the given document and illuminance values. |

# See Also

InitialIlluminanceIntensity Class

InitialIlluminanceIntensity Members

Autodesk.Revit.DB.Lighting Namespace

#### NewBoundingBoxUV Method

---

|  |
| --- |
| Application Class   See Also |

Creates a two-dimensional rectangle.

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | NewBoundingBoxUV | Creates an empty two-dimensional rectangle. |
| Public method | NewBoundingBoxUV(Double, Double, Double, Double) | Creates a two-dimensional rectangle with supplied values. |

# See Also

Application Class

Application Members

Autodesk.Revit.Creation Namespace

#### LayerModifier Constructor

---

|  |
| --- |
| LayerModifier Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | LayerModifier | Constructs a new LayerModifier with default values. |
| Public method | LayerModifier(ModifierType, String) | Constructs a new LayerModifier with modifierType and separator. |

# See Also

LayerModifier Class

LayerModifier Members

Autodesk.Revit.DB Namespace

#### VisibleInViewFilter Constructor

---

|  |
| --- |
| VisibleInViewFilter Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | VisibleInViewFilter(Document, ElementId) | Constructs a new instance of a VisibleInViewFilter. |
| Public method | VisibleInViewFilter(Document, ElementId, Boolean) | Constructs a new instance of a VisibleInViewFilter, with the option to pass all non-visible elements. |

# See Also

VisibleInViewFilter Class

VisibleInViewFilter Members

Autodesk.Revit.DB Namespace

#### IsValidShape Method

---

|  |
| --- |
| DirectShape Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | IsValidShape(IList GeometryObject ) | Validates shape to be stored in a DirectShape. Supercedes and extends IsValidGeometry(). |
| Public method | IsValidShape(IList GeometryObject , DirectShapeTargetViewType) | Validates view-specific shape to be stored in a DirectShape. Expects a non-default view type. |

# See Also

DirectShape Class

DirectShape Members

Autodesk.Revit.DB Namespace

#### SetCellCalculatedValue Method

---

|  |
| --- |
| TableSectionData Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | SetCellCalculatedValue(Int32, TableCellCalculatedValueData) | Allows the caller to set the calculated value for a specified column |
| Public method | SetCellCalculatedValue(Int32, Int32, TableCellCalculatedValueData) | Allows the caller to set the calculated value for a specified cell |

# See Also

TableSectionData Class

TableSectionData Members

Autodesk.Revit.DB Namespace

#### IntegerParameterValue Constructor

---

|  |
| --- |
| IntegerParameterValue Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | IntegerParameterValue | Default constructor |
| Public method | IntegerParameterValue(Int32) | Value constructor |

# See Also

IntegerParameterValue Class

IntegerParameterValue Members

Autodesk.Revit.DB Namespace

#### SetUnderlineStatus Method

---

|  |
| --- |
| FormattedText Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | SetUnderlineStatus(Boolean) | Sets the characters in the entire text to be underlined or not underlined. |
| Public method | SetUnderlineStatus(TextRange, Boolean) | Sets the characters in a given text range to be underlined or not underlined. |

# See Also

FormattedText Class

FormattedText Members

Autodesk.Revit.DB Namespace

#### DoDragDrop Method

---

|  |
| --- |
| UIApplication Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | DoDragDrop(ICollection String ) | Initiates a drag and drop operation of a collection of file names on the Revit user interface. |
| Public method Static member | DoDragDrop(Object, IDropHandler) | Initiates a drag and drop operation with a custom drop implementation. |

# See Also

UIApplication Class

UIApplication Members

Autodesk.Revit.UI Namespace

#### Reload Method

---

|  |
| --- |
| CADLinkType Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | Reload | Loads or reloads the link from its currently-stored location. If the link is an external resource, Revit will contact the IExternalResourceServer to get the latest version of the link. |
| Public method | Reload(CADLinkOptions) | Loads or reloads the link from its currently-stored location. If the link is an external resource, Revit will contact the IExternalResourceServer to get the latest version of the link. |

# See Also

CADLinkType Class

CADLinkType Members

Autodesk.Revit.DB Namespace

#### LinePattern Constructor

---

|  |
| --- |
| LinePattern Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | LinePattern | Creates a simple line pattern. |
| Public method | LinePattern(String) | Creates a line pattern with given name. |

# See Also

LinePattern Class

LinePattern Members

Autodesk.Revit.DB Namespace

#### NewFlexPipe Method

---

|  |
| --- |
| Document Class   See Also |

Adds a new flexible pipe into the document.

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | NewFlexPipe(IList XYZ , FlexPipeType) | Adds a new flexible pipe into the document, using a point array and pipe type. |
| Public method | NewFlexPipe(Connector, Connector, FlexPipeType) | Adds a new flexible pipe into the document, using two connector, and flexible pipe type. |
| Public method | NewFlexPipe(Connector, IList XYZ , FlexPipeType) | Adds a new flexible pipe into the document, using a connector, point array and pipe type. |

# See Also

Document Class

Document Members

Autodesk.Revit.Creation Namespace

#### Create Method

---

|  |
| --- |
| Floor Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create(Document, IList CurveLoop , ElementId, ElementId) | Creates a new instance of architectural floor within the project. |
| Public method Static member | Create(Document, IList CurveLoop , ElementId, ElementId, Boolean, Line, Double) | Creates a new instance of floor within the project. |

# See Also

Floor Class

Floor Members

Autodesk.Revit.DB Namespace

#### GetDefaultNameForSchedule Method

---

|  |
| --- |
| ViewSchedule Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | GetDefaultNameForSchedule(Document, ElementId) | Gets the default view name that will be used when creating a regular schedule. |
| Public method Static member | GetDefaultNameForSchedule(Document, ElementId, ElementId) | Gets the default view name that will be used when creating a schedule. |

# See Also

ViewSchedule Class

ViewSchedule Members

Autodesk.Revit.DB Namespace

#### AddReferencePlane Method

---

|  |
| --- |
| DirectShape Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | AddReferencePlane(Plane) | Adds a reference plane to the DirectShape. The reference plane can either be bounded or unbounded. |
| Public method | AddReferencePlane(Plane, BoundingBoxUV) | Adds a reference plane to the DirectShape. The reference plane can either be bounded or unbounded. |
| Public method | AddReferencePlane(Plane, DirectShapeReferenceOptions) | Adds a reference plane to the DirectShape. The reference plane can either be bounded or unbounded. |
| Public method | AddReferencePlane(Plane, BoundingBoxUV, DirectShapeReferenceOptions) | Adds a reference plane to the DirectShape. The reference plane can either be bounded or unbounded. |

# See Also

DirectShape Class

DirectShape Members

Autodesk.Revit.DB Namespace

#### Paint Method

---

|  |
| --- |
| Document Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | Paint(ElementId, Face, ElementId) | Paint the element's face with specified material. |
| Public method | Paint(ElementId, Face, FamilyParameter) | Paint the element's face with specified material. |

# See Also

Document Class

Document Members

Autodesk.Revit.DB Namespace

#### BoundingBoxIsInsideFilter Constructor

---

|  |
| --- |
| BoundingBoxIsInsideFilter Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | BoundingBoxIsInsideFilter(Outline) | Constructs a new instance of a filter to match elements with a bounding box that is contained by the given Outline. |
| Public method | BoundingBoxIsInsideFilter(Outline, Boolean) | Constructs a new instance of a filter to match elements with a bounding box is contained by the given Outline, with the option to invert the filter and match all elements with a bounding box that are not contained by the given Outline. |
| Public method | BoundingBoxIsInsideFilter(Outline, Double) | Constructs a new instance of a filter to match elements with a bounding box that is contained by the given Outline. |
| Public method | BoundingBoxIsInsideFilter(Outline, Double, Boolean) | Constructs a new instance of a filter to match elements with a bounding box is contained by the given Outline, with the option to invert the filter and match all elements with a bounding box that are not contained by the given Outline. |

# See Also

BoundingBoxIsInsideFilter Class

BoundingBoxIsInsideFilter Members

Autodesk.Revit.DB Namespace

#### AddReferenceCurve Method

---

|  |
| --- |
| DirectShapeType Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | AddReferenceCurve(Curve) | Adds a reference curve to the DirectShapeType. |
| Public method | AddReferenceCurve(Curve, DirectShapeReferenceOptions) | Adds a reference curve to the DirectShapeType. |

# See Also

DirectShapeType Class

DirectShapeType Members

Autodesk.Revit.DB Namespace

#### Start Method

---

|  |
| --- |
| StairsEditScope Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | Start(ElementId) | Starts an stairs edit mode for an existing Stairs element |
| Public method | Start(ElementId, ElementId) | Creates a new empty stairs element with a default stairs type in the specified levels and then starts stairs edit mode and editing the new stairs. |

# See Also

StairsEditScope Class

StairsEditScope Members

Autodesk.Revit.DB Namespace

#### GetSectionData Method

---

|  |
| --- |
| TableData Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | GetSectionData(Int32) | Returns the section data array element at the specified index. |
| Public method | GetSectionData(SectionType) | Returns the pointer to the section data array element at the specified section type. |

# See Also

TableData Class

TableData Members

Autodesk.Revit.DB Namespace

#### LoadFrom Method

---

|  |
| --- |
| RevitLinkType Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | LoadFrom(ExternalResourceReference, WorksetConfiguration) | Loads or reloads the Revit link. The link will be loaded from the location given in the input ExternalResourceReference. |
| Public method | LoadFrom(ModelPath, WorksetConfiguration) | Loads or reloads the Revit link from disk or cloud. The link will be loaded from the input path. |

# See Also

RevitLinkType Class

RevitLinkType Members

Autodesk.Revit.DB Namespace

#### WorksetConfiguration Constructor

---

|  |
| --- |
| WorksetConfiguration Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | WorksetConfiguration | Constructs a new workset configuration with an initial setting to open all user-created worksets. |
| Public method | WorksetConfiguration(WorksetConfiguration) | Constructs a new copy of the input WorksetConfiguration object. |
| Public method | WorksetConfiguration(WorksetConfigurationOption) | Constructs a new workset configuration with an initial setting to open or close all user-created worksets, or to open last viewed worksets. |

# See Also

WorksetConfiguration Class

WorksetConfiguration Members

Autodesk.Revit.DB Namespace

#### SetCellCombinedParameters Method

---

|  |
| --- |
| TableSectionData Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | SetCellCombinedParameters(Int32, IList TableCellCombinedParameterData ) | Allows the caller to set combined parameter for a specified column |
| Public method | SetCellCombinedParameters(Int32, Int32, IList TableCellCombinedParameterData ) | Allows the caller to set combined parameter for a specified cell |

# See Also

TableSectionData Class

TableSectionData Members

Autodesk.Revit.DB Namespace

#### FieldValues Constructor

---

|  |
| --- |
| FieldValues Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | FieldValues(FieldValues) | Creates a copy of the given FieldValues instance. |
| Public method | FieldValues(IList ValueAtPoint ) | Creates object from an array of domain point values |
| Public method | FieldValues(IList VectorAtPoint ) | Creates object from an array of domain point vectors |
| Public method | FieldValues(IList ValueAtPoint , XYZ) | Creates object from an array of domain point values |

# See Also

FieldValues Class

FieldValues Members

Autodesk.Revit.DB.Analysis Namespace

#### BarTypeDiameterOptions Constructor

---

|  |
| --- |
| BarTypeDiameterOptions Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | BarTypeDiameterOptions | Constructs a new BarTypeDiameterOptions with default settings. |
| Public method | BarTypeDiameterOptions(RebarBarType) | Constructs a new BarTypeDiameterOptions copying the diameter information from the bar type. |

# See Also

BarTypeDiameterOptions Class

BarTypeDiameterOptions Members

Autodesk.Revit.DB Namespace

#### GetCurveUV Method

---

|  |
| --- |
| Edge Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | GetCurveUV(Int32) | Calculate a 2D curve that represents the edge in the uv-parameter plane of one of the edge's faces. The output curve's direction will follow the parametric direction of the edge, not the topological direction of the edge on the given face. |
| Public method | GetCurveUV(Int32, Transform2D) | Calculate and transform a 2D curve that represents the edge in the uv-parameter plane of one of the edge's faces. The output curve's direction will follow the parametric direction of the edge, not the topological direction of the edge on the given face. |

# See Also

Edge Class

Edge Members

Autodesk.Revit.DB Namespace

#### AddParameter Method

---

|  |
| --- |
| FamilyManager Class   See Also |

Add a new parameter to the family.

Add a new parameter to the family.

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | AddParameter(ExternalDefinition, BuiltInParameterGroup, Boolean) | Add a new shared parameter to the family. |
| Public method | AddParameter(ExternalDefinition, ForgeTypeId, Boolean) | Add a new shared parameter to the family. |
| Public method | AddParameter(String, BuiltInParameterGroup, Category, Boolean) | Add a new family type parameter to control the type of a nested family within another family. |
| Public method | AddParameter(String, ForgeTypeId, Category, Boolean) | Add a new family type parameter to control the type of a nested family within another family. |
| Public method | AddParameter(String, ForgeTypeId, ForgeTypeId, Boolean) | Add a new family parameter with a given name. |

# See Also

FamilyManager Class

FamilyManager Members

Autodesk.Revit.DB Namespace

#### ExternalResourceSubFolder Constructor

---

|  |
| --- |
| ExternalResourceSubFolder Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | ExternalResourceSubFolder | Constructs a new ExternalResourceSubFolder with default values for folder name and icon path. |
| Public method | ExternalResourceSubFolder(String, String) | Constructs a new ExternalResourceSubFolder with custom values for folder name and icon path. |

# See Also

ExternalResourceSubFolder Class

ExternalResourceSubFolder Members

Autodesk.Revit.DB Namespace

#### Create Method

---

|  |
| --- |
| Point Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create(XYZ) | Creates a point at the given coordinates. |
| Public method Static member | Create(XYZ, ElementId) | Creates a point at the given coordinates and assigns it the specified GraphicsStyle. |

# See Also

Point Class

Point Members

Autodesk.Revit.DB Namespace

#### CreateBlendGeometry Method

---

|  |
| --- |
| GeometryCreationUtilities Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | CreateBlendGeometry(CurveLoop, CurveLoop, ICollection VertexPair ) | Creates a solid by blending two closed curve loops lying in non-coincident planes. |
| Public method Static member | CreateBlendGeometry(CurveLoop, CurveLoop, ICollection VertexPair , SolidOptions) | Creates a solid by blending two closed curve loops lying in non-coincident planes. |

# See Also

GeometryCreationUtilities Class

GeometryCreationUtilities Members

Autodesk.Revit.DB Namespace

#### ExternalResourceReference Constructor

---

|  |
| --- |
| ExternalResourceReference Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | ExternalResourceReference(ExternalResourceReference) | Creates a new ExternalResourceReference from the given ExternalResourceReference. |
| Public method | ExternalResourceReference(Guid, IDictionary String, String , String, String) | Creates a new ExternalResourceReference from the given data. |

# See Also

ExternalResourceReference Class

ExternalResourceReference Members

Autodesk.Revit.DB Namespace

#### GetSubelement Method

---

|  |
| --- |
| Document Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | GetSubelement(String) | Gets the subelement referenced by a unique id string. |
| Public method | GetSubelement(Reference) | Gets the subelement referenced by the input reference. |
| Public method | GetSubelement(ElementId, Int32) | Gets the subelement referenced by a parent id and subelement id. |

# See Also

Document Class

Document Members

Autodesk.Revit.DB Namespace

#### ElementOwnerViewFilter Constructor

---

|  |
| --- |
| ElementOwnerViewFilter Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | ElementOwnerViewFilter(ElementId) | Constructs a new instance of a filter to match elements which are owned by a particular view. |
| Public method | ElementOwnerViewFilter(ElementId, Boolean) | Constructs a new instance of a filter to match elements which are owned by a particular view, with the option to invert the filter and find elements not owned by the given view. |

# See Also

ElementOwnerViewFilter Class

ElementOwnerViewFilter Members

Autodesk.Revit.DB Namespace

#### DWGExportOptions Constructor

---

|  |
| --- |
| DWGExportOptions Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | DWGExportOptions | Constructs a new instance of DWGExportOptions with default values of all properties. |
| Public method | DWGExportOptions(DWGExportOptions) | Constructs a new instance of DWGExportOptions as a copy of the export options. |

# See Also

DWGExportOptions Class

DWGExportOptions Members

Autodesk.Revit.DB Namespace

#### ExportFontKey Constructor

---

|  |
| --- |
| ExportFontKey Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method | ExportFontKey | Constructs a new default ExportFontKey. |
| Public method | ExportFontKey(String) | Constructs a new ExportFontKey using an input font name. |
| Public method | ExportFontKey(ExportFontKey) | Constructs a new copy of the input ExportFontKey object. |

# See Also

ExportFontKey Class

ExportFontKey Members

Autodesk.Revit.DB Namespace