#### GetHandlesPosition Method

---

|  |
| --- |
| IRebarUpdateServer Interface   See Also |

This function is supposed to provide the positions of handles defined in GetCustomHandles(). These positions will be shown on screen when the bar constraints are edited. If a position for a handle isn't provided, that handle will not be represented on screen while edit constraints.

This function is called when edit constraints command is lunched or during edit constraints after a constraint was changed and the curve calculation was done.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018

# Syntax

| C# |
| --- |
| ``` bool GetHandlesPosition( 	RebarHandlePositionData handlePositionData ) ``` |

| Visual Basic |
| --- |
| ``` Function GetHandlesPosition ( _ 	handlePositionData As RebarHandlePositionData _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` bool GetHandlesPosition( 	RebarHandlePositionData^ handlePositionData ) ``` |

#### Parameters

handlePositionData
:   Type:  Autodesk.Revit.DB.Structure RebarHandlePositionData
     Use the members of this class to access the inputs and define the handle positions for this free form rebar.

#### Return Value

Returns true if calculation of handle positions was successful, false otherwise.

# See Also

IRebarUpdateServer Interface

Autodesk.Revit.DB.Structure Namespace