#### FabricationPartCannotChangeTypeBadDimUnConnError Property

---

|  |
| --- |
| BuiltInFailures MEPFabricationFailures Class   See Also |

The selected fitting(s) cannot successfully change the type. The newly selected fabrication part may have badly configured dimensions, resulting in bad geometry.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId FabricationPartCannotChangeTypeBadDimUnConnError { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property FabricationPartCannotChangeTypeBadDimUnConnError As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ FabricationPartCannotChangeTypeBadDimUnConnError { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures MEPFabricationFailures Class

Autodesk.Revit.DB Namespace