#### RoomTagFilter Members

---

|  |
| --- |
| RoomTagFilter Class   Constructors   Methods   Properties   See Also |

The  RoomTagFilter  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | RoomTagFilter | Constructs a filter which matches only rooms. |

# Methods

|  | Name | Description |
| --- | --- | --- |

# Properties

|  | Name | Description |
| --- | --- | --- |

# See Also

RoomTagFilter Class

Autodesk.Revit.DB.Architecture Namespace