#### BoundingBoxIsInsideFilter Members

---

|  |
| --- |
| BoundingBoxIsInsideFilter Class   Constructors   Methods   Properties   See Also |

The  BoundingBoxIsInsideFilter  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | BoundingBoxIsInsideFilter(Outline) | Constructs a new instance of a filter to match elements with a bounding box that is contained by the given Outline. |
| Public method | BoundingBoxIsInsideFilter(Outline, Boolean) | Constructs a new instance of a filter to match elements with a bounding box is contained by the given Outline, with the option to invert the filter and match all elements with a bounding box that are not contained by the given Outline. |
| Public method | BoundingBoxIsInsideFilter(Outline, Double) | Constructs a new instance of a filter to match elements with a bounding box that is contained by the given Outline. |
| Public method | BoundingBoxIsInsideFilter(Outline, Double, Boolean) | Constructs a new instance of a filter to match elements with a bounding box is contained by the given Outline, with the option to invert the filter and match all elements with a bounding box that are not contained by the given Outline. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | GetBoundingBox | Gets the outline being used for this filter. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Tolerance | Allows control over the match criteria by using a tolerance in the geometry comparison. It is suggested to use this in cases where trivial differences should be considered when matching elements. |

# See Also

BoundingBoxIsInsideFilter Class

Autodesk.Revit.DB Namespace