#### SplitButtonData Members

---

|  |
| --- |
| SplitButtonData Class   Constructors   Methods   Properties   See Also |

The  SplitButtonData  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | SplitButtonData | Constructs a new instance of SplitButtonData. |

# Methods

|  | Name | Description |
| --- | --- | --- |

# Properties

|  | Name | Description |
| --- | --- | --- |

# See Also

SplitButtonData Class

Autodesk.Revit.UI Namespace