#### StringParameterValue Members

---

|  |
| --- |
| StringParameterValue Class   Constructors   Methods   Properties   See Also |

The  StringParameterValue  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | StringParameterValue | Default constructor |
| Public method | StringParameterValue(String) | Value constructor |

# Methods

|  | Name | Description |
| --- | --- | --- |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Value | The stored value |

# See Also

StringParameterValue Class

Autodesk.Revit.DB Namespace