#### PromptForFamilyInstancePlacementOptions Members

---

|  |
| --- |
| PromptForFamilyInstancePlacementOptions Class   Constructors   Methods   Properties   See Also |

The  PromptForFamilyInstancePlacementOptions  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | PromptForFamilyInstancePlacementOptions | Creates a new PromptForFamilyInstancePlacementOptions using default options. |
| Public method | PromptForFamilyInstancePlacementOptions(PromptForFamilyInstancePlacementOptions) | Creates a copy of an existing options object. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  PromptForFamilyInstancePlacementOptions |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | FaceBasedPlacementType | The placement type to be used if prompting to place an instance of a face-based family. This option is ignored if placing a non-face-based family. If placing a face-based family, Default is an acceptable value, but will correspond to the first available selection in the user interface. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | PlaceAirTerminalOnDuct | If true, when placing an air terminal, the terminal will be placed directly on the duct without fittings. If fase, the terminal will be placed with generated fittings. |
| Public property | SketchGalleryOptions | The sketch option provided when promt to place a family instance. |

# See Also

PromptForFamilyInstancePlacementOptions Class

Autodesk.Revit.UI Namespace