#### DockablePaneState Members

---

|  |
| --- |
| DockablePaneState Class   Constructors   Methods   Properties   See Also |

The  DockablePaneState  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | DockablePaneState | Creates a new DockablePaneState object. |
| Public method | DockablePaneState(DockablePaneState) | Constructs a new copy of the input DockablePaneState object. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  DockablePaneState |
| Public method | SetFloatingRectangle | When %dockPosition% is Floating, sets the rectangle used to determine the size and position of the pane when %dockPosition% is Floating. Coordinates are relative to the upper-left-hand corner of the main Revit window. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | DockPosition | Which part of the Revit application frame the pane should dock to. |
| Public property | FloatingRectangle | When %dockPosition% is Floating, this rectangle determines the size and position of the pane. Coordinates are relative to the upper-left-hand corner of the main Revit window. Note: the returned Rectangle is a copy. In order to change the pane state, you must call SetFloatingRectangle with a modified rectangle. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | MinimumHeight | When %dockPosition% is anything other than floating, the minimum height to use for the pane. Default is 200 pixels. |
| Public property | MinimumWidth | When %dockPosition% is anything other than floating, the minimum width to use for the pane. Default is 200 pixels. |
| Public property | TabBehind | Ignored unless %dockPosition% is Tabbed. The new pane will appear in a tab behind the specified existing pane ID. |

# See Also

DockablePaneState Class

Autodesk.Revit.UI Namespace