#### EditorInteraction Members

---

|  |
| --- |
| EditorInteraction Class   Constructors   Methods   Properties   See Also |

The  EditorInteraction  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | EditorInteraction | Construct a default interaction. |
| Public method | EditorInteraction(EditorInteractionType) | Construct the interaction with the specified type. |

# Methods

|  | Name | Description |
| --- | --- | --- |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | InteractionType | The type of interaction. |

# See Also

EditorInteraction Class

Autodesk.Revit.UI Namespace