#### StructuralSectionIWideFlange Members

---

|  |
| --- |
| StructuralSectionIWideFlange Class   Constructors   Methods   Properties   See Also |

The  StructuralSectionIWideFlange  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | StructuralSectionIWideFlange | Creates a new instance of Structural Section I Wide Flange shape with the associated set of parameters, used to attach to structural element. |

# Methods

|  | Name | Description |
| --- | --- | --- |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | BoltDiameter | Maximum bolt hole diameter, in. (mm) |
| Public property | BoltSpacing | Standard bolt spacing, in. (mm) |
| Public property | BoltSpacingBetweenRows | Standard bolt spacing between rows, in. (mm) |
| Public property | BoltSpacingTwoRows | Standard bolt spacing for two rows , in. (mm) |
| Public property | ClearWebHeight | Detailing depth between the web toes of the fillets, in.(mm) |
| Public property | FlangeToeOfFillet | Detailing distance from center of web to flange toe of fillet, in. (mm) |
| Public property | WebToeOfFillet | Detailing distance from outer face of flange to web toe of fillet, in. (mm) |

# See Also

StructuralSectionIWideFlange Class

Autodesk.Revit.DB.Structure.StructuralSections Namespace