#### RoomFilter Members

---

|  |
| --- |
| RoomFilter Class   Constructors   Methods   Properties   See Also |

The  RoomFilter  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | RoomFilter | Constructs a filter which matches only rooms. |

# Methods

|  | Name | Description |
| --- | --- | --- |

# Properties

|  | Name | Description |
| --- | --- | --- |

# See Also

RoomFilter Class

Autodesk.Revit.DB.Architecture Namespace