#### IndexPoint Members

---

|  |
| --- |
| IndexPoint Class   Constructors   Methods   Properties   See Also |

The  IndexPoint  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | IndexPoint | Constructs the point primitive. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | GetSizeInShortInts | Gets the amount of storage that the primitive takes up in a buffer, measured in short integers. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Index | The index of the point's vertex. |

# See Also

IndexPoint Class

Autodesk.Revit.DB.DirectContext3D Namespace