#### ImagePlacementOptions Members

---

|  |
| --- |
| ImagePlacementOptions Class   Constructors   Methods   Properties   See Also |

The  ImagePlacementOptions  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | ImagePlacementOptions | Constructs a new ImagePlacementOptions that will place an  ImageInstance  with its center at the origin of the model |
| Public method | ImagePlacementOptions(XYZ, BoxPlacement) | Constructs a new ImagePlacementOptions for placing an  ImageInstance |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  ImagePlacementOptions |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | Location | The location in the model where a point of the  ImageInstance  , determined by the  PlacementPoint  property, is going to be inserted. |
| Public property | PlacementPoint | Identifies which point of the  ImageInstance  will be aligned to the  Location |

# See Also

ImagePlacementOptions Class

Autodesk.Revit.DB Namespace