#### DockablePaneId Members

---

|  |
| --- |
| DockablePaneId Class   Constructors   Methods   Operators   Properties   See Also |

The  DockablePaneId  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | DockablePaneId | Creates a new DockablePaneId instance. |

# Methods

|  | Name | Description |
| --- | --- | --- |

# Operators

|  | Name | Description |
| --- | --- | --- |
| Public operator Static member | Equality | Compares two DockablePaneId instances. |
| Public operator Static member | Inequality | Compares two DockablePaneId instances. |

# Properties

|  | Name | Description |
| --- | --- | --- |

# See Also

DockablePaneId Class

Autodesk.Revit.UI Namespace