#### DeleteWorksetSettings Members

---

|  |
| --- |
| DeleteWorksetSettings Class   Constructors   Methods   Properties   See Also |

The  DeleteWorksetSettings  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | DeleteWorksetSettings | Constructs a DeleteWorksetSettings object with DeleteWorksetOption::DeleteAllElements option. |
| Public method | DeleteWorksetSettings(DeleteWorksetOption, WorksetId) | Constructs a DeleteWorksetSettings object. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  DeleteWorksetSettings |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | DeleteWorksetOption | The current delete workset option. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | WorksetId | The target worksetId for those elements under the deleted workset, which is used for DeleteWorksetOption::MoveElementsToWorkset. |

# See Also

DeleteWorksetSettings Class

Autodesk.Revit.DB Namespace