#### StructuralSectionSigmaProfile Members

---

|  |
| --- |
| StructuralSectionSigmaProfile Class   Constructors   Methods   Properties   See Also |

The  StructuralSectionSigmaProfile  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | StructuralSectionSigmaProfile | Creates a new instance of Structural Section Sigma Profile shape with the associated set of parameters, used to attach to structural element. |

# Methods

|  | Name | Description |
| --- | --- | --- |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | BendWidth | Bend segment width. |
| Public property | MiddleBendLength | Middle Bend segment length. |
| Public property | TopBendLength | Top Bend segment length. |

# See Also

StructuralSectionSigmaProfile Class

Autodesk.Revit.DB.Structure.StructuralSections Namespace