#### StructuralElementDefinitionData Members

---

|  |
| --- |
| StructuralElementDefinitionData Class   Constructors   Methods   Properties   See Also |

The  StructuralElementDefinitionData  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | StructuralElementDefinitionData | Creates empty StructuralElementDefinitionData object. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  StructuralElementDefinitionData |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | CenterCurve | The curve lying in the geometrical center of the element. |
| Public property | Curve | The definition curve of the element. |
| Public property | EndShortening | Cutback or extension at element curve end. |
| Public property | IsMirrored | States if the structural section of the element is mirrored. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | Normal | The local Z direction of the element section in the start point of the curve. |
| Public property | Section | Structural section of the element. |
| Public property | StartShortening | Cutback or extension at element curve start. |
| Public property | YJust | Y justification (ref axis). |
| Public property | YOffset | Y offset. |
| Public property | ZJust | Z justification (ref axis). |
| Public property | ZOffset | Z offset. |

# See Also

StructuralElementDefinitionData Class

Autodesk.Revit.DB.Structure.StructuralSections Namespace