#### UISaveAsOptions Members

---

|  |
| --- |
| UISaveAsOptions Class   Constructors   Methods   Properties   See Also |

The  UISaveAsOptions  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | UISaveAsOptions | Default constructor. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  UISaveAsOptions |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | ShowOverwriteWarning | Identifies if UI should show an overwrite warning dialog. |

# See Also

UISaveAsOptions Class

Autodesk.Revit.UI Namespace