#### FilterNumericLess Members

---

|  |
| --- |
| FilterNumericLess Class   Constructors   Methods   Properties   See Also |

The  FilterNumericLess  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | FilterNumericLess | Constructs an instance of FilterNumericLess. |

# Methods

|  | Name | Description |
| --- | --- | --- |

# Properties

|  | Name | Description |
| --- | --- | --- |

# See Also

FilterNumericLess Class

Autodesk.Revit.DB Namespace