#### PointCloudColorSettings Members

---

|  |
| --- |
| PointCloudColorSettings Class   Constructors   Methods   Properties   See Also |

The  PointCloudColorSettings  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | PointCloudColorSettings | Constructs color settings object with default colors. |
| Public method | PointCloudColorSettings(PointCloudColorMode) | Constructs color settings object with default color for given color mode. |
| Public method | PointCloudColorSettings(PointCloudColorSettings) | Constructs a copy of source object. |
| Public method | PointCloudColorSettings(Color, Color) | Constructs color settings object from given colors. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Assign | Assigns values of the source settings to this object. |
| Public method | Dispose | Releases all resources used by the  PointCloudColorSettings |
| Public method | IsEqual | Check if the contents of two settings are equal. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Color1 | Color 1 |
| Public property | Color2 | Color 2 |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

PointCloudColorSettings Class

Autodesk.Revit.DB.PointClouds Namespace