#### FilterNumericEquals Members

---

|  |
| --- |
| FilterNumericEquals Class   Constructors   Methods   Properties   See Also |

The  FilterNumericEquals  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | FilterNumericEquals | Constructs an instance of FilterNumericEquals. |

# Methods

|  | Name | Description |
| --- | --- | --- |

# Properties

|  | Name | Description |
| --- | --- | --- |

# See Also

FilterNumericEquals Class

Autodesk.Revit.DB Namespace