#### ColorSelectionDialog Members

---

|  |
| --- |
| ColorSelectionDialog Class   Constructors   Methods   Properties   See Also |

The  ColorSelectionDialog  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | ColorSelectionDialog | Default constructor. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  ColorSelectionDialog |
| Public method | Show | Shows the Revit Color dialog as a modal dialog. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | OriginalColor | The original color. |
| Public property | SelectedColor | The new color selected by the user. |

# See Also

ColorSelectionDialog Class

Autodesk.Revit.UI Namespace