#### ApplicationEntryPoint Members

---

|  |
| --- |
| ApplicationEntryPoint Class   Constructors   Methods   Properties   Events   See Also |

The  ApplicationEntryPoint  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | ApplicationEntryPoint | Initializes a new instance of the  ApplicationEntryPoint  class |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | CreateRibbonPanel(String) | (Overrides  UIApplication CreateRibbonPanel(String)  .) |
| Public method | CreateRibbonPanel(String, String) | (Overrides  UIApplication CreateRibbonPanel(String, String)  .) |
| Public method | CreateRibbonPanel(Tab, String) | (Overrides  UIApplication CreateRibbonPanel(Tab, String)  .) |
| Public method | CreateRibbonTab | (Overrides  UIApplication CreateRibbonTab(String)  .) |
| Public method | FinishInitializationEO | For Revit Macros internal use only. |
| Public method | GetRibbonPanels | (Overrides  UIApplication GetRibbonPanels  .) |
| Public method | GetRibbonPanels(String) | (Overrides  UIApplication GetRibbonPanels(String)  .) |
| Public method | GetRibbonPanels(Tab) | (Overrides  UIApplication GetRibbonPanels(Tab)  .) |
| Public method | Initialize | For Revit Macros internal use only. |
| Public method | OnShutdownEO | For Revit Macros internal use only. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | AddinFolder | The full path to the Revit Macros module. |

# Events

|  | Name | Description |
| --- | --- | --- |

# See Also

ApplicationEntryPoint Class

Autodesk.Revit.UI.Macros Namespace