#### StructuralSectionGeneralR Members

---

|  |
| --- |
| StructuralSectionGeneralR Class   Constructors   Methods   Properties   See Also |

The  StructuralSectionGeneralR  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | StructuralSectionGeneralR | Creates a new instance of Structural Section Pipe. |

# Methods

|  | Name | Description |
| --- | --- | --- |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | WallDesignThickness | Represents wall design thickness of rectangle. |
| Public property | WallNominalThickness | Represents wall nominal thickness of rectangle. |

# See Also

StructuralSectionGeneralR Class

Autodesk.Revit.DB.Structure.StructuralSections Namespace