#### PrimaryDesignOptionMemberFilter Members

---

|  |
| --- |
| PrimaryDesignOptionMemberFilter Class   Constructors   Methods   Properties   See Also |

The  PrimaryDesignOptionMemberFilter  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | PrimaryDesignOptionMemberFilter | Constructs a new instance of a filter to match elements contained in any primary design option of any design option set. |
| Public method | PrimaryDesignOptionMemberFilter(Boolean) | Constructs a new instance of a filter to match elements contained in any primary design option of any design option set, with the option to invert the filter and find elements not contained in any primary design option of any design option set. |

# Methods

|  | Name | Description |
| --- | --- | --- |

# Properties

|  | Name | Description |
| --- | --- | --- |

# See Also

PrimaryDesignOptionMemberFilter Class

Autodesk.Revit.DB Namespace