#### ExportLinetypeInfo Members

---

|  |
| --- |
| ExportLinetypeInfo Class   Constructors   Methods   Properties   See Also |

The  ExportLinetypeInfo  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | ExportLinetypeInfo | Constructs a new default ExportLinetypeInfo. |
| Public method | ExportLinetypeInfo(String) | Constructs a new ExportLinetypeInfo using the destination linetype name as input. |
| Public method | ExportLinetypeInfo(ExportLinetypeInfo) | Constructs a new copy of the input ExportLinetypeInfo object. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  ExportLinetypeInfo |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | DestinationLinetypeName | The destination linetype name (the name of the linetype in the exported format). |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

ExportLinetypeInfo Class

Autodesk.Revit.DB Namespace