#### VertexIndexPair Members

---

|  |
| --- |
| VertexIndexPair Class   Constructors   Methods   Properties   See Also |

The  VertexIndexPair  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | VertexIndexPair | Initializes a new instance of the  VertexIndexPair  class |

# Methods

|  | Name | Description |
| --- | --- | --- |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Bottom | The index of the vertex pair from the bottom profile. |
| Public property | Top | The index of the vertex pair from the top profile. |

# See Also

VertexIndexPair Class

Autodesk.Revit.DB Namespace