#### StructuralSectionAnalysisParams Members

---

|  |
| --- |
| StructuralSectionAnalysisParams Class   Constructors   Methods   Properties   See Also |

The  StructuralSectionAnalysisParams  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | StructuralSectionAnalysisParams | Creates a new instance of StructuralSectionAnalysisParams. |
| Public method | StructuralSectionAnalysisParams(Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double) | Creates a new instance of StructuralSectionAnalysisParams. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  StructuralSectionAnalysisParams |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | ElasticModulusStrongAxis | Elastic section modulus about main strong axis for calculation of bending stresses. |
| Public property | ElasticModulusWeakAxis | Elastic section modulus about main weak axis for calculation of bending stresses. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | MomentOfInertiaStrongAxis | Moment of Inertia about main strong axis (I). |
| Public property | MomentOfInertiaWeakAxis | Moment of Inertia about main weak axis (I). |
| Public property | NominalWeight | Unit weight (not mass) per unit length, for self-weight calculation or quantity survey. |
| Public property | Perimeter | Painting surface of the unit length. |
| Public property | PlasticModulusStrongAxis | Plastic section modulus in bending about main strong axis (Z, Wpl) |
| Public property | PlasticModulusWeakAxis | Plastic section modulus in bending about main weak axis. |
| Public property | PrincipalAxesAngle | Rotation angle between the principal axes and cross section reference planes. |
| Public property | SectionArea | Cross section area. |
| Public property | ShearAreaStrongAxis | Shear area (reduced extreme shear stress coefficient) in the direction of strong axis (Wq). |
| Public property | ShearAreaWeakAxis | Shear area (reduced extreme shear stress coefficient) in the direction of weak axis (Wq). |
| Public property | TorsionalModulus | Section modulus for calculations of torsion stresses (Ct) |
| Public property | TorsionalMomentOfInertia | Torsional Moment of inertia (J, IT, K), for calculation of torsional deformation |
| Public property | WarpingConstant | Warping constant (Cw, Iomega, H) |

# See Also

StructuralSectionAnalysisParams Class

Autodesk.Revit.DB.Structure.StructuralSections Namespace