#### ExternallyTaggedNonBRep Members

---

|  |
| --- |
| ExternallyTaggedNonBRep Class   Constructors   Methods   Properties   See Also |

The  ExternallyTaggedNonBRep  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | ExternallyTaggedNonBRep | Constructs an ExternallyTaggedGeometryObject associating a given ExternalGeometryId with a particular GeometryObject. |

# Methods

|  | Name | Description |
| --- | --- | --- |

# Properties

|  | Name | Description |
| --- | --- | --- |

# See Also

ExternallyTaggedNonBRep Class

Autodesk.Revit.DB Namespace