#### FilePath Members

---

|  |
| --- |
| FilePath Class   Constructors   Methods   Properties   See Also |

The  FilePath  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | FilePath | Constructs a FilePath |

# Methods

|  | Name | Description |
| --- | --- | --- |

# Properties

|  | Name | Description |
| --- | --- | --- |

# See Also

FilePath Class

Autodesk.Revit.DB Namespace