#### KeynoteEntry Members

---

|  |
| --- |
| KeynoteEntry Class   Constructors   Methods   Properties   See Also |

The  KeynoteEntry  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | KeynoteEntry(String, String) | Constructs a new KeynoteEntry from the given key name and keynote text. KeynoteEntry objects created from this constructor will not have parents. |
| Public method | KeynoteEntry(String, String, String) | Constructs a new KeynoteEntry from the given key name, parent key name, and keynote text. |

# Methods

|  | Name | Description |
| --- | --- | --- |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | KeynoteText | The text associated with this KeynoteEntry. |

# See Also

KeynoteEntry Class

Autodesk.Revit.DB Namespace