#### FluidTemperature Members

---

|  |
| --- |
| FluidTemperature Class   Constructors   Methods   Properties   See Also |

The  FluidTemperature  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | FluidTemperature | Creates a new fluid temperature with given temperature, dynamic viscosity and density. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  FluidTemperature |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Density | The density value |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | Temperature | The temperature value |
| Public property | Viscosity | The dynamic viscosity value |

# See Also

FluidTemperature Class

Autodesk.Revit.DB.Plumbing Namespace