#### StructuralSectionSigmaProfileWithFold Members

---

|  |
| --- |
| StructuralSectionSigmaProfileWithFold Class   Constructors   Methods   Properties   See Also |

The  StructuralSectionSigmaProfileWithFold  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | StructuralSectionSigmaProfileWithFold | Creates a new instance of Structural Section Sigma Profile With Fold shape with the associated set of parameters, used to attach to structural element. |

# Methods

|  | Name | Description |
| --- | --- | --- |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | BendWidth | Bend segment width. |
| Public property | FoldWidth | Fold segment width. |
| Public property | LipLength | Lip segment length. |
| Public property | MiddleBendLength | Middle Bend segment length. |
| Public property | TopBendLength | Top Bend segment length. |

# See Also

StructuralSectionSigmaProfileWithFold Class

Autodesk.Revit.DB.Structure.StructuralSections Namespace