#### BRepBuilderGeometryId Members

---

|  |
| --- |
| BRepBuilderGeometryId Class   Constructors   Methods   Properties   See Also |

The  BRepBuilderGeometryId  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | BRepBuilderGeometryId | Copy constructor |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  BRepBuilderGeometryId |
| Public method Static member | InvalidGeometryId | Returns an invalid BRepBuilderGeometryId, used as a return value to indicate an error. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

BRepBuilderGeometryId Class

Autodesk.Revit.DB Namespace