#### LoadComponent Members

---

|  |
| --- |
| LoadComponent Class   Constructors   Methods   Properties   See Also |

The  LoadComponent  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | LoadComponent | Constructs a new instance of a LoadComponent. The load case or combination id. The load case or combination factor. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  LoadComponent |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Factor | Load component factor. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | LoadCaseOrCombinationId | Load case or combination id. |

# See Also

LoadComponent Class

Autodesk.Revit.DB.Structure Namespace