#### StructuralSectionIParallelFlange Members

---

|  |
| --- |
| StructuralSectionIParallelFlange Class   Constructors   Methods   Properties   See Also |

The  StructuralSectionIParallelFlange  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | StructuralSectionIParallelFlange | Creates a new instance of Structural Section I Parallel Flange shape with the associated set of parameters, used to attach to structural element. |

# Methods

|  | Name | Description |
| --- | --- | --- |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | BoltDiameter | Maximum bolt hole diameter, in. (mm) |
| Public property | BoltSpacing | Standard bolt spacing, in. (mm) |
| Public property | ClearWebHeight | Detailing depth between the web toes of the fillets, in.(mm) |

# See Also

StructuralSectionIParallelFlange Class

Autodesk.Revit.DB.Structure.StructuralSections Namespace