#### FilterInverseRule Members

---

|  |
| --- |
| FilterInverseRule Class   Constructors   Methods   Properties   See Also |

The  FilterInverseRule  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | FilterInverseRule | Constructs a new instance of FilterInverseRule. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | GetInnerRule | Gets the rule being inverted. |
| Public method | SetInnerRule | Gets the rule being inverted. |

# Properties

|  | Name | Description |
| --- | --- | --- |

# See Also

FilterInverseRule Class

Autodesk.Revit.DB Namespace