#### PrimarySizeCriterion Members

---

|  |
| --- |
| PrimarySizeCriterion Class   Constructors   Methods   Properties   See Also |

The  PrimarySizeCriterion  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | PrimarySizeCriterion | Constructs a PrimarySizeCriterion with a minimum and maximum size. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | All | Creates a criterion with a range of all sizes. |
| Public method Static member | None | Creates a criterion with a range of no sizes. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | MaximumSize | The maximum size of this criterion. |
| Public property | MinimumSize | The minimum size of this criterion. |

# See Also

PrimarySizeCriterion Class

Autodesk.Revit.DB Namespace