#### VectorAtPoint Members

---

|  |
| --- |
| VectorAtPoint Class   Constructors   Methods   Properties   See Also |

The  VectorAtPoint  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | VectorAtPoint(VectorAtPoint) | Creates a copy of the given VectorAtPoint instance. |
| Public method | VectorAtPoint(IList XYZ ) | Creates object from an array of vectors |

# Methods

|  | Name | Description |
| --- | --- | --- |

# Properties

|  | Name | Description |
| --- | --- | --- |

# See Also

VectorAtPoint Class

Autodesk.Revit.DB.Analysis Namespace