#### ExternalServiceId Members

---

|  |
| --- |
| ExternalServiceId Class   Constructors   Methods   Operators   Properties   See Also |

The  ExternalServiceId  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | ExternalServiceId | Creates a new ExternalServiceId instance. |

# Methods

|  | Name | Description |
| --- | --- | --- |

# Operators

|  | Name | Description |
| --- | --- | --- |
| Public operator Static member | Equality | Compares two ExternalServiceId instances. |
| Public operator Static member | Inequality | Compares two ExternalServiceId instances. |

# Properties

|  | Name | Description |
| --- | --- | --- |

# See Also

ExternalServiceId Class

Autodesk.Revit.DB.ExternalService Namespace