#### StructuralSectionConcreteT Members

---

|  |
| --- |
| StructuralSectionConcreteT Class   Constructors   Methods   Properties   See Also |

The  StructuralSectionConcreteT  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | StructuralSectionConcreteT | Creates a new instance of Structural Section Concrete T shape with the associated set of parameters, used to attach to structural element. |

# Methods

|  | Name | Description |
| --- | --- | --- |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | CantileverHeight | Flange cantilever thickness. |
| Public property | CantileverLength | Flange cantilever length. |

# See Also

StructuralSectionConcreteT Class

Autodesk.Revit.DB.Structure.StructuralSections Namespace