#### MemberForces Members

---

|  |
| --- |
| MemberForces Class   Constructors   Methods   Properties   See Also |

The  MemberForces  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | MemberForces | Creates a new instance of MemberForces. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  MemberForces |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Force | The translational forces at relative point position of the element. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | Moment | The rotational forces at relative point position of the element. |
| Public property | Start | Member Forces position on analytical element. True for start, false for end. |

# See Also

MemberForces Class

Autodesk.Revit.DB.Structure Namespace