#### StructuralSectionGeneralU Members

---

|  |
| --- |
| StructuralSectionGeneralU Class   Constructors   Methods   Properties   See Also |

The  StructuralSectionGeneralU  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | StructuralSectionGeneralU | Creates a new instance of general Channel shape. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | GetFlangeThicknessInFlangeCenter | Returns thickness of flange measured in the 0.5 \* (width - webThickess), sometimes used for sections with width > 300 mm. |
| Public method | GetFlangeThicknessInWidthCenter | Returns thickness of flange measured in the 0.5 \* width, sometimes used for sections with width <= 300 mm. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | FlangeFillet | Flange Fillet - fillet radius at the flange end. |
| Public property | FlangeToeOfFillet | Detailing distance from center of web to flange toe of fillet, in. (mm) |
| Public property | SlopedFlangeAngle | Sloped flange angle. (rad) |
| Public property | WebToeOfFillet | Detailing distance from outer face of flange to web toe of fillet, in. (mm) |

# See Also

StructuralSectionGeneralU Class

Autodesk.Revit.DB.Structure.StructuralSections Namespace