#### StructuralSectionStructuralTees Members

---

|  |
| --- |
| StructuralSectionStructuralTees Class   Constructors   Methods   Properties   See Also |

The  StructuralSectionStructuralTees  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | StructuralSectionStructuralTees | Creates a new instance of Structural Section Tees shape with the associated set of parameters, used to attach to structural element. |

# Methods

|  | Name | Description |
| --- | --- | --- |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | BoltDiameter | Maximum bolt hole diameter, in. (mm) |
| Public property | BoltSpacing | Standard bolt spacing in the flange, in. (mm) |
| Public property | BoltSpacingWeb | Standard bolt spacing in the web, in. (mm) |

# See Also

StructuralSectionStructuralTees Class

Autodesk.Revit.DB.Structure.StructuralSections Namespace