#### ExternalGeometryId Members

---

|  |
| --- |
| ExternalGeometryId Class   Constructors   Methods   Operators   Properties   See Also |

The  ExternalGeometryId  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | ExternalGeometryId | Constructs an ExternalGeometryId object holding the given external geometry identifier. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  ExternalGeometryId |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Overrides  Object Equals(Object)  .) |
| Public method | GetHashCode | Gets the hash code. (Overrides  Object GetHashCode  .) |
| Public method Static member | IsValidExternalGeometryId | Checks whether a given string represents a valid ExternalGeometryId or not. |

# Operators

|  | Name | Description |
| --- | --- | --- |
| Public operator Static member | Equality | Determines whether two ExternalGeometryIds are the same. |
| Public operator Static member | Inequality | Determines whether two ExternalGeometryIds are different. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Id | External geometry identifier. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

ExternalGeometryId Class

Autodesk.Revit.DB Namespace