#### GBXMLImportOptions Members

---

|  |
| --- |
| GBXMLImportOptions Class   Constructors   Methods   See Also |

The  GBXMLImportOptions  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | GBXMLImportOptions | Default constructor. Sets all options to their default values. |

# Methods

|  | Name | Description |
| --- | --- | --- |

# See Also

GBXMLImportOptions Class

Autodesk.Revit.DB Namespace