#### FilterNumericGreater Members

---

|  |
| --- |
| FilterNumericGreater Class   Constructors   Methods   Properties   See Also |

The  FilterNumericGreater  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | FilterNumericGreater | Constructs an instance of FilterNumericGreater. |

# Methods

|  | Name | Description |
| --- | --- | --- |

# Properties

|  | Name | Description |
| --- | --- | --- |

# See Also

FilterNumericGreater Class

Autodesk.Revit.DB Namespace