#### FailureDefinitionId Members

---

|  |
| --- |
| FailureDefinitionId Class   Constructors   Methods   Operators   Properties   See Also |

The  FailureDefinitionId  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | FailureDefinitionId | Creates a new FailureDefinitionId instance. |

# Methods

|  | Name | Description |
| --- | --- | --- |

# Operators

|  | Name | Description |
| --- | --- | --- |
| Public operator Static member | Equality | Compares two FailureDefinitionId instances. |
| Public operator Static member | Inequality | Compares two FailureDefinitionId instances. |

# Properties

|  | Name | Description |
| --- | --- | --- |

# See Also

FailureDefinitionId Class

Autodesk.Revit.DB Namespace