#### GuidEnum Members

---

|  |
| --- |
| GuidEnum Class   Constructors   Methods   Properties   See Also |

The  GuidEnum  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | GuidEnum | Creates an Guid-based enum instance with the supplied name and GUID. GUID-based enum instance can be compared by this guid value. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Equals | Compares two Guid-based enum object based on their concrete class and GUID value. (Overrides  Object Equals(Object)  .) |
| Public method | GetHashCode | Generates a hash code for this Guid-based enum object. (Overrides  Object GetHashCode  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Guid | The Guid of GUID-based enum object. |

# See Also

GuidEnum Class

Autodesk.Revit.DB Namespace