#### Arc Members

---

|  |
| --- |
| Arc Class   Methods   Properties   See Also |

The  Arc  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create(XYZ, XYZ, XYZ) | Creates a new geometric arc object based on three points. |
| Public method Static member | Create(Plane, Double, Double, Double) | Creates a new geometric arc object based on plane, radius, and angles. |
| Public method Static member | Create(XYZ, Double, Double, Double, XYZ, XYZ) | Creates a new geometric arc object based on center, radius, unit vectors, and angles. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Center | Returns the center of the arc. |
| Public property | Normal | Returns the normal to the plane in which the arc is defined. |
| Public property | Radius | Returns the radius of the arc. |
| Public property | XDirection | Returns the X direction. |
| Public property | YDirection | Returns the Y direction. |

# See Also

Arc Class

Autodesk.Revit.DB Namespace