#### StructuralSectionsServiceData Members

---

|  |
| --- |
| StructuralSectionsServiceData Class   Methods   Properties   See Also |

The  StructuralSectionsServiceData  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  StructuralSectionsServiceData |
| Public method | GetCurrentElements | Returns the list of Ids of the current elements. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Document | The current document. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

StructuralSectionsServiceData Class

Autodesk.Revit.DB.Structure Namespace