#### ExternalDataInstanceAddedIntoDocumentEventArgs Members

---

|  |
| --- |
| ExternalDataInstanceAddedIntoDocumentEventArgs Class   Methods   Properties   See Also |

The  ExternalDataInstanceAddedIntoDocumentEventArgs  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | ItemId | The id of the external data item to which a new reference has been added. |
| Public property | NewInstanceId | The newly added external data instance id. |
| Public property | ProjectId | The id of the external project of the external data item to which a new reference has been added. |
| Public property | TypeId | The type id of the newly added external data instance id. |

# See Also

ExternalDataInstanceAddedIntoDocumentEventArgs Class

Autodesk.Revit.DB.Events Namespace