#### IFCTransformSetter Members

---

|  |
| --- |
| IFCTransformSetter Class   Methods   Properties   See Also |

The  IFCTransformSetter  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create | Creates a new instance of a transform setter. |
| Public method | Dispose | Releases all resources used by the  IFCTransformSetter |
| Public method | Initialize | Initializes the transformation in the transform setter. |
| Public method | InitializeFromBoundingBox |  |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

IFCTransformSetter Class

Autodesk.Revit.DB.IFC Namespace