#### DialogBoxShowingEventArgs Members

---

|  |
| --- |
| DialogBoxShowingEventArgs Class   Methods   Properties   See Also |

The  DialogBoxShowingEventArgs  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | OverrideResult | Call this method to cause the Autodesk Revit dialog to be dismissed with the specified return value. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | DialogId | A unique string identifier for DialogBox and TaskDialog type dialogs in Revit. |

# See Also

DialogBoxShowingEventArgs Class

Autodesk.Revit.UI.Events Namespace