#### PipeScheduleType Members

---

|  |
| --- |
| PipeScheduleType Class   Methods   Properties   See Also |

The  PipeScheduleType  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create | Creates a new pipe schedule type with the given name. |
| Public method Static member | GetPipeScheduleId | Returns an existing pipe schedule type with the same name. |

# Properties

|  | Name | Description |
| --- | --- | --- |

# See Also

PipeScheduleType Class

Autodesk.Revit.DB.Plumbing Namespace