#### Floor Members

---

|  |
| --- |
| Floor Class   Methods   Properties   See Also |

The  Floor  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create(Document, IList CurveLoop , ElementId, ElementId) | Creates a new instance of architectural floor within the project. |
| Public method Static member | Create(Document, IList CurveLoop , ElementId, ElementId, Boolean, Line, Double) | Creates a new instance of floor within the project. |
| Public method Static member | GetDefaultFloorType | Returns id of default floor type. |
| Public method | GetNormalAtVerticalProjectionPoint | Return a surface normal on either the top or bottom face of a floor slab at a point corresponding to the vertical projection of an arbitrary point in project space. |
| Public method | GetSpanDirectionSymbolIds | Retrieves span direction symbol ElementIds. |
| Public method | GetVerticalProjectionPoint | Return a surface point on either the top or bottom face of a floor slab corresponding to the vertical projection of an arbitrary point in project space. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | FloorType | Retrieves/sets an object that represents the type of the floor. |
| Public property | SketchId | Returns id of the sketch. |
| Public property | SlabShapeEditor | Get the SlabShapeEditor used for slab shape editing. |
| Public property | SpanDirectionAngle | Retrieve the span direction angle of the floor. |

# See Also

Floor Class

Autodesk.Revit.DB Namespace