#### ViewExportingEventArgs Members

---

|  |
| --- |
| ViewExportingEventArgs Class   Methods   Properties   See Also |

The  ViewExportingEventArgs  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | ViewId | Identifies the view about to be exported. |

# See Also

ViewExportingEventArgs Class

Autodesk.Revit.DB.Events Namespace