#### CentralModelContentionException Members

---

|  |
| --- |
| CentralModelContentionException Class   Methods   Properties   See Also |

The  CentralModelContentionException  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | GetObjectData | Retrieves data needed to serialize the target object. (Overrides  CentralModelException GetObjectData(SerializationInfo, StreamingContext)  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | CurrentUser | Retrieves current user name. |

# See Also

CentralModelContentionException Class

Autodesk.Revit.Exceptions Namespace