#### FillPatternElement Members

---

|  |
| --- |
| FillPatternElement Class   Methods   Properties   See Also |

The  FillPatternElement  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create | Creates a new FillPatternElement. |
| Public method | GetFillPattern | Gets the FillPattern associated to this element. |
| Public method Static member | GetFillPatternElementByName | Retrieves the FillPatternElement by its name. |
| Public method | SetFillPattern | Sets the FillPattern associated to this element. |

# Properties

|  | Name | Description |
| --- | --- | --- |

# See Also

FillPatternElement Class

Autodesk.Revit.DB Namespace