#### WireConduitType Members

---

|  |
| --- |
| WireConduitType Class   Methods   Properties   See Also |

The  WireConduitType  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Name |  |

# See Also

WireConduitType Class

Autodesk.Revit.DB.Electrical Namespace