#### DisplacementPath Members

---

|  |
| --- |
| DisplacementPath Class   Methods   Properties   See Also |

The  DisplacementPath  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create | Creates a new DisplacementPath referencing a DisplacementElement and edge or curve and adds it to the document. |
| Public method Static member | IsValidParam | Is the specified value a valid edge or curve parameter. |
| Public method Static member | IsValidReference | Does the specified pick represent an edge or a curve belonging to one of the displaced elements. |
| Public method | SetAnchorPoint | Sets the reference that determines the origin of this DisplacementPath. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | AncestorIdx | Specifies the end point of the path. |
| Public property | PathStyle | Specifies the style of the path. |

# See Also

DisplacementPath Class

Autodesk.Revit.DB Namespace