#### StructuralConnectionHandlerType Members

---

|  |
| --- |
| StructuralConnectionHandlerType Class   Methods   Properties   See Also |

The  StructuralConnectionHandlerType  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | AddElementsToCustomConnection | Modifies StructuralConnectionHandlerType of input StructuralConnectionHandler by adding representors of input elements or subelements. |
| Public method Static member | Create(Document, String, Guid, String) | Creates a new StructuralConnectionHandlerType object. |
| Public method Static member | Create(Document, String, Guid, String, ElementId) | Creates a new StructuralConnectionHandlerType object. |
| Public method Static member | Create(Document, String, Guid, String, ElementId, IList ConnectionInputPointInfo ) | Creates a new StructuralConnectionHandlerType object. |
| Public method Static member | CreateDefaultStructuralConnectionHandlerType | Creates a new StructuralConnectionHandlerType object with a default name. |
| Public method Static member | FindGenericConnectionType | Finds StructuralConnectionHandlerType which is Generic Connection type. |
| Public method Static member | GetDefaultConnectionHandlerType | Gets a default type id for Structural Connection. |
| Public method | IsCustom | Checks if StructuralConnectionHandlerType is custom. |
| Public method | IsDetailed | Checks if StructuralConnectionHandlerType is detailed. |
| Public method | IsGeneric | Checks if StructuralConnectionHandlerType is generic. |
| Public method Static member | IsTypeNameValidForCustomConnection | Validates if the input name matches the criteria of StructuralConnectionHandlerType name. Name must be unique among other existing StructuralConnectionHandlerTypes and cannot contain any of the following characters: new line, {}[];`~\\/:\*?";<>| or any of the non-printable characters. |
| Public method Static member | RemoveMainSubelementsFromCustomConnection | Removes one or more subelements from a StructuralConnectionHandlerType. The subelements will be erased. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | ConnectionGuid | The GUID to use for identifying connection geometry generation algorithm. |

# See Also

StructuralConnectionHandlerType Class

Autodesk.Revit.DB.Structure Namespace