#### AnalyticalSurfaceBase Members

---

|  |
| --- |
| AnalyticalSurfaceBase Class   Methods   Properties   See Also |

The  AnalyticalSurfaceBase  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | GetOuterContour | Returns the Curve Loop that defines the geometry of the Analytical Surface element. |
| Public method Static member | IsCurveLoopValid | Checks if curve loop is valid for Analytical Panel. |
| Public method | SetOuterContour | Sets the Curve Loop that defines the geometry of the Analytical Surface element. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | SketchId | Sketch associated to this Revit element. |

# See Also

AnalyticalSurfaceBase Class

Autodesk.Revit.DB.Structure Namespace