#### StructuralSection Members

---

|  |
| --- |
| StructuralSection Class   Methods   Properties   See Also |

The  StructuralSection  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  StructuralSection |
| Public method | GetBoundarySize | Returns size of the section boundary. |
| Public method | GetEnumerator |  |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | AnalysisParams | Common set of parameters for structural analysis. |
| Public property | ElasticModulusStrongAxis | Elastic section modulus about main strong axis for calculation of bending stresses. |
| Public property | ElasticModulusWeakAxis | Elastic section modulus about main weak axis for calculation of bending stresses. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | MomentOfInertiaStrongAxis | Moment of Inertia about main strong axis (I). |
| Public property | MomentOfInertiaWeakAxis | Moment of Inertia about main weak axis (I). |
| Public property | NominalWeight | Unit weight (not mass) per unit length, for self-weight calculation or quantity survey. |
| Public property | Perimeter | Painting surface of the unit length. |
| Public property | PlasticModulusStrongAxis | Plastic section modulus in bending about main strong axis (Z, Wpl). |
| Public property | PlasticModulusWeakAxis | Plastic section modulus in bending about main weak axis. |
| Public property | PrincipalAxesAngle | Rotation angle between the principal axes and cross section reference planes. |
| Public property | SectionArea | Cross section area. |
| Public property | SectionNameKey | A parameter in structural families which allows for family type identification. This will be used for data mapping during model exchange with another program, namely Advance Steel. |
| Public property | ShearAreaStrongAxis | Shear area (reduced extreme shear stress coefficient) in the direction of strong axis (Wq). |
| Public property | ShearAreaWeakAxis | Shear area (reduced extreme shear stress coefficient) in the direction of weak axis (Wq). |
| Public property | StructuralSectionGeneralShape | The general type of structural section shape. |
| Public property | StructuralSectionShape | The type of structural section shape. |
| Public property | StructuralSectionShapeName | A human readable string representing the structural section shape. |
| Public property | TorsionalModulus | Section modulus for calculations of torsion stresses (Ct). |
| Public property | TorsionalMomentOfInertia | Torsional Moment of inertia (J, IT, K), for calculation of torsional deformation |
| Public property | WarpingConstant | Warping constant (Cw, Iomega, H). |

# See Also

StructuralSection Class

Autodesk.Revit.DB.Structure.StructuralSections Namespace