#### AssetPropertyUInt64 Members

---

|  |
| --- |
| AssetPropertyUInt64 Class   Methods   Properties   See Also |

The  AssetPropertyUInt64  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Value | Get the value of the property. |

# See Also

AssetPropertyUInt64 Class

Autodesk.Revit.DB.Visual Namespace