#### BackgroundSettings Members

---

|  |
| --- |
| BackgroundSettings Class   Methods   Properties   See Also |

The  BackgroundSettings  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  BackgroundSettings |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

BackgroundSettings Class

Autodesk.Revit.DB Namespace