#### AreaScheme Members

---

|  |
| --- |
| AreaScheme Class   Methods   Properties   See Also |

The  AreaScheme  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsGrossBuildingArea | Indicates if the area scheme is a Gross Building Area scheme. |

# See Also

AreaScheme Class

Autodesk.Revit.DB Namespace