#### SelectionChangedEventArgs Members

---

|  |
| --- |
| SelectionChangedEventArgs Class   Methods   Properties   See Also |

The  SelectionChangedEventArgs  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | GetDocument | Returns the document associated with this event. |
| Public method | GetReferences | Returns the references that are currently selected. |
| Public method | GetSelectedElements | Returns ElementIds of selected elements. |

# Properties

|  | Name | Description |
| --- | --- | --- |

# See Also

SelectionChangedEventArgs Class

Autodesk.Revit.UI.Events Namespace