#### LoadBase Members

---

|  |
| --- |
| LoadBase Class   Methods   Properties   See Also |

The  LoadBase  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | IsOrientToPermitted | Indicates if the provided orientation is permitted for this load. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | HostElementId | The host element ID for the load. |
| Public property | IsHosted | Indicates if the Load is hosted or non-hosted. |
| Public property | IsReaction | The load is reaction option. |
| Public property | LoadCase | The load case for the load. |
| Public property | LoadCaseId | The load case ID for the load. |
| Public property | LoadCaseName | The name of the load case to which this load belongs. |
| Public property | LoadCategoryName | The name of the category to which this load belongs. |
| Public property | LoadNatureName | A string representing the nature of the load. |
| Public property | OrientTo | The load orientation option. |
| Public property | WorkPlaneId | Id of the work plane which may determine the orientation of the load. |

# See Also

LoadBase Class

Autodesk.Revit.DB.Structure Namespace