#### WallFoundation Members

---

|  |
| --- |
| WallFoundation Class   Methods   Properties   See Also |

The  WallFoundation  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create | Creates a new wall foundation within the project. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | WallId | Returns the id of the host wall. |

# See Also

WallFoundation Class

Autodesk.Revit.DB Namespace