#### PipeFittingAndAccessoryPressureDropUIData Members

---

|  |
| --- |
| PipeFittingAndAccessoryPressureDropUIData Class   Methods   Properties   See Also |

The  PipeFittingAndAccessoryPressureDropUIData  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  PipeFittingAndAccessoryPressureDropUIData |
| Public method | GetUIDataItems | Gets all UI data items stored in the UI data. |
| Public method | GetUnits | Gets units. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

PipeFittingAndAccessoryPressureDropUIData Class

Autodesk.Revit.UI.Plumbing Namespace