#### FormulaEditingEventArgs Members

---

|  |
| --- |
| FormulaEditingEventArgs Class   Methods   Properties   See Also |

The  FormulaEditingEventArgs  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Apply | Applies formula to the parameter |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | CurrentDocument | Returns the current document |
| Public property | Formula | Returns text of the formula that will be modified |
| Public property | ParameterId | Returns the Id of the modified parameter |

# See Also

FormulaEditingEventArgs Class

Autodesk.Revit.UI.Events Namespace