#### FabricationPartBrowserChangedEventArgs Members

---

|  |
| --- |
| FabricationPartBrowserChangedEventArgs Class   Methods   Properties   See Also |

The  FabricationPartBrowserChangedEventArgs  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | GetAllSolutionsPartsTypeCounts | Returns the total fabrication part type usage count in all routing solutions. |
| Public method | GetCurrentSolutionPartTypeIds | Returns set of fabrication part types that are used in the currently selected solution. |
| Public method | GetFabricationPartTypeIds | Returns set of fabrication part types in use in the routing solution mode. |
| Public method | GetFilteredSolutionsPartsTypeCounts | Returns the active fabrication part type usage count in fitlered routing solutions. |
| Public method | GetRequiredFabricationPartTypeIds | Returns set of required fabrication part types in use in routing solution mode. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | NumberOfSolutions | The number of active solutions in routing solution mode. |
| Public property | Operation | The operation associated with this event |
| Public property | ServiceId | The identifier for the fabrication service. |

# See Also

FabricationPartBrowserChangedEventArgs Class

Autodesk.Revit.UI.Events Namespace