#### AnalyticalDistributionNodePropertyData Members

---

|  |
| --- |
| AnalyticalDistributionNodePropertyData Class   Methods   Properties   See Also |

The  AnalyticalDistributionNodePropertyData  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  AnalyticalDistributionNodePropertyData |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | NumberOfPhases | The number of phases. |

# See Also

AnalyticalDistributionNodePropertyData Class

Autodesk.Revit.DB.Electrical Namespace