#### AssetPropertyBoolean Members

---

|  |
| --- |
| AssetPropertyBoolean Class   Methods   Properties   See Also |

The  AssetPropertyBoolean  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Value | The value of the property. |

# See Also

AssetPropertyBoolean Class

Autodesk.Revit.DB.Visual Namespace