#### StructuralSectionHotRolled Members

---

|  |
| --- |
| StructuralSectionHotRolled Class   Methods   Properties   See Also |

The  StructuralSectionHotRolled  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | FlangeThickness | Flange Thickness. |
| Public property | FlangeThicknessLocation | Flange Thickness Location. |
| Public property | WebFillet | Web Fillet - fillet radius between web and flange. |
| Public property | WebThickness | Web Thickness. |
| Public property | WebThicknessLocation | Web Thickness Location. |

# See Also

StructuralSectionHotRolled Class

Autodesk.Revit.DB.Structure.StructuralSections Namespace