#### MEPHiddenLineSettings Members

---

|  |
| --- |
| MEPHiddenLineSettings Class   Methods   Properties   See Also |

The  MEPHiddenLineSettings  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | GetMEPHiddenLineSettings | Gets the MEP hidden line settings in the document. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | DrawHiddenLine | Indicates if duct or piping is drawn with the line style and gaps specified for hidden lines. |
| Public property | InsideGap | The gap for the lines that appear within a crossing segment. |
| Public property | LineStyle | The line style that determines how the lines of a hidden segment display at the point where the segments cross. |
| Public property | OutsideGap | The gap for the lines that appear external to the crossing segments. |
| Public property | SingleLineGap | The gap for the single hidden lines where segments cross. |

# See Also

MEPHiddenLineSettings Class

Autodesk.Revit.DB.Mechanical Namespace