#### AssetPropertyInt64 Members

---

|  |
| --- |
| AssetPropertyInt64 Class   Methods   Properties   See Also |

The  AssetPropertyInt64  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Value | Get the value of the property. |

# See Also

AssetPropertyInt64 Class

Autodesk.Revit.DB.Visual Namespace