#### ExecutedEventArgs Members

---

|  |
| --- |
| ExecutedEventArgs Class   Methods   Properties   See Also |

The  ExecutedEventArgs  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | GetJournalData | Gets the journal data associated to this command (on journal playback). |
| Public method | SetJournalData | Sets the journal data associated to this command (on journal playback). |

# Properties

|  | Name | Description |
| --- | --- | --- |

# See Also

ExecutedEventArgs Class

Autodesk.Revit.UI.Events Namespace