#### StructuralSectionRound Members

---

|  |
| --- |
| StructuralSectionRound Class   Methods   Properties   See Also |

The  StructuralSectionRound  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | CentroidHorizontal | Distance from centroid to the left extremites along horizontal axis. |
| Public property | CentroidVertical | Distance from centroid to the upper extremites along vertical axis. |
| Public property | Diameter | Pipe Diameter. |
| Public property | NameKey | Name Key |

# See Also

StructuralSectionRound Class

Autodesk.Revit.DB.Structure.StructuralSections Namespace