#### RebarContainerType Members

---

|  |
| --- |
| RebarContainerType Class   Methods   Properties   See Also |

The  RebarContainerType  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | CreateDefaultRebarContainerType | Creates a new RebarContainerType object with a default name. |
| Public method Static member | GetOrCreateRebarContainerType | Creates or returns a RebarContainerType object with a given name. |

# Properties

|  | Name | Description |
| --- | --- | --- |

# See Also

RebarContainerType Class

Autodesk.Revit.DB.Structure Namespace