#### PropertySetElement Members

---

|  |
| --- |
| PropertySetElement Class   Methods   Properties   See Also |

The  PropertySetElement  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create(Document, StructuralAsset) | Creates a new PropertySetElement to contain the given asset. |
| Public method Static member | Create(Document, ThermalAsset) | Creates a new PropertySetElement to contain the given asset. |
| Public method | Duplicate | Creates a duplicate of this PropertySetElement. |
| Public method | GetStructuralAsset | Gets a copy of the StructuralAsset. |
| Public method | GetThermalAsset | Gets a copy of the ThermalAsset. |
| Public method | SetStructuralAsset | Sets a copy of the given StucturalAsset to be used in the PropertySetElement. |
| Public method | SetThermalAsset | Sets a copy of the given ThermalAsset to be used in the PropertySetElement. |

# Properties

|  | Name | Description |
| --- | --- | --- |

# See Also

PropertySetElement Class

Autodesk.Revit.DB Namespace