#### HVACLoadSpaceType Members

---

|  |
| --- |
| HVACLoadSpaceType Class   Methods   Properties   See Also |

The  HVACLoadSpaceType  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create | Creates a space type. |
| Public method | IsNameUnique(String) | Determines whether a potential space type name is unique. |
| Public method Static member | IsNameUnique(Document, String) | Determines whether a potential space type name is unique. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsPlenum | True if the space type is plenum. |
| Public property | SpaceTypeName | The space type name. |

# See Also

HVACLoadSpaceType Class

Autodesk.Revit.DB.Analysis Namespace