#### TransferredProjectStandardsEventArgs Members

---

|  |
| --- |
| TransferredProjectStandardsEventArgs Class   Methods   Properties   See Also |

The  TransferredProjectStandardsEventArgs  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | GetSelectedExternalItems | Gets the collection of externally added items that the user opted to enable for transfer in the Transfer Project Standards dialog. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | SourceDocument | Source document. |
| Public property | TargetDocument | Target document. |

# See Also

TransferredProjectStandardsEventArgs Class

Autodesk.Revit.UI.Events Namespace