#### CircuitNamingSchemeSettings Members

---

|  |
| --- |
| CircuitNamingSchemeSettings Class   Methods   Properties   See Also |

The  CircuitNamingSchemeSettings  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | GetCircuitNamingSchemeSettings | Gets the circuit naming scheme settings of the project. |
| Public method Static member | IsValidCircuitNamingSchemeId | Verifies that the circuit naming scheme id can be used with CircuitNamingSchemeSettings. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | CircuitNamingSchemeId | The circuit naming scheme id set in CircuitNamingSchemeSettings. |

# See Also

CircuitNamingSchemeSettings Class

Autodesk.Revit.DB.Electrical Namespace