#### FailureResolution Members

---

|  |
| --- |
| FailureResolution Class   Methods   Properties   See Also |

The  FailureResolution  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  FailureResolution |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

FailureResolution Class

Autodesk.Revit.DB Namespace