#### RebarConstraint Members

---

|  |
| --- |
| RebarConstraint Class   Methods   Properties   See Also |

The  RebarConstraint  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | AreGeometryTargetsTheSame | Returns true if the gemetrical targets (ex. face references, other rebar segment references) of "this" constriant are the same as the targets of the "other" constraint. Returns false otherwise. Only the reference to the target piece of geometry is taken into account(ex. only face references, only other rebar segment references). Target Element (elementId) is not taken into account. Distance to target is not taken into account. |
| Public method | ConstrainsRebarEnds | Returns true if this constraint constrains two rebar ends. |
| Public method Static member | Create | This method creates a constraint for a given Rebar Constrained Handle Tag. Will throw exception if used for Shape Driven Rebar. |
| Public method | Dispose | Releases all resources used by the  RebarConstraint |
| Public method | FlipHandleOverTarget | Flips the RebarConstrainedHandle to the other side of the target bar handle, maintaining the distance in absolute value. |
| Public method | GetConstraintType | Returns the RebarConstraintType of a RebarConstraint. |
| Public method | GetCustomHandleTag | Returns the handle tag of the RebarConstrainedHandle. This is valid only for Free Form Rebar. |
| Public method | GetDistanceToTargetCover | Returns the distance from the RebarConstrainedHandle to the target Host Cover Element surface. The RebarConstraintType of the RebarConstraint must be 'ToCover.' |
| Public method | GetDistanceToTargetHostFace | Returns the distance from the RebarConstrainedHandle to the target Host Element surface. The RebarConstraintType of the RebarConstraint must be 'FixedDistanceToHostFace.' |
| Public method | GetDistanceToTargetRebar | Gets the distance from the RebarConstrainedHandle to the target Rebar handle surface. The RebarConstraintType of the RebarConstraint must be 'ToOtherRebar.' |
| Public method | GetRebarConstraintTargetHostFaceType | Returns the RebarConstraintTargetHostFaceType of the host Element face to which the RebarConstraint is attached. The RebarConstraintType of the RebarConstraint must be 'FixedDistanceToHostFace' or 'ToCover.' Will throw exception if it's a multi target constraint. |
| Public method | GetRebarConstraintTargetHostFaceType(Int32) | Returns the RebarConstraintTargetHostFaceType of the host Element face to which the RebarConstraint is attached. The RebarConstraintType of the RebarConstraint must be 'FixedDistanceToHostFace' or 'ToCover.' |
| Public method | GetTargetCoverType | Returns the RebarCoverType for the face specified by targetIndex. Returns null if no RebarHostData is present for target element. |
| Public method | GetTargetElement | Gets the Element object (either Host or Rebar) which provides the constraint. Will throw exception if it's a multi target constraint. |
| Public method | GetTargetElement(Int32) | Gets the Element object (either Host or Rebar) which provides the constraint. Will return the Element which contains the face at targetIndex. |
| Public method | GetTargetHostFaceAndTransform | Returns the face to which the RebarConstraint is attached associated to the given target index. The RebarConstraintType of the RebarConstraint must be 'FixedDistanceToHostFace' or 'ToCover.' |
| Public method | GetTargetHostFaceReference | Returns a reference to the host Element face to which the RebarConstraint is attached. The RebarConstraintType of the RebarConstraint must be 'FixedDistanceToHostFace' or 'ToCover.' Will throw exception if it's a multi target constraint. |
| Public method | GetTargetHostFaceReference(Int32) | Returns a reference that corresponds to the face to which the RebarConstraint is attached specified by the targetIndex. The RebarConstraintType of the RebarConstraint must be 'FixedDistanceToHostFace' or 'ToCover.' |
| Public method | GetTargetRebarAngleOnBarOrHookBend | Returns the angular increment along a bar or hook bend to which the RebarConstraint is attached. |
| Public method | GetTargetRebarBendNumber | Returns the number of the bend on the other Rebar Element to which this RebarConstraint is attached. The RebarConstraint must be of RebarConstraintType 'ToOtherRebar,' and the TargetRebarConstraintType must be 'BarBend.' Rebar must be Shape Driven Rebar element. |
| Public method | GetTargetRebarConstraintType | Returns the TargetRebarConstraintType of the handle on the other Rebar Element to which this RebarConstraint is attached. The RebarConstraintType of the RebarConstraint must be 'ToOtherRebar.' Rebar must be Shape Driven Rebar element. |
| Public method | GetTargetRebarEdgeNumber | Returns the number of the edge on the other Rebar Element to which this RebarConstraint is attached. The RebarConstraint must be of RebarConstraintType 'ToOtherRebar,' and the TargetRebarConstraintType must be 'Edge.' Rebar must be Shape Driven Rebar element. |
| Public method | GetTargetRebarHookBarEnd | Returns 0 or 1 to indicate which end hook on the other Rebar Element to which this RebarConstraint is attached. The RebarConstraint must be of RebarConstraintType 'ToOtherRebar,' and the TargetRebarConstraintType must be 'HookBend.' Rebar must be Shape Driven Rebar element. |
| Public method | HasAnEdgeNumber | Checks if the getTargetRebarEdgeNumber method can be called for the RebarConstraint. |
| Public method | IsBindingHandleWithTarget | Gets the relationship between two RebarConstrainedHandles. |
| Public method | IsEqual | Returns true if the specified RebarConstraint is the same as 'this.' The method can be used to determine which of the RebarConstraint candidates offered by the RebarConstraintsManager is currently active. |
| Public method | IsFixedDistanceToHostFace | Returns true if the RebarConstraintType of the RebarConstraint is 'FixedDistanceToHostFace.' |
| Public method | IsReferenceValidForConstraint | Checks if the reference provided can be used in creating Rebar constraints |
| Public method | IsToCover | Returns true if the RebarConstraintType of the RebarConstraint is 'ToCover.' |
| Public method | IsToHostFaceOrCover | Returns true if the RebarConstraintType of the RebarConstraint is either 'FixedDistanceToHostFace' or 'ToCover.' |
| Public method | IsToOtherRebar | Returns true if the RebarConstraintType of the RebarConstraint is 'ToOtherRebar.' |
| Public method | IsUsingClearBarSpacing | Returns true if the RebarConstrainedHandle to target offset is the clear bar distance, false if the offset is measured between bar centers. |
| Public method | IsValid | Checks that the RebarConstraint still has access to valid Rebar constraint data and that its RebarConstraintsManager is still valid. |
| Public method | ReplaceReferenceTargets | Replaces the current set of references, the type of constraint and the offset value, with the newly provided ones. Will throw exception if this is a constraint for Shape Driven Rebar. |
| Public method | SetDistanceToTargetCover | Sets the distance from the RebarConstrainedHandle to the target Host Cover Element surface. The RebarConstraintType of the RebarConstraint must be 'ToCover.' |
| Public method | SetDistanceToTargetHostFace | Sets the distance from the RebarConstrainedHandle to the target Host Element surface. The RebarConstraintType of the RebarConstraint must be 'FixedDistanceToHostFace.' |
| Public method | SetDistanceToTargetRebar | Sets the offset distance between the constrained RebarConstrainedHandle and its target Rebar handle surface. |
| Public method | SetToBindHandleWithTarget | Sets the relationship between two RebarConstrainedHandles. |
| Public method | SetToUseClearBarSpacing | Sets whether the RebarConstrainedHandle to target offset is the clear bar distance, or is measured between bar centers. |
| Public method | TargetIsBarBend | Returns true if the RebarTargetConstraintType of the RebarConstraint is 'BarBend'. |
| Public method | TargetIsHookBend | Returns true if the RebarTargetConstraintType of the RebarConstraint is 'HookBend'. |
| Public method | TargetRebarConstraintTypeIsEdge | Returns true if the RebarConstraintType of the RebarConstraint is 'ToOtherRebar,' and the RebarConstraint is attached to an edge of the other Rebar Element. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | NumberOfTargets | Identifies the number of references associated to the rebar handle. |

# See Also

RebarConstraint Class

Autodesk.Revit.DB.Structure Namespace