#### RoofType Members

---

|  |
| --- |
| RoofType Class   Methods   Properties   See Also |

The  RoofType  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | ThermalProperties | The calculated and settable thermal properties of the RoofType |

# See Also

RoofType Class

Autodesk.Revit.DB Namespace