#### AreaLoad Members

---

|  |
| --- |
| AreaLoad Class   Methods   Properties   See Also |

The  AreaLoad  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create(Document, ElementId, XYZ, AreaLoadType) | Creates a new hosted area load within the project. |
| Public method Static member | Create(Document, IList CurveLoop , XYZ, AreaLoadType) | Creates a new non-hosted area load within the project. |
| Public method Static member | Create(Document, IList CurveLoop , IList XYZ , IList Int32 , IList Int32 , AreaLoadType) | Creates a new non-hosted area load within the project. |
| Public method | GetLoops | Returns curve loops that define geometry of the area load. |
| Public method | GetRefPoint | Returns the physical location of the reference point. |
| Public method Static member | IsValidHostId | Indicates if the provided host id can host area loads The document containing both the host and the load The id of the analytical panel that is about to host an area load True if an area load can be placed on the input host id |
| Public method | SetLoops | Sets curve loops that define geometry of the area load. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Area | Returns area of the area load. |
| Public property | ForceVector1 | The force vector applied to the 1st reference point of the area load, oriented according to OrientTo setting. |
| Public property | ForceVector2 | The force vector applied to the 2nd reference point of the area load, oriented according to OrientTo setting. |
| Public property | ForceVector3 | The force vector applied to the 3rd reference point of the area load, oriented according to OrientTo setting. |
| Public property | IsProjected | Indicates if the load is projected. |
| Public property | NumRefPoints | Returns the total number of reference points for the area load. |

# See Also

AreaLoad Class

Autodesk.Revit.DB.Structure Namespace