#### RibbonButtonOptions Members

---

|  |
| --- |
| RibbonButtonOptions Class   Methods   Properties   See Also |

The  RibbonButtonOptions  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  RibbonButtonOptions |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

RibbonButtonOptions Class

Autodesk.Revit.UI Namespace