#### DuctFittingAndAccessoryPressureDropUIData Members

---

|  |
| --- |
| DuctFittingAndAccessoryPressureDropUIData Class   Methods   Properties   See Also |

The  DuctFittingAndAccessoryPressureDropUIData  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  DuctFittingAndAccessoryPressureDropUIData |
| Public method | GetUIDataItems | Gets all UI data items stored in the UI data. |
| Public method | GetUnits | Gets units. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

DuctFittingAndAccessoryPressureDropUIData Class

Autodesk.Revit.UI.Mechanical Namespace