#### IMemberForcesServer Members

---

|  |
| --- |
| IMemberForcesServer Interface   Methods   See Also |

The  IMemberForcesServer  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | MemberForcesUpdate | The server's method that will be called when Revit User clicks Member Forces button in the MPP. |

# See Also

IMemberForcesServer Interface

Autodesk.Revit.DB.Structure Namespace