#### FamilyPointLocation Members

---

|  |
| --- |
| FamilyPointLocation Class   Methods   Properties   See Also |

The  FamilyPointLocation  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | GetLocation | Gets the location of the point. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | Name | The name of the corresponding reference point in the Family document. |

# See Also

FamilyPointLocation Class

Autodesk.Revit.DB Namespace