#### ExtElemChangeBeamSectionRegistry Members

---

|  |
| --- |
| ExtElemChangeBeamSectionRegistry Class   Methods   Properties   See Also |

The  ExtElemChangeBeamSectionRegistry  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  ExtElemChangeBeamSectionRegistry |
| Public method Static member | RegisterInterface | Registers a IExtElemChangeBeamSection |
| Public method Static member | Unregister | Unregisters IExtElemChangeBeamSection. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

ExtElemChangeBeamSectionRegistry Class

Autodesk.Revit.DB.Structure Namespace