#### FabricSheet Members

---

|  |
| --- |
| FabricSheet Class   Methods   Properties   See Also |

The  FabricSheet  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create(Document, Element, ElementId) | Creates a new instance of a single flat Fabric Sheet element within the project. |
| Public method Static member | Create(Document, ElementId, ElementId, CurveLoop) | Creates a new instance of a single bent Fabric Sheet element within the project. |
| Public method | GetBendProfile | Returns the profile (not including generated fillets) that defines the shape of the Fabric Sheet bending. |
| Public method | GetBendProfileWithFillets | Returns the profile with generated fillets that defines the shape of the Fabric Sheet bending. |
| Public method | GetReinforcementRoundingManager | Returns an object for managing reinforcement rounding override settings. |
| Public method | GetSegmentParameterIdsAndLengths | Returns the array of pairs [parameter ID, length] that correspond to segments of a bent fabric sheet (like A, B, C, D etc.). |
| Public method | GetSheetLocation | Gets the position and the orientation of the Fabric Sheet instance. |
| Public method | GetWireCenterlines | Gets a list of curves representing the wires centerlines of the Fabric Sheet in the both distribution directions. |
| Public method | GetWireCenterlines(WireDistributionDirection) | Gets a list of curves representing the wires centerlines of the Fabric Sheet. |
| Public method | IsCoverOffsetValid | Identifies if the specified value is valid for use as a cover offset. |
| Public method | IsSingleFabricSheetWithinHost | Identifies if the specified single Fabric Sheet position is within the host. |
| Public method | IsSolidInView | **Obsolete.**   Checks if this fabric sheet is shown solidly in a 3D view. |
| Public method | IsUnobscuredInView | Checks if this fabric sheet is shown unobscured in a view. |
| Public method Static member | IsValidHost(Element) | Checks whether an element is a valid host for fabric sheet. |
| Public method Static member | IsValidHost(Document, ElementId) | Checks whether an element is a valid host for fabric sheet. |
| Public method | PlaceInHost | Inserts the single Fabric Sheet instance into the host element. |
| Public method | SetBendProfile | Sets new profile that defines the shape of the Fabric Sheet bending. |
| Public method | SetSegmentLength | Sets the value of the bent fabric sheet segment(like A, B, C, D etc.) |
| Public method | SetSolidInView | **Obsolete.**   Sets this fabric sheet to be shown solidly in a 3D view. |
| Public method | SetUnobscuredInView | Sets this fabric sheet to be shown unobscured in a view. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | BendFinalLoopOrientationVector | Direction of local Fabric Sheet Y axis in bending polyline LCS. |
| Public property | BentFabricBendDirection | Specifies which wire direction of the fabric sheet is bent. |
| Public property | BentFabricLongitudinalCutLength | Specifies the cut length of the fabric sheet perpendicular to the bend edge. |
| Public property | BentFabricStraightWiresLocation | Specifies the location of straight bars with respect to bent bars in the fabric sheet. |
| Public property | CoverOffset | The additional cover offset of the Fabric Sheet. |
| Public property | CutOverallLength | The sheet length after cutting has taken place. |
| Public property | CutOverallWidth | The sheet length after cutting has taken place. |
| Public property | CutSheetMass | The sheet mass after cutting has taken place. |
| Public property | FabricAreaOwnerId | The Fabric Area Id. |
| Public property | FabricHostReference | Controls if Single Fabric Sheet should be cut by the Host Cover |
| Public property | FabricLocation | The Fabric Sheet location in the host. |
| Public property | FabricNumber | Specifies the numerical parameter assigned to the fabric sheet and any sheet of the same type, dimension, material, shape, and partition. |
| Public property | HostId | The structure element that contains the Fabric Sheet. |
| Public property | IsBent | The type of fabric sheet. True for bent fabric sheet, false for flat fabric sheet. |
| Public property | SketchId | The id of the Sketch element for this element. |

# See Also

FabricSheet Class

Autodesk.Revit.DB.Structure Namespace