#### IPipeFittingAndAccessoryPressureDropServer Members

---

|  |
| --- |
| IPipeFittingAndAccessoryPressureDropServer Interface   Methods   See Also |

The  IPipeFittingAndAccessoryPressureDropServer  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Calculate | Calculate the pipe fitting and pipe accessory coefficient. |
| Public method | GetDataSchema | Obtains the schema of the ESEntity. |
| Public method | IsApplicable | Check if the server is applicable for the pipe fitting or pipe accessory. |

# See Also

IPipeFittingAndAccessoryPressureDropServer Interface

Autodesk.Revit.DB.Plumbing Namespace