#### CableTray Members

---

|  |
| --- |
| CableTray Class   Methods   Properties   See Also |

The  CableTray  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create | Creates a new instance of cable tray. |
| Public method | GetShapeType | Returns the shape type for the cable tray. |
| Public method Static member | IsValidCableTrayType | Identifies if a cable tray type is valid. |
| Public method | IsValidRungSpace | Identifies if the input rung space is valid. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | CurveNormal | The up-direction vector of the cable tray. |
| Public property | RungSpace | Distance between two rungs for the ladder cable tray. |

# See Also

CableTray Class

Autodesk.Revit.DB.Electrical Namespace