#### GeomCombination Members

---

|  |
| --- |
| GeomCombination Class   Methods   Properties   See Also |

The  GeomCombination  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | AllMembers | All elements that are joined in this geometry combination. |

# See Also

GeomCombination Class

Autodesk.Revit.DB Namespace