#### Area Members

---

|  |
| --- |
| Area Class   Methods   Properties   See Also |

The  Area  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | AreaScheme | The area scheme. |
| Public property | IsGrossInterior | The boolean value that indicates whether the area is gross interior. |

# See Also

Area Class

Autodesk.Revit.DB Namespace