#### ZoneElementDomainData Members

---

|  |
| --- |
| ZoneElementDomainData Class   Methods   Properties   See Also |

The  ZoneElementDomainData  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  ZoneElementDomainData |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

ZoneElementDomainData Class

Autodesk.Revit.DB.Mechanical Namespace