#### DefaultDivideSettings Members

---

|  |
| --- |
| DefaultDivideSettings Class   Methods   Properties   See Also |

The  DefaultDivideSettings  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | GetDefaultDivideSettings | Obtains the DefaultDivideSettings object for the specified document. |
| Public method | GetSurfaceDistance | Gets the default Divided Surface distance for a fixed, minimum, or maximum distance layout for U or V gridlines. |
| Public method | GetSurfaceLayout | Gets the default Divided Surface layout for U or V gridlines. |
| Public method | GetSurfaceNumber | Gets the default Divided Surface number for a fixed number layout for U or V gridlines. |
| Public method | SetSurfaceDistance | Sets the default Divided Surface distance for a fixed, minimum, or maximum distance layout for U or V gridlines. |
| Public method | SetSurfaceLayout | Sets the default Divided Surface layout for U or V gridlines. |
| Public method | SetSurfaceNumber | Sets the default Divided Surface number for a fixed number layout for U or V gridlines. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | PathDistance | A default Divided Path distance for a fixed, minimum, or maximum distance layout. |
| Public property | PathLayout | A default Divided Path layout. |
| Public property | PathMeasurementType | A default Divided Path measurement type for distance layouts. |
| Public property | PathNumber | A default Divided Path number for a fixed number layout. |

# See Also

DefaultDivideSettings Class

Autodesk.Revit.DB Namespace