#### StructuralSectionRectangular Members

---

|  |
| --- |
| StructuralSectionRectangular Class   Methods   Properties   See Also |

The  StructuralSectionRectangular  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | CentroidHorizontal | Distance from centroid to the left extremites along horizontal axis. |
| Public property | CentroidVertical | Distance from centroid to the upper extremites along vertical axis. |
| Public property | Height | Section height, depth. |
| Public property | NameKey | Name Key |
| Public property | Width | Section width. |

# See Also

StructuralSectionRectangular Class

Autodesk.Revit.DB.Structure.StructuralSections Namespace