#### IPipePlumbingFixtureFlowServer Members

---

|  |
| --- |
| IPipePlumbingFixtureFlowServer Interface   Methods   See Also |

The  IPipePlumbingFixtureFlowServer  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Calculate | Calculate the pipe plumbing fixture flow. |
| Public method | GetHtmlDescription | The method that Revit will invoke to get an HTML formatted description of the server. |
| Public method | GetInformationLink | The method that Revit will invoke to obtain a URL address which provides more information about the server. |

# See Also

IPipePlumbingFixtureFlowServer Interface

Autodesk.Revit.DB.Plumbing Namespace