#### DocumentPrintedEventArgs Members

---

|  |
| --- |
| DocumentPrintedEventArgs Class   Methods   Properties   See Also |

The  DocumentPrintedEventArgs  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | GetFailedViewElementIds | Returns ElementIds of the views that that failed to print (if any). |
| Public method | GetPrintedViewElementIds | Returns ElementIds of the views that printed successfully. |

# Properties

|  | Name | Description |
| --- | --- | --- |

# See Also

DocumentPrintedEventArgs Class

Autodesk.Revit.DB.Events Namespace