#### PhaseFilter Members

---

|  |
| --- |
| PhaseFilter Class   Methods   Properties   See Also |

The  PhaseFilter  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create | Creates a new phase filter with default status presentation. |
| Public method | GetPhaseStatusPresentation | Gets the phase status presentation. |
| Public method | SetPhaseStatusPresentation | Sets the phase status presentation. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsDefault | Indicates whether this filter is the default one. |

# See Also

PhaseFilter Class

Autodesk.Revit.DB Namespace