#### StructuralConnectionApprovalType Members

---

|  |
| --- |
| StructuralConnectionApprovalType Class   Methods   Properties   See Also |

The  StructuralConnectionApprovalType  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create | Creates a new StructuralConnectionApprovalType. |
| Public method Static member | GetAllStructuralConnectionApprovalTypes | Collects the ids of all StructuralConnectionApprovalTypes in the document. |
| Public method Static member | IsValidApprovalTypeName | Verifies if the provided approval name is unique in the document. |

# Properties

|  | Name | Description |
| --- | --- | --- |

# See Also

StructuralConnectionApprovalType Class

Autodesk.Revit.DB.Structure Namespace