#### AnalyticalLink Members

---

|  |
| --- |
| AnalyticalLink Class   Methods   Properties   See Also |

The  AnalyticalLink  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create | Creates a new instance of a AnalyticalLink element between two Hubs. |
| Public method | IsAutoGenerated | Specifies whether or not an AnalyticalLink was created by an Analytical Element. |
| Public method Static member | IsValidHub | Checks whether input hub is valid for an AnalyticalLink. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | End | The point at the end of the AnalyticalLink. |
| Public property | EndHubId | Hub ID at end of AnalyticalLink. |
| Public property | OwnerId | ElementId of Analytical Element which created the AnalyticalLink (if any) invalidElementId if this Analytical Link was created by the User or API |
| Public property | Start | The point at the start of the AnalyticalLink. |
| Public property | StartHubId | Hub ID at start of AnalyticalLink. |

# See Also

AnalyticalLink Class

Autodesk.Revit.DB.Structure Namespace