#### Point Members

---

|  |
| --- |
| Point Class   Methods   Properties   See Also |

The  Point  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create(XYZ) | Creates a point at the given coordinates. |
| Public method Static member | Create(XYZ, ElementId) | Creates a point at the given coordinates and assigns it the specified GraphicsStyle. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Coord | Returns the coordinates of the point. |
| Public property | Reference | Returns a stable reference to the point. |

# See Also

Point Class

Autodesk.Revit.DB Namespace