#### ImageView Members

---

|  |
| --- |
| ImageView Class   Methods   Properties   See Also |

The  ImageView  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create | Create an ImageView containing an image imported from disk. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | ImageInstanceId | Id of the image in the view. |

# See Also

ImageView Class

Autodesk.Revit.DB Namespace