#### IFCExternalServiceUIData Members

---

|  |
| --- |
| IFCExternalServiceUIData Class   Methods   Properties   See Also |

The  IFCExternalServiceUIData  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  IFCExternalServiceUIData |
| Public method | GetParentHwnd | return the parent handle |
| Public method | GetRevitElementIds | return the list of revit Element Ids |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Document | return the document |
| Public property | IsReset | flag to indicate the value has been reset |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | ParamId | the parameter id |
| Public property | SelectedIFCItem | The selected IFC Item (can be IFC Entity, or PredefinedType) |

# See Also

IFCExternalServiceUIData Class

Autodesk.Revit.UI Namespace