#### MEPAnalyticalConnection Members

---

|  |
| --- |
| MEPAnalyticalConnection Class   Methods   Properties   See Also |

The  MEPAnalyticalConnection  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | CanSupportAnalyticalConnection | Checks if the connector can support the analytical connection. |
| Public method Static member | Create | Creates a new analytical connection between two open connectors. |
| Public method Static member | CreateMultipleConnections | Creates new analytical connections between the equipment connector and the nearest point on the curves. |
| Public method | GetFlow | Gets the flow value of this analytical connection. |

# Properties

|  | Name | Description |
| --- | --- | --- |

# See Also

MEPAnalyticalConnection Class

Autodesk.Revit.DB Namespace