#### FileImportingEventArgs Members

---

|  |
| --- |
| FileImportingEventArgs Class   Methods   Properties   See Also |

The  FileImportingEventArgs  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Format | Identifies the import format, e.g. DWG or image. |
| Public property | Path | Path of the source file which is about to be imported. |

# See Also

FileImportingEventArgs Class

Autodesk.Revit.DB.Events Namespace