#### PipingSystemType Members

---

|  |
| --- |
| PipingSystemType Class   Methods   Properties   See Also |

The  PipingSystemType  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create | Creates a new instance of a piping system type and adds it to the document. |
| Public method | ValidateRiseDropSymbolType | Confirms if the parameter is a valid piping rise/drop symbol type. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | FlowConversionMethod | The flow conversion method for the piping system type. |
| Public property | FluidTemperature | Fluid Temperature |
| Public property | FluidType | Fluid Type |
| Public property | SingleLineBendDropType | Symbol for a 1 line drop |
| Public property | SingleLineBendRiseType | Symbol for a 1 line rise |
| Public property | SingleLineJunctionDropType | Symbol for a 1 line junction drop |
| Public property | SingleLineJunctionRiseType | Symbol for a 1 line junction rise |
| Public property | TwoLineDropType | Symbol for a 2 line drop |
| Public property | TwoLineRiseType | Symbol for a 2 line rise |

# See Also

PipingSystemType Class

Autodesk.Revit.DB.Plumbing Namespace