#### AreaBasedLoadData Members

---

|  |
| --- |
| AreaBasedLoadData Class   Methods   Properties   See Also |

The  AreaBasedLoadData  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | AddElectricalLoadArea | Adds electrical load area into the area based load. |
| Public method | GetElectricalLoadAreas | Gets electrical load areas which the area based load includes. |
| Public method | RemoveElectricalLoadArea | Removes electrical load area from the area based load. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | ApparentLoad | The electrical apparent load of the area based load. |
| Public property | ApparentPowerDensity | The apparent power density of the area based load. |
| Public property | AreaBasedLoadType | The electrical area based load type of the area based load. |
| Public property | Current | The current of the area based load . |
| Public property | LoadClassification | The load classification of the area based load. |
| Public property | LoadDensity | The load density of the area based load. |
| Public property | LoadType | The load type of the area based load. |
| Public property | PhasesNumber | The Phases Number of the area based load. |
| Public property | PowerFactor | The power factor of the area based load. |
| Public property | TrueLoad | The electrical true load of the area based load. |
| Public property | Voltage | The voltage of the area based load. |

# See Also

AreaBasedLoadData Class

Autodesk.Revit.DB.Electrical Namespace