#### Workset Members

---

|  |
| --- |
| Workset Class   Methods   Properties   See Also |

The  Workset  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create | Creates a new workset. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsEditable | Whether the workset is editable. |
| Public property | IsOpen | Whether the workset is open (rather than closed). |
| Public property | IsVisibleByDefault | Whether the workset is visible by default. |
| Public property | Kind | Kind of the workset. |

# See Also

Workset Class

Autodesk.Revit.DB Namespace