#### ParameterElement Members

---

|  |
| --- |
| ParameterElement Class   Methods   Properties   See Also |

The  ParameterElement  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | GetDefinition | Get the definition representing this parameter element. |

# Properties

|  | Name | Description |
| --- | --- | --- |

# See Also

ParameterElement Class

Autodesk.Revit.DB Namespace