#### BRepBuilderEdgeGeometry Members

---

|  |
| --- |
| BRepBuilderEdgeGeometry Class   Methods   Properties   See Also |

The  BRepBuilderEdgeGeometry  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create(Curve) | Construct BRepBuilderEdgeGeometry based on any GCurve, including GLine and GArc. The curve will be simplified if possible, and the concrete type of the returned value will reflect that simplification: BRepBuilderLinearEdgeGeometry if the curve could be simplified to a line, BRepBuilderArcEdgeGeometry if it could be simplified to an arc, BRepBuilderGenericCurveEdgeGeometry otherwise. |
| Public method Static member | Create(XYZ, XYZ) | Constructs a BRepBuilderEdgeGeometry representing a straight line between the two given points. |
| Public method | Dispose | Releases all resources used by the  BRepBuilderEdgeGeometry |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

BRepBuilderEdgeGeometry Class

Autodesk.Revit.DB Namespace