#### InstanceNode Members

---

|  |
| --- |
| InstanceNode Class   Methods   Properties   See Also |

The  InstanceNode  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | GetSymbolGeometryId | Gets the SymbolGeometryId associated with the node. |

# Properties

|  | Name | Description |
| --- | --- | --- |

# See Also

InstanceNode Class

Autodesk.Revit.DB Namespace