#### BasePoint Members

---

|  |
| --- |
| BasePoint Class   Methods   Properties   See Also |

The  BasePoint  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | GetProjectBasePoint | Gets the project base point for the document. |
| Public method Static member | GetSurveyPoint | Gets the survey point for the document. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Clipped | Clipped state of the survey point (shared BasePoint). Change its state to clipped or unclipped, depending on how you want to move the survey point. To move the survey coordinate system in relation to the model, move the clipped survey point. To change the survey point to another location in the survey coordinate system, move the unclipped survey point. For project base point (non-shared BasePoint), this property will always return false. Trying to set the property will get an InvalidOperationException. |
| Public property | IsShared | Indicates whether the BasePoint is shared. The project's survey point is a BasePoint which is shared. |
| Public property | Position | Position of the BasePoint. |
| Public property | SharedPosition | Shared position of the BasePoint based on the active ProjectLocation of its belonging Document. To get the shared position under other ProjectLocations, please use ProjectLocation.GetProjectPosition(BasePoint.Position). |

# See Also

BasePoint Class

Autodesk.Revit.DB Namespace