#### RebarContainer Members

---

|  |
| --- |
| RebarContainer Class   Methods   Properties   See Also |

The  RebarContainer  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | AppendItemFromCurves | Appends an Item to the RebarContainer. Fills its data on base of the Rebar. |
| Public method | AppendItemFromCurvesAndShape | Appends an Item to the RebarContainer. Fills its data on base of the Rebar. |
| Public method | AppendItemFromRebar | Appends an Item to the RebarContainer. Fills its data on base of the Rebar. Will throw exception if given rebar is not shape driven. Will throw exception if given rebar has moved bars in set. |
| Public method | AppendItemFromRebarShape | Appends an Item to the RebarContainer. Fills its data on base of the Rebar. |
| Public method | CanApplyPresentationMode | Checks if a presentation mode can be applied for this RebarContainer in the given view. |
| Public method | ClearItems | Clears all the Items stored in this Rebar Container element. |
| Public method | Contains | Checks if the RebarContainer has this item as one of its members. |
| Public method Static member | Create | Creates a new instance of a Rebar Container element within the project. |
| Protected method | GetBasicIEnumerator | Returns an enumerator that iterates through a collection. |
| Public method | GetEnumerator | Returns an enumerator that iterates through a collection. |
| Public method | GetHostId | The element that contains the rebar. |
| Public method | GetItem | Gets the item stored in the RebarContainer at the associated index. |
| Public method | GetParametersManager | Returns an object used to manage parameters of the Rebar Container. |
| Public method | GetRebarContainerIterator | Returns a Rebar Container Iterator that iterates through the Rebar Container Items. |
| Public method | GetReinforcementRoundingManager | Returns an object for managing reinforcement rounding override settings. |
| Public method | HasPresentationOverrides | Identifies if any RebarContainerItem of this RebarContainer has overridden default presentation settings for the given view. |
| Public method | IsItemHidden | Identifies if a given RebarContainerItem is hidden in this view. |
| Public method | IsSolidInView | **Obsolete.**   Checks if this RebarContainer element is shown as solid in the given 3D view. |
| Public method | IsUnobscuredInView | Checks if this rebar container element is shown unobscured in a view. |
| Public method | RemoveItem | Removes Item from the Rebar Container. |
| Public method | SetHostId | The element that contains the rebar. |
| Public method | SetItemHiddenStatus | Sets the RebarContainerItem to be hidden or unhidden in the given view. |
| Public method | SetSolidInView | **Obsolete.**   Sets this RebarContainer element is shown as solid in the given 3D view. |
| Public method | SetUnobscuredInView | Sets this rebar container element to be shown unobscured in a view. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | ItemsCount | The count of Items in this Rebar Container. |
| Public property | PresentItemsAsSubelements | Identifies if Items should be presented in schedules and tags as separate subelements. |
| Public property | ScheduleMark | The Schedule Mark parameter. On creation, the Schedule Mark is set to a value that is unique to the host, but it can be set to any value. |

# See Also

RebarContainer Class

Autodesk.Revit.DB.Structure Namespace