#### PaperSize Members

---

|  |
| --- |
| PaperSize Class   Methods   Properties   See Also |

The  PaperSize  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Name | Retrieve the paper size name of current project. |

# See Also

PaperSize Class

Autodesk.Revit.DB Namespace