#### ExternalDataInstanceRemovingFromDocumentEventArgs Members

---

|  |
| --- |
| ExternalDataInstanceRemovingFromDocumentEventArgs Class   Methods   Properties   See Also |

The  ExternalDataInstanceRemovingFromDocumentEventArgs  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | InstanceId | The Revit id of the external data instance being removed from Revit document. |
| Public property | TypeId | The type id of the external data instance id being removed from Revit document. |

# See Also

ExternalDataInstanceRemovingFromDocumentEventArgs Class

Autodesk.Revit.DB.Events Namespace