#### AssetPropertyDouble Members

---

|  |
| --- |
| AssetPropertyDouble Class   Methods   Properties   See Also |

The  AssetPropertyDouble  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | IsValidValue | Checks that the value is a valid value for this property. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Value | The value of the property. |

# See Also

AssetPropertyDouble Class

Autodesk.Revit.DB.Visual Namespace