#### AssemblyMemberDifference Members

---

|  |
| --- |
| AssemblyMemberDifference Class   Methods   Properties   See Also |

The  AssemblyMemberDifference  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  AssemblyMemberDifference |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

AssemblyMemberDifference Class

Autodesk.Revit.DB Namespace