#### IPipeFittingAndAccessoryPressureDropUIServer Members

---

|  |
| --- |
| IPipeFittingAndAccessoryPressureDropUIServer Interface   Methods   See Also |

The  IPipeFittingAndAccessoryPressureDropUIServer  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | GetDBServerId | Returns the Id of the corresponding DB server for which this server provides an optional UI. |
| Public method | ShowSettings | Shows the settings UI. |

# See Also

IPipeFittingAndAccessoryPressureDropUIServer Interface

Autodesk.Revit.UI.Plumbing Namespace