#### FabricAreaType Members

---

|  |
| --- |
| FabricAreaType Class   Methods   Properties   See Also |

The  FabricAreaType  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | CreateDefaultFabricAreaType | Creates a new FabricAreaType object with a default name. |

# Properties

|  | Name | Description |
| --- | --- | --- |

# See Also

FabricAreaType Class

Autodesk.Revit.DB.Structure Namespace