#### FabricWireType Members

---

|  |
| --- |
| FabricWireType Class   Methods   Properties   See Also |

The  FabricWireType  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | CreateDefaultFabricWireType | Creates a new FabricWireType object with a default name. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | BendDiameter | Determines the bending diameter of the wire. |
| Public property | WireDiameter | Determines the diameter of the wire. |

# See Also

FabricWireType Class

Autodesk.Revit.DB.Structure Namespace