#### RevisionSettings Members

---

|  |
| --- |
| RevisionSettings Class   Methods   Properties   See Also |

The  RevisionSettings  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | GetRevisionSettings | Returns the RevisionSettings for the given project document. |
| Public method | IsAcceptableRevisionCloudSpacing | Rounds the given raw value and checks whether it is an acceptable cloud spacing value after it is rounded. |
| Public method Static member | RoundRevisionCloudSpacing | Rounds the given revision cloud spacing value according to the document's settings. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | RevisionCloudSpacing | Determines the size in paper space of revision clouds drawn in a project. |
| Public property | RevisionNumbering | Determines how the revision number values will display on sheets. |

# See Also

RevisionSettings Class

Autodesk.Revit.DB Namespace