#### ThinLinesOptions Members

---

|  |
| --- |
| ThinLinesOptions Class   Methods   Properties   See Also |

The  ThinLinesOptions  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  ThinLinesOptions |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | AreThinLinesEnabled | A static property defining if the 'Thin Lines' setting is on or off in current Revit Application Session. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

ThinLinesOptions Class

Autodesk.Revit.UI Namespace