#### RebarCoupler Members

---

|  |
| --- |
| RebarCoupler Class   Methods   Properties   See Also |

The  RebarCoupler  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | CouplerLinkTwoBars | returns true if the coupler sits on two rebar and false otherwise |
| Public method Static member | Create | Creates a new instance of a Rebar Coupler element within the project. |
| Public method | GetCoupledReinforcementData | gets the reinforcement data. The returned list will have size = 2. If coupler stays on only one bar one element in this list will be null. |
| Public method | GetCouplerPositionTransform | Return a transform representing the relative position of the coupler at index couplerPositionIndex in the set. |
| Public method | GetCouplerQuantity | Identifies the number of couplers in a set. |
| Public method | GetPointsForPlacement | gets the point (or points in case of rebar set) where the coupler is placed |
| Public method | IsUnobscuredInView | Checks if this rebar coupler element is shown unobscured in a view. |
| Public method | SetUnobscuredInView | Sets this rebar coupler element to be shown unobscured in a view. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | CouplerMark | gets and sets the coupler mark |
| Public property | RotationAngle | Indetifies the rotation angle of the coupler around its axis. |

# See Also

RebarCoupler Class

Autodesk.Revit.DB.Structure Namespace