#### ExternallyTaggedGeometryObject Members

---

|  |
| --- |
| ExternallyTaggedGeometryObject Class   Methods   Properties   See Also |

The  ExternallyTaggedGeometryObject  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  ExternallyTaggedGeometryObject |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | ExternalId | The external Id of the geometry object. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

ExternallyTaggedGeometryObject Class

Autodesk.Revit.DB Namespace