#### IExportContext2D Members

---

|  |
| --- |
| IExportContext2D Interface   Methods   See Also |

The  IExportContext2D  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | OnElementBegin2D | This method marks the beginning of an element to be exported. |
| Public method | OnElementEnd2D | This method marks the end of an element being exported. |
| Public method | OnFaceEdge2D | This method is called when a Face edge is being output. |
| Public method | OnFaceSilhouette2D | This method is called when a Face silhouette is being output. |

# See Also

IExportContext2D Interface

Autodesk.Revit.DB Namespace