#### RebarBarType Members

---

|  |
| --- |
| RebarBarType Class   Methods   Properties   See Also |

The  RebarBarType  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create | Creates a new RebarBarType object |
| Public method Static member | CreateDefaultRebarBarType | Creates a new RebarBarType object with a default name. |
| Public method | GetAutoCalcHookLengths | Identifies if the hook lengths of a hook type are automatically calculated for this bar type |
| Public method | GetHookLength | Identifies the hook length for a hook type |
| Public method | GetHookOffsetLength | Identifies the hook offset length for a hook type |
| Public method | GetHookPermission | Identifies if a hook type is permitted for this bar type |
| Public method | GetHookTangentLength | Identifies the hook tangent length for a hook type |
| Public method | GetReinforcementRoundingManager | Returns an object for managing reinforcement rounding override settings. |
| Public method | SetAutoCalcHookLengths | Identifies if the hook lengths of a hook type are automatically calculated for this bar type |
| Public method | SetBarTypeDiameters | Sets all input diameters from diametersOptions in current RebarBarType. |
| Public method | SetHookLength | Identifies the hook length for a hook type |
| Public method | SetHookOffsetLength | Identifies the hook offset length for a hook type |
| Public method | SetHookPermission | Identifies if a hook type is permitted for this bar type |
| Public method | SetHookTangentLength | Identifies the hook tangent length for a hook type |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | BarModelDiameter | Defines bar model diameter of rebar |
| Public property | BarNominalDiameter | Defines bar nominal diameter of rebar |
| Public property | DeformationType | Defines bar deformation type. |
| Public property | MaximumBendRadius | Defines maximum bend radius of rebar |
| Public property | StandardBendDiameter | Defines bar bend diameter for rebar whose style is standard |
| Public property | StandardHookBendDiameter | Defines hook bend diameter for rebar whose style is standard |
| Public property | StirrupTieBendDiameter | Defines bar and hook bend diameter for rebar whose style is stirrup/tie |

# See Also

RebarBarType Class

Autodesk.Revit.DB.Structure Namespace