#### ChangeType Members

---

|  |
| --- |
| ChangeType Class   Methods   Properties   See Also |

The  ChangeType  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | ConcatenateChangeTypes | Creates a ChangeType that is a union of the two input ChangeTypes |
| Public method | Contains | Checks whether this ChangeType contains the input ChangeType |
| Public method | Dispose | Releases all resources used by the  ChangeType |
| Public method | IsIdentical | Compares if two ChangeTypes are identical |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

ChangeType Class

Autodesk.Revit.DB Namespace