#### FlexDuct Members

---

|  |
| --- |
| FlexDuct Class   Methods   Properties   See Also |

The  FlexDuct  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create(Document, ElementId, ElementId, ElementId, IList XYZ ) | Creates a new flexible duct into the document, using a point array and flexible duct type. |
| Public method Static member | Create(Document, ElementId, ElementId, ElementId, XYZ, XYZ, IList XYZ ) | Creates a new flexible duct into the document, using a point array and flexible duct type. |
| Public method Static member | IsFlexDuctTypeId | Checks if given type is valid flexible duct type. |
| Public method Static member | IsHVACSystemTypeId | Checks if given type is valid HVAC system type. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | EndTangent | Gets or sets the tangent vector at the end of the curve. The invalid or zero vector is ignored when setting the tangent. |
| Public property | FlexDuctType | The flex duct type of this flex duct. |
| Public property | Points | The points of the flex duct. |
| Public property | StartTangent | Gets or sets the tangent vector at the start of the curve. The invalid or zero vector is ignored when setting the tangent. |

# See Also

FlexDuct Class

Autodesk.Revit.DB.Mechanical Namespace