#### AreaVolumeSettings Members

---

|  |
| --- |
| AreaVolumeSettings Class   Methods   Properties   See Also |

The  AreaVolumeSettings  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | GetAreaVolumeSettings | Get the area and volume settings of the project. |
| Public method | GetSpatialElementBoundaryLocation | Gets the spatial element boundary location based on spatial element type. |
| Public method | SetSpatialElementBoundaryLocation | Sets the spatial element boundary location of a spatial element type. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | ComputeVolumes | True to enable volume computation. False to disable it. |

# See Also

AreaVolumeSettings Class

Autodesk.Revit.DB Namespace