#### FabricRoundingManager Members

---

|  |
| --- |
| FabricRoundingManager Class   Methods   Properties   See Also |

The  FabricRoundingManager  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | ApplicableReinforcementRoundingSource | Identifies the source of the rounding settings for this element. |
| Public property | ApplicableSegmentLengthRounding | The applicable rounding for fabric segments. |
| Public property | ApplicableSegmentLengthRoundingMethod | The applicable rounding method for fabric segments. |
| Public property | ApplicableTotalLengthRounding | The applicable rounding for Cut Overall Length and Cut Overall Width parameters. |
| Public property | ApplicableTotalLengthRoundingMethod | The applicable rounding method for Cut Overall Length and Cut Overall Width parameters. |
| Public property | SegmentLengthRounding | The rounding for fabric segments. |
| Public property | SegmentLengthRoundingMethod | Identifies the segment length rounding method |
| Public property | TotalLengthRounding | The rounding for Cut Overall Length and Cut Overall Width parameters. |
| Public property | TotalLengthRoundingMethod | Identifies the total length rounding method |

# See Also

FabricRoundingManager Class

Autodesk.Revit.DB.Structure Namespace