#### Pipe Members

---

|  |
| --- |
| Pipe Class   Methods   Properties   See Also |

The  Pipe  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create(Document, ElementId, ElementId, Connector, Connector) | Creates a new pipe that connects to two connectors. |
| Public method Static member | Create(Document, ElementId, ElementId, Connector, XYZ) | Creates a new pipe that connects to the connector. |
| Public method Static member | Create(Document, ElementId, ElementId, ElementId, XYZ, XYZ) | Creates a new pipe from two points. |
| Public method Static member | CreatePlaceholder | Creates a new placeholder pipe. |
| Public method Static member | IsPipeTypeId | Checks if given type is valid pipe type. |
| Public method Static member | IsPipingConnector | Checks if the given connector is a valid piping connector. |
| Public method Static member | IsPipingSystemTypeId | Checks if given type is valid piping system type. |
| Public method | SetSystemType | Updates the associated system type for the pipe. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | FlowState | The flow state of the pipe. |
| Public property | IsPlaceholder | Identifies if the pipe is a placeholder or not. |
| Public property | PipeSegment | The pipe segment that was assigned to this pipe according to the routing preference. |
| Public property | PipeType | The pipe type of this pipe. |

# See Also

Pipe Class

Autodesk.Revit.DB.Plumbing Namespace