#### RevolvedSurface Members

---

|  |
| --- |
| RevolvedSurface Class   Methods   Properties   See Also |

The  RevolvedSurface  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create(Frame, Curve) | Creates a Surface object coincident with the surface of revolution defined by a coordinate frame and a profile curve. |
| Public method Static member | Create(XYZ, XYZ, Curve) | Creates a Surface object coincident with the surface of revolution defined by an axis and a profile curve. |
| Public method Static member | Create(Frame, Curve, Double, Double) | Creates a Surface object coincident with the surface of revolution defined by a coordinate frame, a profile curve, and start and end angles of revolution. |
| Public method Static member | Create(XYZ, XYZ, Curve, Double, Double) | Creates a Surface object coincident with the surface of revolution defined by an axis, a profile curve, and start and end angles of revolution. |
| Public method | GetProfileCurve | Returns a copy of the profile curve expressed in the surface's coordinate system. |
| Public method | GetProfileCurveInWorldCoordinates | Returns a copy of the profile curve expressed in the world coordinate system. |
| Public method Static member | IsValidProfileCurve(Frame, Curve) | Checks if the input profile curve is valid to create a surface of revolution in the given frame of reference. |
| Public method Static member | IsValidProfileCurve(XYZ, XYZ, Curve) | Checks if the input profile curve is valid to create a surface of revolution around the given axis. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Axis | Axis of the revolved surface. This is the Z axis of the local coordinate system associated with this revolved surface. |
| Public property | Origin | Center of the circle that defines the base of the revolved surface. This is the origin of the local coordinate system associated with this revolved surface. |
| Public property | XDir | X axis of the local coordinate system associated with this revolved surface. |
| Public property | YDir | X axis of the local coordinate system associated with this revolved surface. |

# See Also

RevolvedSurface Class

Autodesk.Revit.DB Namespace