#### DisplacementElement Members

---

|  |
| --- |
| DisplacementElement Class   Methods   Properties   See Also |

The  DisplacementElement  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | CanCategoryBeDisplaced | Indicates whether elements of the specified category are eligible as displaced elements. |
| Public method | CanElementsBeAddedToDisplacementSet | Indicates if these elements can be displaced by this DisplacementElement. |
| Public method Static member | CanElementsBeDisplaced(View, ICollection ElementId ) | Indicates if elements can be assigned to a new DisplacementElement. |
| Public method Static member | CanElementsBeDisplaced(View, ICollection ElementId , ElementId ) | Indicates if elements can be assigned to a new DisplacementElement. |
| Public method Static member | Create | Creates a new DisplacementElement as a child of the specified parent DisplacementElement. |
| Public method | GetAbsoluteDisplacement | The absolute displacement applied to the displaced elements. |
| Public method Static member | GetAdditionalElementsToDisplace | Identify a set of elements that potentially should be displaced along with a given element. |
| Public method | GetChildren | Returns a set of DisplacementElements which have this DisplacementElement as a parent. |
| Public method | GetDisplacedElementIds | The ids of the elements affected by this DisplacementElement. |
| Public method Static member | GetDisplacedElementIds(View) | Returns the element ids of all displaced elements in the specified view. |
| Public method | GetDisplacedElementIdsFromAllChildren | The element ids of elements displaced by this DisplacementElement and any DisplacementElement which declare this one as parent. |
| Public method Static member | GetDisplacementElementId | The element id of the DisplacementElement that includes the specified element. |
| Public method Static member | GetDisplacementElementIds | The element ids of all DisplacementElements owned by the specified view. |
| Public method | GetRelativeDisplacement | The relative displacement applied to the displaced elements by this DisplacementElement. |
| Public method Static member | IsAllowedAsDisplacedElement | Indicates if the specified element is allowed to be displaced. |
| Public method Static member | IsElementDisplacedInView | Indicates if the specified element displaced in the specified View. |
| Public method Static member | IsNotEmpty | Validates that the input set of element ids is valid for a DisplacementElement. |
| Public method Static member | IsValidAsParentInView | Indicates whether the specified DisplacementElement can be used as a parent when creating a DisplacementElement in the specified view. |
| Public method | RemoveDisplacedElement | Remove a displaced element from this DisplacementElement. |
| Public method | ResetDisplacedElements | Sets the translation of the DisplacementElement to (0, 0, 0). The DisplacementElement continues to exist, but its elements are displayed in their actual location. |
| Public method | SetDisplacedElementIds | Sets the ids of the elements affected by this DisplacementElement. |
| Public method | SetRelativeDisplacement | Sets the relative displacement applied to the displaced elements by this DisplacementElement. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | ParentId | The element id of the parent DisplacementElement. This DisplacementElement's relative transform will be concatenated with the absolute transform of its parent. |

# See Also

DisplacementElement Class

Autodesk.Revit.DB Namespace