#### StructuralSettings Members

---

|  |
| --- |
| StructuralSettings Class   Methods   Properties   See Also |

The  StructuralSettings  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | GetStructuralSettings | Obtains the StructuralSettings object for the specified project document. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | BoundaryConditionAreaAndLineSymbolSpacing | Symbol spacing for boundary conditions. |
| Public property | BoundaryConditionFamilySymbolFixed | The id of the FamilySymbol to represent a fixed boundary condition. |
| Public property | BoundaryConditionFamilySymbolPinned | The id of the FamilySymbol to represent a pinned boundary condition. |
| Public property | BoundaryConditionFamilySymbolRoller | The id of the FamilySymbol to represent a roller boundary condition. |
| Public property | BoundaryConditionFamilySymbolUserDefined | The id of the FamilySymbol to represent a user-defined boundary condition. |
| Public property | BraceAboveSymbol | The id of the ElementType to represent a brace above a beam in plan view. |
| Public property | BraceBelowSymbol | The id of the ElementType to represent a brace below a beam in plan view. |
| Public property | BraceParallelLineOffset | The distance by which brace symbols in plan views will be offset. |
| Public property | KickerBraceSymbol | The id of the ElementType to represent a kicker brace. |
| Public property | ShowBraceAbove | Whether to show brace symbols above beams in plan views. |
| Public property | ShowBraceBelow | Whether to show brace symbols below beams in plan views. |
| Public property | SymbolicCutbackForBeamAndTruss | Symbolic cutback distance to be applied to all beams and trusses. |
| Public property | SymbolicCutbackForBrace | Symbolic cutback distance to be applied to all braces. |
| Public property | SymbolicCutbackForColumn | Symbolic cutback distance to be applied to all columns. |

# See Also

StructuralSettings Class

Autodesk.Revit.DB.Structure Namespace