#### AssetPropertyString Members

---

|  |
| --- |
| AssetPropertyString Class   Methods   Properties   See Also |

The  AssetPropertyString  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | IsValidValue | Checks that the value is a valid value for this property. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Value | value of the property |

# See Also

AssetPropertyString Class

Autodesk.Revit.DB.Visual Namespace