#### AnalyticalElement Members

---

|  |
| --- |
| AnalyticalElement Class   Methods   Properties   See Also |

The  AnalyticalElement  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | GetCurve | Returns the curve of the Analytical Element. |
| Public method | GetReference | Returns a reference to a given curve within the Analytical Element. |
| Public method | GetTransform | Returns the transform which reflects Analytical Element orientation. |
| Public method | IsSingleCurve | Indicates if the Analytical Element can be expressed as a single curve. |
| Public method | IsValidAnalyzeAs | Checks whether the value set for Analyze As is valid for an Analytical Element. |
| Public method | IsValidSelector | Indicates if the input selector is valid for the Analytical Element. |
| Public method | IsValidStructuralRole | Checks whether the value set for Analytical Structural Role is valid for an Analytical Element. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | AnalyzeAs | This represents the Analyze As parameter assigned to Analytical Element. |
| Public property | MaterialId | Defines the Material Id for the Analytical Element. |
| Public property | StructuralRole | The enum value depicting structural role asigned to the Analytical Element. |

# See Also

AnalyticalElement Class

Autodesk.Revit.DB.Structure Namespace