#### HermiteSurface Members

---

|  |
| --- |
| HermiteSurface Class   Methods   Properties   See Also |

The  HermiteSurface  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create(Int32, Int32, IList XYZ ) | Create a non-periodic Hermite surface using a net of 3D points as input. |
| Public method Static member | Create(Int32, Int32, IList XYZ , Boolean, Boolean) | Create a Hermite surface using a net of 3D points as input. Specify periodicity in U and V direction. |
| Public method | IsValid | Checks whether this HermiteSurface object is valid. |

# Properties

|  | Name | Description |
| --- | --- | --- |

# See Also

HermiteSurface Class

Autodesk.Revit.DB Namespace