#### ViewSection Members

---

|  |
| --- |
| ViewSection Class   Methods   Properties   See Also |

The  ViewSection  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | CreateCallout | Creates a new callout view. |
| Public method Static member | CreateDetail | Returns a new detail ViewSection. |
| Public method Static member | CreateReferenceCallout | Creates a new reference callout. |
| Public method Static member | CreateReferenceSection | Creates a new reference section. |
| Public method Static member | CreateSection | Returns a new section ViewSection. |
| Public method Static member | IsParentViewValidForCallout | This validator checks that the parent view is appropriate for callout views. |
| Public method | IsSplitSection | Sections can be split (jog) so that they cut at >1 plane. |
| Public method Static member | IsViewFamilyTypeValidForCallout | This validator checks that the ViewFamilyType is appropriate for callout views in the input parent view. |

# Properties

|  | Name | Description |
| --- | --- | --- |

# See Also

ViewSection Class

Autodesk.Revit.DB Namespace