#### UIView Members

---

|  |
| --- |
| UIView Class   Methods   Properties   See Also |

The  UIView  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Close | Closes the view. |
| Public method | Dispose | Releases all resources used by the  UIView |
| Public method | GetWindowRectangle | Gets the rectangle containing the coordinates of the view's drawing area. |
| Public method | GetZoomCorners | Gets the corners of the view's rectangle. The two points that define the corners of the view's rectangle in model coordinates. |
| Public method | Zoom | Zoom the view. |
| Public method | ZoomAndCenterRectangle | Zoom and center the view to a specified rectangle. |
| Public method | ZoomSheetSize | Zoom to the sheet size. |
| Public method | ZoomToFit | Zoom the view to fit its contents. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | ViewId | The id of the View associated with a UIView. |

# See Also

UIView Class

Autodesk.Revit.UI Namespace