#### AnalyticalEquipmentLoadData Members

---

|  |
| --- |
| AnalyticalEquipmentLoadData Class   Methods   Properties   See Also |

The  AnalyticalEquipmentLoadData  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | ApparentLoad | The electrical apparent load of analytical equipment load. |
| Public property | Current | The current of the analytical equipment load. |
| Public property | LoadClassification | The load classification of analytical equipment load. |
| Public property | LoadType | The load type of analytical equipment load. |
| Public property | PowerFactor | The power factor of analytical equipment load. |
| Public property | TrueLoad | The electrical true load of analytical equipment load. |
| Public property | Voltage | The voltage of the analytical equipment load. |

# See Also

AnalyticalEquipmentLoadData Class

Autodesk.Revit.DB.Electrical Namespace