#### IATFTranslationServer Members

---

|  |
| --- |
| IATFTranslationServer Interface   Methods   See Also |

The  IATFTranslationServer  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Translate | Translate a model according to translationData settings |

# See Also

IATFTranslationServer Interface

Autodesk.Revit.DB Namespace