#### PathReinSpanSymbol Members

---

|  |
| --- |
| PathReinSpanSymbol Class   Methods   Properties   See Also |

The  PathReinSpanSymbol  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create | Creates a new instance of PathReinSpanSymbol in the project. |

# Properties

|  | Name | Description |
| --- | --- | --- |

# See Also

PathReinSpanSymbol Class

Autodesk.Revit.DB.Structure Namespace