#### FilledRegion Members

---

|  |
| --- |
| FilledRegion Class   Methods   Properties   See Also |

The  FilledRegion  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create(Document, ElementId, ElementId, IList CurveLoop ) | Creates a view-specific filled region from the given boundaries. |
| Public method Static member | Create(Document, ElementId, SketchPlane, IList CurveLoop ) | Creates a filled region on a sketch plane in a 3d model family. |
| Public method | GetBoundaries | Gets the boundaries. |
| Public method Static member | GetValidLineStyleIdsForFilledRegion | Gets the line style Ids which are permitted to be assigned to a filled region. |
| Public method Static member | IsValidFilledRegionTypeId | Indicates whether the given Id is a valid filled region type Id. |
| Public method Static member | IsValidLineStyleIdForFilledRegion | Indicates whether the given Id is a valid line style Id. |
| Public method | SetLineStyleId | Sets the line style Id for all boundaries. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsMasking | Indicates whether this element is a 'Filled Region or a 'Masking Region'. |

# See Also

FilledRegion Class

Autodesk.Revit.DB Namespace