#### AssemblyDifferenceMemberCount Members

---

|  |
| --- |
| AssemblyDifferenceMemberCount Class   Methods   Properties   See Also |

The  AssemblyDifferenceMemberCount  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Count1 | Number of members in the first assembly |
| Public property | Count2 | Number of members in the second assembly |

# See Also

AssemblyDifferenceMemberCount Class

Autodesk.Revit.DB Namespace