#### PointNode Members

---

|  |
| --- |
| PointNode Class   Methods   Properties   See Also |

The  PointNode  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | GetPoint | Returns the point object corresponding to the node. |

# Properties

|  | Name | Description |
| --- | --- | --- |

# See Also

PointNode Class

Autodesk.Revit.DB Namespace