#### RebarShape Members

---

|  |
| --- |
| RebarShape Class   Methods   Properties   See Also |

The  RebarShape  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create(Document, RebarShapeDefinition, RebarShapeMultiplanarDefinition, RebarStyle, StirrupTieAttachmentType, Int32, RebarHookOrientation, Int32, RebarHookOrientation, Int32) | Create a new instance of a Rebar Shape, which defines the shape of a rebar. |
| Public method Static member | Create(Document, RebarShapeDefinition, RebarShapeMultiplanarDefinition, RebarStyle, StirrupTieAttachmentType, Int32, RebarHookOrientation, Int32, RebarHookOrientation, Int32, Double, Double, ElementId, ElementId) | Create a new instance of a Rebar Shape, which defines the shape of a rebar. |
| Public method | GetAllowed | Check whether a bar type can be used with this RebarShape. Bar types are allowed by default. |
| Public method | GetCurvesForBrowser | Generate curves for the shape, as used in the shape browser. |
| Public method | GetDefaultHookAngle | Get the hook angle, expressed as an integral number of degrees (common values are 0, 90, 135, and 180). |
| Public method | GetDefaultHookOrientation | Get the hook orientation. |
| Public method | GetEndTreatmentTypeId | Gets the id of the EndTreatmentType at the specified rebar shape end. |
| Public method | GetHookRotationAngle | Gets the out of plane hook rotation angle at the specified end. |
| Public method | GetMultiplanarDefinition | The optional 3D structure of the shape. |
| Public method | GetRebarShapeDefinition | Return the definition of the RebarShape. |
| Public method | HasEndTreatment | Identifies if the rebar shape has end treatment at at least one end. |
| Public method | IsSameShapeIgnoringHooks | Test whether two shapes have equivalent definitions by comparing the RebarShapeDefinition and MultiplanarDefinition properties. |
| Public method | SetAllowed | Specify which bar types can be used with this RebarShape. Bar types are allowed by default. |
| Public method | SetEndTreatmentTypeId | Sets the EndTreatmentType id at the specified rebar shape end. |
| Public method | SetHookRotationAngle | Sets the out of plane hook rotation angle at the specified end. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | HigherEnd | Defines the higher end of rebar shape. |
| Public property | RebarStyle | Whether the shape represents a standard bar or a stirrup. |
| Public property | ShapeFamilyId | Get and return the rebar shape family id. |
| Public property | SimpleArc | Check whether this shape consists of a single arc, possibly with hooks. |
| Public property | SimpleLine | Check whether this shape consists of a single straight segment, possibly with hooks. |
| Public property | StirrupTieAttachment | The attachment type of stirrup ties and rebars. |

# See Also

RebarShape Class

Autodesk.Revit.DB.Structure Namespace