#### CableTrayConduitBase Members

---

|  |
| --- |
| CableTrayConduitBase Class   Methods   Properties   See Also |

The  CableTrayConduitBase  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | IsValidEndPoints | Identifies if two end points are valid. |
| Public method Static member | IsValidLevelId | Identifies if a level id is valid. |
| Public method | IsWithFitting | Return whether its cable tray/conduit type is with fitting |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | RunId | The id of the run to which this element belongs. |

# See Also

CableTrayConduitBase Class

Autodesk.Revit.DB.Electrical Namespace