#### LinearArray Members

---

|  |
| --- |
| LinearArray Class   Methods   Properties   See Also |

The  LinearArray  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | ArrayElementsWithoutAssociation | Creates a new linear array from a set of elements. |
| Public method Static member | ArrayElementWithoutAssociation | Creates a new linear array from a single element. |
| Public method Static member | Create(Document, View, ElementId, Int32, XYZ, ArrayAnchorMember) | Creates a new linear array element from a single element. |
| Public method Static member | Create(Document, View, ICollection ElementId , Int32, XYZ, ArrayAnchorMember) | Creates a new linear array element from a set of elements. |
| Public method | GetCopiedMemberIds | Retrieves the copied member Ids of the Array. (Overrides  BaseArray GetCopiedMemberIds  .) |
| Public method | GetOriginalMemberIds | Retrieves the original member Ids of the Array. (Overrides  BaseArray GetOriginalMemberIds  .) |
| Public method Static member | IsElementArrayable | Indicates whether the input element is arrayable. |
| Public method Static member | IsValidArraySize | This indicates whether the input count is valid. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | NumMembers | Retrieves or changes the number of the arrayed members. (Overrides  BaseArray NumMembers  .) |

# See Also

LinearArray Class

Autodesk.Revit.DB Namespace