#### AssetPropertyList Members

---

|  |
| --- |
| AssetPropertyList Class   Methods   Properties   See Also |

The  AssetPropertyList  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | AddNewAssetAsColor | Adds a new AssetPropertyDouble4 property to the list containing a value matching the input color. |
| Public method | AddNewAssetPropertyDouble | Adds a new AssetPropertyDouble containing the input value to this list. |
| Public method | AddNewAssetPropertyInteger | Adds a new AssetPropertyInteger containing the input value to this list. |
| Public method | GetValue | Gets a collection of properties stored in this property list. These properties are copied. |
| Public method | InsertNewAssetAsColor | Insert a new AssetPropertyDouble4 containing the input value to this list. |
| Public method | InsertNewAssetPropertyDouble | Inserts a new AssetPropertyDouble containing the input value to this list. |
| Public method | InsertNewAssetPropertyInteger | Insert a new AssetPropertyInteger containing the input value to this list. |
| Public method | IsValidValue | Check that value is valid. |
| Public method | RemoveAssetProperty | Remove the AssetProperty from the list. |
| Public method | SetValue | Sets collection of properties stored in this property list. |

# Properties

|  | Name | Description |
| --- | --- | --- |

# See Also

AssetPropertyList Class

Autodesk.Revit.DB.Visual Namespace