#### IIFCEntityTreeUIServer Members

---

|  |
| --- |
| IIFCEntityTreeUIServer Interface   Methods   See Also |

The  IIFCEntityTreeUIServer  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | ShowDialog | Shows dialog on managing IFCEntityTreeUI. |

# See Also

IIFCEntityTreeUIServer Interface

Autodesk.Revit.UI Namespace