#### FilterNumericValueRule Members

---

|  |
| --- |
| FilterNumericValueRule Class   Methods   Properties   See Also |

The  FilterNumericValueRule  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | GetEvaluator | Gets the evaluator that implements the test for this rule. |
| Public method | SetEvaluator | Sets the evaluator that implements the test for this rule. |

# Properties

|  | Name | Description |
| --- | --- | --- |

# See Also

FilterNumericValueRule Class

Autodesk.Revit.DB Namespace