#### AnalyticalBusData Members

---

|  |
| --- |
| AnalyticalBusData Class   Methods   Properties   See Also |

The  AnalyticalBusData  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | CurrentRating | The current rating value of the analytical bus. |
| Public property | TotalConnectedCurrent | The total connected current of the analytical bus. |
| Public property | Voltage | The voltage value of the analytical bus. |

# See Also

AnalyticalBusData Class

Autodesk.Revit.DB.Electrical Namespace