#### INavisworksExporter Members

---

|  |
| --- |
| INavisworksExporter Interface   Methods   See Also |

The  INavisworksExporter  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Export | The method that Revit will invoke to perform an export to Navisworks. |
| Public method | ValidateExportOptions | Determines if the inputs are valid, and returns an error message if not. |

# See Also

INavisworksExporter Interface

Autodesk.Revit.DB Namespace