#### ElementIntersectsFilter Members

---

|  |
| --- |
| ElementIntersectsFilter Class   Methods   Properties   See Also |

The  ElementIntersectsFilter  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | IsCategorySupported | Identifies if the input element is of a category supported by element intersection filters. |
| Public method Static member | IsElementSupported | Identifies if the input element is supported by element intersection filters. |

# Properties

|  | Name | Description |
| --- | --- | --- |

# See Also

ElementIntersectsFilter Class

Autodesk.Revit.DB Namespace