#### ExternalEvent Members

---

|  |
| --- |
| ExternalEvent Class   Methods   Properties   See Also |

The  ExternalEvent  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create | Creates an instance of external event. |
| Public method Static member | CreateJournalable | Creates an instance of external event which will have the ability to record its executions in the journal. |
| Public method | Dispose | Releases all resources used by the  ExternalEvent |
| Public method | Raise | Instructing Revit to raise (signal) the external event. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsPending | Checking whether an event has been raised but not yet executed. |

# See Also

ExternalEvent Class

Autodesk.Revit.UI Namespace