#### MemberForcesServiceData Members

---

|  |
| --- |
| MemberForcesServiceData Class   Methods   Properties   See Also |

The  MemberForcesServiceData  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  MemberForcesServiceData |
| Public method | GetCurrentElements | Returns the list of Ids of the current elements. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Document | The current document. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

MemberForcesServiceData Class

Autodesk.Revit.DB.Structure Namespace