#### MEPAnalyticalSystem Members

---

|  |
| --- |
| MEPAnalyticalSystem Class   Methods   Properties   See Also |

The  MEPAnalyticalSystem  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create | Creates a new analytical system |
| Public method | GetAirSystemData | Returns the air system data, null if not available. |
| Public method | GetWaterLoopData | Returns the water loop data, null if not available. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | AnalyticalSystemDomain | The type of analytical system. |

# See Also

MEPAnalyticalSystem Class

Autodesk.Revit.DB.Mechanical Namespace