#### Wall Members

---

|  |
| --- |
| Wall Class   Methods   Properties   See Also |

The  Wall  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | CanHaveProfileSketch | Checks whether this wall has or can have a profile sketch. |
| Public method Static member | Create(Document, IList Curve , Boolean) | Creates a non rectangular profile wall within the project using the default wall type. |
| Public method Static member | Create(Document, Curve, ElementId, Boolean) | Creates a new rectangular profile wall within the project using the default wall style. |
| Public method Static member | Create(Document, IList Curve , ElementId, ElementId, Boolean) | Creates a non rectangular profile wall within the project using the specified wall type. |
| Public method Static member | Create(Document, IList Curve , ElementId, ElementId, Boolean, XYZ) | Creates a non rectangular profile wall within the project using the specified wall type and normal vector. |
| Public method Static member | Create(Document, Curve, ElementId, ElementId, Double, Double, Boolean, Boolean) | Creates a new rectangular profile wall within the project using the specified wall type, height, and offset. |
| Public method | CreateProfileSketch | Creates a new Wall profile Sketch. |
| Public method | Flip | The wall orientation will be flipped. |
| Public method | GetStackedWallMemberIds | Get the sub walls which belongs to the wall. |
| Public method | IsWallCrossSectionValid | Checks whether the desired cross section is valid for the current wall. |
| Public method | RemoveProfileSketch | Reverts an edited wall to its original shape. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | CrossSection | Obtain the Wall Cross-section for this wall. |
| Public property | CurtainGrid | Get the grid object of a curtain wall |
| Public property | Flipped | Property to test whether the wall orientation is flipped. |
| Public property | IsStackedWall | Identifies if the wall is a stacked wall. |
| Public property | IsStackedWallMember | Identifies if the wall is a member of a stacked wall. |
| Public property | Orientation | The normal vector projected from the exterior side of the wall. |
| Public property | SketchId | Returns id of the profile sketch, or invalidElementId if sketch does not exist. |
| Public property | StackedWallOwnerId | Gets the stacked wall which contains this stacked wall member. |
| Public property | StructuralUsage | Retrieves or changes the wall's designated structural usage. |
| Public property | WallType | Retrieves or changes the type of the wall. |
| Public property | Width | Get the overall thickness of the wall. |

# See Also

Wall Class

Autodesk.Revit.DB Namespace