#### HostObject Members

---

|  |
| --- |
| HostObject Class   Methods   Properties   See Also |

The  HostObject  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | FindInserts | Gets the ids of the instances inserted into this host object. |

# Properties

|  | Name | Description |
| --- | --- | --- |

# See Also

HostObject Class

Autodesk.Revit.DB Namespace