#### ElectricalLoadAreaData Members

---

|  |
| --- |
| ElectricalLoadAreaData Class   Methods   Properties   See Also |

The  ElectricalLoadAreaData  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | CreateElectricalLoadAreas | Creates electrical load areas on all the empty plan circuits of the given level. |
| Public method | GetAreaBasedLoadIds | Gets the area based load ids of the electrical load area to be included. |
| Public method Static member | HasCircuitsWithoutElectricalLoadAreas | Checks whether there are any empty plan circuits in which there are no electrical load areas. |

# Properties

|  | Name | Description |
| --- | --- | --- |

# See Also

ElectricalLoadAreaData Class

Autodesk.Revit.DB.Electrical Namespace