#### AnalyticalMember Members

---

|  |
| --- |
| AnalyticalMember Class   Methods   Properties   See Also |

The  AnalyticalMember  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create | Creates a new instance of an Analytical Member within the project. |
| Public method | FlipCurve | Flip the Analytical Member |
| Public method | GetMemberForces | Gets the member forces associated with this Analytical Member. |
| Public method | GetReleaseConditions | Gets the release conditions associated with this Analytical Member. |
| Public method | GetReleaseType | Gets the release type. |
| Public method Static member | IsValidCurve | Verifies if the curve is valid for an Analytical Member. |
| Public method | IsValidSectionTypeId | Checks whether the family symbol id is allowed for Analytical Member as Section Type property. |
| Public method | SetCurve | Sets the curve for the Analytical Member. |
| Public method | SetMemberForces(MemberForces) | Sets Member Forces to Analytical Member. |
| Public method | SetMemberForces(Boolean, XYZ, XYZ) | Sets Member Forces to Analytical Member. |
| Public method | SetReleaseConditions | Sets Release Conditions to Analytical Member. |
| Public method | SetReleaseType | Sets the release type. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | CrossSectionRotation | This represents the cross-section rotation, in radians. |
| Public property | SectionTypeId | The id of the type from the structural Family assigned to the Analytical Member. |
| Public property | StructuralSectionShape | The structural section shape of the Analytical Member. |

# See Also

AnalyticalMember Class

Autodesk.Revit.DB.Structure Namespace