#### IPipePressureDropServer Members

---

|  |
| --- |
| IPipePressureDropServer Interface   Methods   See Also |

The  IPipePressureDropServer  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Calculate | Calculate the pipe pressure drop. |
| Public method | GetHtmlDescription | The method that Revit will invoke to get an HTML formatted description of the server. |
| Public method | GetInformationLink | The method that Revit will invoke to obtain a URL address which provides more information about the server. |

# See Also

IPipePressureDropServer Interface

Autodesk.Revit.DB.Plumbing Namespace