#### BRepBuilderSurfaceGeometry Members

---

|  |
| --- |
| BRepBuilderSurfaceGeometry Class   Methods   Properties   See Also |

The  BRepBuilderSurfaceGeometry  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create | Construct BRepBuilderSurfaceGeometry based on a permitted Revit Surface, including Plane and CylSurf. |
| Public method Static member | CreateNURBSSurface(Int32, Int32, IList Double , IList Double , IList XYZ , Boolean, BoundingBoxUV) | Construct a BRepBuilderSurfaceGeometry based on NURBS surface data, where the weights are not supplied. In this case, the NURBS surface will be a piecewise polynomial surface. |
| Public method Static member | CreateNURBSSurface(Int32, Int32, IList Double , IList Double , IList XYZ , IList Double , Boolean, BoundingBoxUV) | Construct BRepBuilderSurfaceGeometry based on NURBS surface data, where the weights are supplied. In this case, the NURBS surface will be a piecewise rational polynomial surface. |
| Public method | Dispose | Releases all resources used by the  BRepBuilderSurfaceGeometry |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

BRepBuilderSurfaceGeometry Class

Autodesk.Revit.DB Namespace