#### MechanicalSystem Members

---

|  |
| --- |
| MechanicalSystem Class   Methods   Properties   See Also |

The  MechanicalSystem  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create(Document, ElementId) | Creates a new instance of a mechanical system and adds it to the document. |
| Public method Static member | Create(Document, ElementId, String) | Creates a new instance of a mechanical system and adds it to the document. |
| Public method | GetFlow | Gets the flow of this mechanical system. |
| Public method | GetStaticPressure | Gets the static pressure of this mechanical system. |
| Public method | IsPressureDropServerMissing | Indicates if any pressure drop server which was used in the mechanical system is not available. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | BaseEquipmentConnector | The connector within the base equipment which is used to connect with the system. |
| Public property | DuctNetwork | The ducts and fittings contained within the system. |
| Public property | IsWellConnected | Indicates if the system is well connected or not. |
| Public property | SystemType | The type of this duct system. |

# See Also

MechanicalSystem Class

Autodesk.Revit.DB.Mechanical Namespace