#### FabricSheetType Members

---

|  |
| --- |
| FabricSheetType Class   Methods   Properties   See Also |

The  FabricSheetType  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | CreateDefaultFabricSheetType | Creates a new FabricSheetType object with a default name. |
| Public method | GetReinforcementRoundingManager | Returns an object for managing reinforcement rounding override settings. |
| Public method | GetWireItem | Gets the Wire stored in the FabricSheetType at the associated index. |
| Public method | IsCustom | Verifies if the type is Custom Fabric Sheet |
| Public method | IsValidMajorLapSplice | Identifies if the input value is valid to be applied as the major lap splice value for this FabricSheetType. |
| Public method | IsValidMinorLapSplice | Identifies if the input value is valid to be applied as the minor lap splice value for this FabricSheetType. |
| Public method | SetLayoutAsCustomPattern | Sets the minor and major layout patterns as Custom, while specifying the needed parameters for this pattern. |
| Public method | SetMajorLayoutAsActualSpacing | Sets the major layout pattern as ActualSpacing, while specifying the needed parameters for this pattern. |
| Public method | SetMajorLayoutAsFixedNumber | Sets the major layout pattern as FixedNumber, while specifying the needed parameters for this pattern. |
| Public method | SetMajorLayoutAsMaximumSpacing | Sets the major layout pattern as MaximumSpacing, while specifying the needed parameters for this pattern. |
| Public method | SetMajorLayoutAsNumberWithSpacing | Sets the major layout pattern as NumberWithSpacing, while specifying the needed parameters for this pattern. |
| Public method | SetMinorLayoutAsActualSpacing | Sets the minor layout pattern as ActualSpacing, while specifying the needed parameters for this pattern. |
| Public method | SetMinorLayoutAsFixedNumber | Sets the major layout pattern as FixedNumber, while specifying the needed parameters for this pattern. |
| Public method | SetMinorLayoutAsMaximumSpacing | Sets the major layout pattern as MaximumSpacing, while specifying the needed parameters for this pattern. |
| Public method | SetMinorLayoutAsNumberWithSpacing | Sets the major layout pattern as NumberWithSpacing, while specifying the needed parameters for this pattern. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | MajorDirectionWireType | The id of the FabricWireType to be used in the major direction. |
| Public property | MajorEndOverhang | The distance from the edge of the sheet to the last wire (measured in the major direction). |
| Public property | MajorLapSpliceLength | The lap splice length in the major direction. |
| Public property | MajorLayoutPattern | The layout pattern in the major direction. |
| Public property | MajorNumberOfWires | The number of wires used in the major direction (includes the first and last wires). |
| Public property | MajorReinforcementArea | The area of fabric divided by the spacing of the wire in the major direction. This method does not apply to custom fabric sheet |
| Public property | MajorSpacing | The spacing between the wires in the major direction (not including the overhangs). |
| Public property | MajorStartOverhang | The distance from the edge of the sheet to the first wire (measured in the major direction). |
| Public property | Material | The id of the material assigned to wires. |
| Public property | MinorDirectionWireType | The id of the FabricWireType to be used in the minor direction. |
| Public property | MinorEndOverhang | The distance from the edge of the sheet to the last wire (measured in the minor direction). |
| Public property | MinorLapSpliceLength | The lap splice length in the minor direction. |
| Public property | MinorLayoutPattern | The layout pattern in the minor direction. |
| Public property | MinorNumberOfWires | The number of wires used in the minor direction (includes the 1st and last wires). |
| Public property | MinorReinforcementArea | The area of fabric divided by the spacing of the wire in the minor direction. This method does not apply to custom fabric sheet |
| Public property | MinorSpacing | The spacing between the wires in the minor direction (not including the overhangs). |
| Public property | MinorStartOverhang | The distance from the edge of the sheet to the first wire (measured in the minor direction). |
| Public property | OverallLength | The length of the wire sheet (including overhangs) in the major direction. |
| Public property | OverallWidth | The length of the wire sheet (including overhangs) in the minor direction. |
| Public property | SheetMass | The sheet mass. |
| Public property | SheetMassUnit | The sheet mass per area unit. |

# See Also

FabricSheetType Class

Autodesk.Revit.DB.Structure Namespace