#### RebarConstrainedHandle Members

---

|  |
| --- |
| RebarConstrainedHandle Class   Methods   Properties   See Also |

The  RebarConstrainedHandle  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  RebarConstrainedHandle |
| Public method | GetCustomHandleTag | Returns the tag of the handle. The type of the handle should be 'CustomHandle'. |
| Public method | GetEdgeNumber | If the RebarConstrainedHandle's RebarHandleType is 'Edge', then this function will return the number of the edge that is driven by the handle. |
| Public method | GetHandleName | Gets the name of the handle. |
| Public method | GetHandleType | Returns the RebarHandleType of a RebarConstrainedHandle. |
| Public method | IsCustomHandle | Returns true if the RebarHandleType of the RebarConstrainedHandle is 'CustomHandle'. |
| Public method | IsEdgeHandle | Returns true if the RebarHandleType of the RebarConstrainedHandle is 'Edge'. |
| Public method | IsValid | Checks that the RebarConstrainedHandle still has access to valid Rebar handle data and that its RebarConstraintsManager is still valid. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

RebarConstrainedHandle Class

Autodesk.Revit.DB.Structure Namespace