#### FilterElement Members

---

|  |
| --- |
| FilterElement Class   Methods   Properties   See Also |

The  FilterElement  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | IsNameUnique(String) | Determines whether a potential filter element name is unique. |
| Public method Static member | IsNameUnique(Document, String) | Determines whether the given name could be applied to a new FilterElement, or if it could not be applied because the name is already in use. |

# Properties

|  | Name | Description |
| --- | --- | --- |

# See Also

FilterElement Class

Autodesk.Revit.DB Namespace