#### ReinforcementRoundingManager Members

---

|  |
| --- |
| ReinforcementRoundingManager Class   Methods   Properties   See Also |

The  ReinforcementRoundingManager  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  ReinforcementRoundingManager |
| Public method | GetLengthUnitTypeId | Gets the identifier of the length unit quantifying the reinforcement rounding values. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Element | The owner of the reinforcement rounding overrides. |
| Public property | IsActiveOnElement | Defines whether reinforcement rounding is activated for the particular element. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

ReinforcementRoundingManager Class

Autodesk.Revit.DB.Structure Namespace