#### MechanicalSystemType Members

---

|  |
| --- |
| MechanicalSystemType Class   Methods   Properties   See Also |

The  MechanicalSystemType  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create | Creates a new instance of a mechanical system type and adds it to the document. |
| Public method | ValidateRiseDropSymbolType | Confirms if the parameter is a valid HVAC rise/drop symbol type. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | RiseDropSettings | indicates the rise/drop symbol given the system type |

# See Also

MechanicalSystemType Class

Autodesk.Revit.DB.Mechanical Namespace