#### ProjectBrowserOptions Members

---

|  |
| --- |
| ProjectBrowserOptions Class   Methods   Properties   See Also |

The  ProjectBrowserOptions  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  ProjectBrowserOptions |
| Public method Static member | GetProjectBrowserOptions | Returns the current Revit instance's ProjectBrowserOptions. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | ShowViewPlacementOnSheetStatusIcons | Show the icons indicating view placement on sheet status. |

# See Also

ProjectBrowserOptions Class

Autodesk.Revit.UI Namespace