#### VertexStream Members

---

|  |
| --- |
| VertexStream Class   Methods   Properties   See Also |

The  VertexStream  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  VertexStream |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

VertexStream Class

Autodesk.Revit.DB.DirectContext3D Namespace