#### DockableFrameFocusChangedEventArgs Members

---

|  |
| --- |
| DockableFrameFocusChangedEventArgs Class   Methods   Properties   See Also |

The  DockableFrameFocusChangedEventArgs  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | FocusGained | True if the pane is being activated, false if it is being inactivated. |
| Public property | PaneId | The identifier for dockable pane. |

# See Also

DockableFrameFocusChangedEventArgs Class

Autodesk.Revit.UI.Events Namespace