#### Location Members

---

|  |
| --- |
| Location Class   Methods   Properties   See Also |

The  Location  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Move | Move the element within the project by a specified vector. |
| Public method | Rotate | Rotate the element within the project by a specified angle around a given axis. |

# Properties

|  | Name | Description |
| --- | --- | --- |

# See Also

Location Class

Autodesk.Revit.DB Namespace