#### LoadCase Members

---

|  |
| --- |
| LoadCase Class   Methods   Properties   See Also |

The  LoadCase  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create(Document, String, ElementId, ElementId) | Creates a new LoadCase. |
| Public method Static member | Create(Document, String, ElementId, LoadCaseCategory) | Creates a new LoadCase. |
| Public method | IsLoadCaseSubcategoryId | Checks whether provided element ID refer to subcategory of Structural Load Cases (  OST\_LoadCases  ) category - one of built-in or user defined. |
| Public method | IsLoadNatureId | Checks whether provided element ID refer to LoadNature element. |
| Public method Static member | IsNumberUnique | Checks that a given number is unique among all load cases. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | NatureId | The nature ID of the load case. |
| Public property | Number | Returns unique load case number. |
| Public property | SubcategoryId | Build-in or user defined subcategory of Structural Load Cases (  OST\_LoadCases  ) category. |

# See Also

LoadCase Class

Autodesk.Revit.DB.Structure Namespace