#### StructuralConnectionSettings Members

---

|  |
| --- |
| StructuralConnectionSettings Class   Methods   Properties   See Also |

The  StructuralConnectionSettings  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | GetStructuralConnectionSettings | Obtains the StructuralConnectionSettings object for the specified project document. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IncludeWarningControls | This property controls how Structural Connection Element is generated. If set to true and warnings are reported for given Element, additional yellow triangle is displayed. |

# See Also

StructuralConnectionSettings Class

Autodesk.Revit.DB.Structure Namespace