#### AnalyticalNodeData Members

---

|  |
| --- |
| AnalyticalNodeData Class   Methods   Properties   See Also |

The  AnalyticalNodeData  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  AnalyticalNodeData |
| Public method Static member | GetAnalyticalNodeData | Returns AnalyticalNodeData associated with this element, if it exists. |
| Public method | GetConnectionStatus | Returns the Connection Status for this Analytical Node. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

AnalyticalNodeData Class

Autodesk.Revit.DB.Structure Namespace