#### ImportInstance Members

---

|  |
| --- |
| ImportInstance Class   Methods   Properties   See Also |

The  ImportInstance  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create(Document, ElementId, View) | Creates a new instance of an existing DWG link type. |
| Public method Static member | Create(Document, View, ExternalResourceReference, DGNImportOptions, LinkLoadResult ) | Creates a new instance of DGN link type from an external resource reference and loads the linked file. |
| Public method Static member | Create(Document, View, ExternalResourceReference, DWGImportOptions, LinkLoadResult ) | Creates a new instance of DWG link type from an external resource reference and loads the linked file. |
| Public method Static member | Create(Document, View, ExternalResourceReference, ImportOptions3DM, LinkLoadResult ) | Creates a new instance of 3DM link type from an external resource reference and loads the linked file. |
| Public method Static member | Create(Document, View, ExternalResourceReference, OBJImportOptions, LinkLoadResult ) | Creates a new instance of OBJ link type from an external resource reference and loads the linked file. |
| Public method Static member | Create(Document, View, ExternalResourceReference, SATImportOptions, LinkLoadResult ) | Creates a new instance of SAT link type from an external resource reference and loads the linked file. |
| Public method Static member | Create(Document, View, ExternalResourceReference, SKPImportOptions, LinkLoadResult ) | Creates a new instance of SKP link type from an external resource reference and loads the linked file. |
| Public method Static member | Create(Document, View, ExternalResourceReference, STLImportOptions, LinkLoadResult ) | Creates a new instance of STL link type from an external resource reference and loads the linked file. |
| Public method Static member | Create(Document, View, String, DWGImportOptions, LinkLoadResult ) | Creates a new instance of DWG or DXF link type from a file path and loads the linked file. |
| Public method | GetVisibility | Gets the visibility for the import instance in a family document. |
| Public method | SetVisibility | Sets the visibility for the import instance in a family document. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsLinked | Identifies whether this instance is a linked object rather than imported one. |

# See Also

ImportInstance Class

Autodesk.Revit.DB Namespace