#### AppearanceAssetElement Members

---

|  |
| --- |
| AppearanceAssetElement Class   Methods   Properties   See Also |

The  AppearanceAssetElement  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create | Creates a new AppearanceAssetElement from an existing rendering asset. |
| Public method | Duplicate | Duplicates the appearance asset element. |
| Public method Static member | GetAppearanceAssetElementByName | Gets an AppearanceAssetElement by name. |
| Public method | GetRenderingAsset | Gets the rendering asset for the appearance asset element. |
| Public method | SetRenderingAsset | Sets the rendering asset for the appearance asset element. |

# Properties

|  | Name | Description |
| --- | --- | --- |

# See Also

AppearanceAssetElement Class

Autodesk.Revit.DB Namespace