#### TilePatterns Members

---

|  |
| --- |
| TilePatterns Class   Methods   Properties   See Also |

The  TilePatterns  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | GetTilePattern | Retrieve a TilePattern object from a built-in type. |

# Properties

|  | Name | Description |
| --- | --- | --- |

# See Also

TilePatterns Class

Autodesk.Revit.DB Namespace