#### MechanicalEquipmentSet Members

---

|  |
| --- |
| MechanicalEquipmentSet Class   Methods   Properties   See Also |

The  MechanicalEquipmentSet  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Add | Adds member element ids to the mechanical equipment set. |
| Public method Static member | AreElementsNotConnectedInSeries | Checks if the elements are not serially connected. |
| Public method Static member | AreValidMembers | Checks if these are valid members for mechanical equipment set. |
| Public method Static member | Create | Creates a new instance of a mechanical equipment set and adds it to the document. |
| Public method | GetMembers | Gets member element ids for the mechanical equipment set. |
| Public method | Remove | Removes member element ids from the mechanical equipment set. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Classification | The classification for the mechanical equipment set. |
| Public property | OnDuty | The number of pieces of mechanical equipment operating in parallel at any given time. |
| Public property | OnStandby | The number of pieces of mechanical equipment that are not operational at any given time. |

# See Also

MechanicalEquipmentSet Class

Autodesk.Revit.DB.Mechanical Namespace