#### ModelPath Members

---

|  |
| --- |
| ModelPath Class   Methods   Properties   See Also |

The  ModelPath  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Compare | Compares this ModelPath with another |
| Public method | Dispose | Releases all resources used by the  ModelPath |
| Public method | GetModelGUID | A GUID identifying the Revit cloud model. |
| Public method | GetProjectGUID | A GUID identifying the BIM 360 Docs or Autodesk Docs project to which the model is associated. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | CentralServerPath | The path to the location of the central Revit server or cloud. |
| Public property | CloudPath | Whether this path represents a path on an Autodesk server such as BIM360. |
| Public property | Empty | Whether this path is empty |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | Region | The region of the BIM 360 Docs or Autodesk Docs account and project which contains this model. |
| Public property | ServerPath | Whether this path is a server path (as opposed to a file path or cloud path) |

# See Also

ModelPath Class

Autodesk.Revit.DB Namespace