#### SharedParameterElement Members

---

|  |
| --- |
| SharedParameterElement Class   Methods   Properties   See Also |

The  SharedParameterElement  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create | Creates a new shared parameter element in the document representing the parameter stored in the input ExternalDefinition. |
| Public method Static member | Lookup | Finds the shared parameter element that corresponds to the given Guid. |
| Public method | ShouldHideWhenNoValue | Indicates whether the parameter should be hidden from the properties palette if it has no value. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | GuidValue | The Guid that identifies this shared parameter. |

# See Also

SharedParameterElement Class

Autodesk.Revit.DB Namespace