#### LoadCombination Members

---

|  |
| --- |
| LoadCombination Class   Methods   Properties   See Also |

The  LoadCombination  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create(Document, String) | Creates a new default LoadCombination. |
| Public method Static member | Create(Document, String, LoadCombinationType, LoadCombinationState) | Creates a new LoadCombination. |
| Public method | GetCaseAndCombinationIds | Returns collection of the load combination case and combination IDs. |
| Public method | GetComponents | Returns collection of the load combination components. |
| Public method | GetUsageIds | Returns collection of the load combination usage IDs. |
| Public method | SetComponents | Sets a collection of the load combination components. |
| Public method | SetUsageIds | Sets a collection of the load combination usage IDs. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsThirdPartyGenerated | Indicates if the load combination was created by API. |
| Public property | State | The state of the load combination. |
| Public property | Type | The type of the load combination. |

# See Also

LoadCombination Class

Autodesk.Revit.DB.Structure Namespace