#### DuctLining Members

---

|  |
| --- |
| DuctLining Class   Methods   Properties   See Also |

The  DuctLining  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create | Creates a new instance of duct lining. |

# Properties

|  | Name | Description |
| --- | --- | --- |

# See Also

DuctLining Class

Autodesk.Revit.DB.Mechanical Namespace