#### WaterLoopData Members

---

|  |
| --- |
| WaterLoopData Class   Methods   Properties   See Also |

The  WaterLoopData  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  WaterLoopData |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | ChillerType | The type of water chiller. Note this property change would reset the condenser water loop. |
| Public property | CondenserWaterLoopId | The water loop element id for the water cooled chiller. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | WaterLoopType | The type of water loop. Note this property change would reset other properties. |

# See Also

WaterLoopData Class

Autodesk.Revit.DB.Mechanical Namespace