#### AngularDimension Members

---

|  |
| --- |
| AngularDimension Class   Methods   Properties   See Also |

The  AngularDimension  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create | Creates a new instance of an Angular Dimension element within the project. |
| Public method | SetAngularRadius | Set radius of an Angular Dimension arc. The new radius of the arc. |

# Properties

|  | Name | Description |
| --- | --- | --- |

# See Also

AngularDimension Class

Autodesk.Revit.DB Namespace