#### RebarReinforcementData Members

---

|  |
| --- |
| RebarReinforcementData Class   Methods   Properties   See Also |

The  RebarReinforcementData  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create | Creates a new instance of RebarReinforcementData, or    a null reference (  Nothing  in Visual Basic)  if the operation fails. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | End | The end of the rebar. The end should be 0 or 1. |
| Public property | RebarId | The id of the Rebar |

# See Also

RebarReinforcementData Class

Autodesk.Revit.DB.Structure Namespace