#### HostFlagAreaOn Property

---

|  |
| --- |
| BuiltInFailures RebarSystemFailures Class   See Also |

The Area Reinforcement element was created in a document with the Host Structural Rebar setting on, and cannot be transferred into this document, which has the setting off.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId HostFlagAreaOn { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property HostFlagAreaOn As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ HostFlagAreaOn { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures RebarSystemFailures Class

Autodesk.Revit.DB Namespace