#### PreviewFamilyVisibilityMode Enumeration

---

|  |
| --- |
| See Also |

Modes that control visibility of family elements depending on the currently applied Element Visibility Settings of a view.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  **Since:**  2016 Subscription Update

# Syntax

| C# |
| --- |
| ``` public enum PreviewFamilyVisibilityMode ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration PreviewFamilyVisibilityMode ``` |

| Visual C++ |
| --- |
| ``` public enum class PreviewFamilyVisibilityMode ``` |

# Members

| Member name | Description |
| --- | --- |
| Off | Element Visibility is not applied. All family elements visible. |
| On | Element Visibility of a view is applied to show visible elements only. Elements that are cut by a reference plane will be shown with their respective cut geometry. |
| Uncut | Element Visibility of a view is applied to show elements visible if instance is not cut. Note that this state is only available in certain views, such as floor plan and ceilings. |

# Remarks

Values of this mode can be set or obtained for any view that supports it by accessing the  [!:Autodesk::Revit::DB::TemporaryViewModes::PreviewFamilyVisibility]  property.

# See Also

Autodesk.Revit.DB Namespace