#### DividedSurfaceMultipleIntersBetweenOppositeVirtualGrids Property

---

|  |
| --- |
| BuiltInFailures DividedSurfaceFailures Class   See Also |

There are multiple intersections between splitting chain of virtual splitters defined by these elements and so one of the virtual splitters will be ignored

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId DividedSurfaceMultipleIntersBetweenOppositeVirtualGrids { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property DividedSurfaceMultipleIntersBetweenOppositeVirtualGrids As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ DividedSurfaceMultipleIntersBetweenOppositeVirtualGrids { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures DividedSurfaceFailures Class

Autodesk.Revit.DB Namespace