#### DividedSurfaceSingleCurveMultipleIntersBetweenOppositeVirtualGrids Property

---

|  |
| --- |
| BuiltInFailures DividedSurfaceFailures Class   See Also |

There are curves in splitting chain of virtual splitters defined by these elements which intersect each other multiple times and so one of the virtual splitters will be ignored

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId DividedSurfaceSingleCurveMultipleIntersBetweenOppositeVirtualGrids { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property DividedSurfaceSingleCurveMultipleIntersBetweenOppositeVirtualGrids As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ DividedSurfaceSingleCurveMultipleIntersBetweenOppositeVirtualGrids { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures DividedSurfaceFailures Class

Autodesk.Revit.DB Namespace