#### CannotSplitJoinHostsInplaceFamilies Property

---

|  |
| --- |
| BuiltInFailures WallFailures Class   See Also |

Can't split/join this host because there are instances of In-place Families that cut openings into it. Edit or delete instances first so they don't cut into the host to be split or joined.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId CannotSplitJoinHostsInplaceFamilies { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CannotSplitJoinHostsInplaceFamilies As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ CannotSplitJoinHostsInplaceFamilies { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures WallFailures Class

Autodesk.Revit.DB Namespace