#### CannotSplitOldMullions Property

---

|  |
| --- |
| BuiltInFailures CurtainWallFailures Class   See Also |

Split does not work on curtain walls containing mullions created in Revit prior to version 4.0. You may delete the mullions, place them again, and then proceed with splitting the wall.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId CannotSplitOldMullions { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CannotSplitOldMullions As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ CannotSplitOldMullions { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures CurtainWallFailures Class

Autodesk.Revit.DB Namespace