#### RebarConstraintWarning Property

---

|  |
| --- |
| BuiltInFailures RebarFailures Class   See Also |

Structural rebar have automatic constraints that may conflict with dimensional constraints. Using dimensional constraints with structural rebar is not recommended and should be avoided.\nGrouped structural rebar is the only exception to this recommendation, since the automatic constraints are removed on grouped rebar.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId RebarConstraintWarning { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RebarConstraintWarning As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ RebarConstraintWarning { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures RebarFailures Class

Autodesk.Revit.DB Namespace