#### SetDefaultElementOrder Method

---

|  |
| --- |
| StructuralConnectionHandler Class   See Also |

Sorts the connected elements connection according to structural categories, element materials and geometries. The steel element is set rather than an element of other material. The priorities of the elements are set according structural categories in following order: columns, framings, walls, foundations, floors. In case of several Structural Framing elements order is determined by cutting - the cutting element is set as the primary one rather than element being cut.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 19.0.0.0 (19.0.0.405)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public void SetDefaultElementOrder() ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetDefaultElementOrder ``` |

| Visual C++ |
| --- |
| ``` public: void SetDefaultElementOrder() ``` |

# See Also

StructuralConnectionHandler Class

Autodesk.Revit.DB.Structure Namespace