#### FabricationPartExceededAngleFlexToleranceWarning Property

---

|  |
| --- |
| BuiltInFailures MEPFabricationFailures Class   See Also |

The angle flex is greater than the maximum angle flex tolerance defined by the fabrication part. Connections with this part may not be properly aligned and may appear to be skewed.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId FabricationPartExceededAngleFlexToleranceWarning { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property FabricationPartExceededAngleFlexToleranceWarning As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ FabricationPartExceededAngleFlexToleranceWarning { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures MEPFabricationFailures Class

Autodesk.Revit.DB Namespace