#### CannotAddMorePolesToCircuit Property

---

|  |
| --- |
| BuiltInFailures ElectricalFailures Class   See Also |

Empty slots are unavailable to hold the number of poles you specified for this spare. \nTo add more poles to this spare, you must free up slots by moving the circuits below the spare.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId CannotAddMorePolesToCircuit { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CannotAddMorePolesToCircuit As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ CannotAddMorePolesToCircuit { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures ElectricalFailures Class

Autodesk.Revit.DB Namespace