#### CurtainPanelNotBelongsToElement Property

---

|  |
| --- |
| BuiltInFailures CurtainGridFamilyFailures Class   See Also |

Curtain element Panel doesn't belong to Curtain element. In merging, you must select the version of a Curtain element that has had Panels added to it.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId CurtainPanelNotBelongsToElement { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CurtainPanelNotBelongsToElement As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ CurtainPanelNotBelongsToElement { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures CurtainGridFamilyFailures Class

Autodesk.Revit.DB Namespace