#### RailTypeChangeInconsistancyWarningWithResetBtn Property

---

|  |
| --- |
| BuiltInFailures StairRampFailures Class   See Also |

Some rail type changes are not consistent with your rail instances customization in this project, you can reset them to make them corresponding with your changes.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId RailTypeChangeInconsistancyWarningWithResetBtn { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RailTypeChangeInconsistancyWarningWithResetBtn As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ RailTypeChangeInconsistancyWarningWithResetBtn { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures StairRampFailures Class

Autodesk.Revit.DB Namespace