#### DividedSurfaceCurveFromChainMultipleIntersWithDivLine Property

---

|  |
| --- |
| BuiltInFailures DividedSurfaceFailures Class   See Also |

A curve from the chain formed by these curve elements either intersects a gridline more than once or coincides with it and so the chain will be ignored

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId DividedSurfaceCurveFromChainMultipleIntersWithDivLine { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property DividedSurfaceCurveFromChainMultipleIntersWithDivLine As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ DividedSurfaceCurveFromChainMultipleIntersWithDivLine { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures DividedSurfaceFailures Class

Autodesk.Revit.DB Namespace