#### InstMayCutMoreOrFewerHosts Property

---

|  |
| --- |
| BuiltInFailures FamilyFailures Class   See Also |

Insert may be cutting fewer or more hosts than needed. The problem may be solved by forcing regeneration, e.g. by moving the insert out and back by a tiny distance in any direction.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId InstMayCutMoreOrFewerHosts { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property InstMayCutMoreOrFewerHosts As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ InstMayCutMoreOrFewerHosts { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures FamilyFailures Class

Autodesk.Revit.DB Namespace