#### WinderRunCreationFailure Property

---

|  |
| --- |
| BuiltInFailures StairRampFailures Class   See Also |

The relationship between the current values of Actual Run Width, Minimum Width at Inside Boundary, and Parallel Treads at Start or End does not support the creation of the winder run.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId WinderRunCreationFailure { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property WinderRunCreationFailure As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ WinderRunCreationFailure { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures StairRampFailures Class

Autodesk.Revit.DB Namespace