#### RebarShapeConstraint Members

---

|  |
| --- |
| RebarShapeConstraint Class   Methods   Properties   See Also |

The  RebarShapeConstraint  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  RebarShapeConstraint |
| Public method | GetParamId | Return the Id of the parameter associated with this constraint. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

RebarShapeConstraint Class

Autodesk.Revit.DB.Structure Namespace