#### FamilyInstancePlacingArgs Members

---

|  |
| --- |
| FamilyInstancePlacingArgs Class   Methods   Properties   See Also |

The  FamilyInstancePlacingArgs  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  FamilyInstancePlacingArgs |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | ActiveView | The active view |
| Public property | IsBanned | Indicates if the cursor is banned or not. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | StatusMessage | The message to be shown on the status bar |
| Public property | TooltipMessage | The message to be shown via tooltip |

# See Also

FamilyInstancePlacingArgs Class

Autodesk.Revit.UI Namespace