#### RebarContainerParameterManager Members

---

|  |
| --- |
| RebarContainerParameterManager Class   Methods   Properties   See Also |

The  RebarContainerParameterManager  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | AddOverride(ElementId, ElementId) | Adds an override for the given parameter as its value will be displayed for the Rebar Container element. |
| Public method | AddOverride(ElementId, Double) | Adds an override for the given parameter as its value will be displayed for the Rebar Container element. |
| Public method | AddOverride(ElementId, Int32) | Adds an override for the given parameter as its value will be displayed for the Rebar Container element. |
| Public method | AddOverride(ElementId, String) | Adds an override for the given parameter as its value will be displayed for the Rebar Container element. |
| Public method | AddSharedParameterAsOverride | Adds a shared parameter as one of the parameter overrides stored by this Rebar Container element. |
| Public method | ClearOverrides | Clears any overridden values from all parameters of the associated RebarContainer element. |
| Public method | Dispose | Releases all resources used by the  RebarContainerParameterManager |
| Public method | GetDoubleOverrideValue | Get the double value for an overriden parameter. |
| Public method | GetElementIdOverrideValue | Get the ElementId value for an overriden parameter. |
| Public method | GetIntOverrideValue | Get the integer value for an overriden parameter. |
| Public method | GetStringOverrideValue | Get the string value for an overriden parameter. |
| Public method | IsOverriddenParameterModifiable | Checks if overridden parameter is modifiable. |
| Public method | IsParameterOverridden | Checks if the parameter has an override |
| Public method | IsRebarContainerParameter | Checks if the parameter is a Rebar Container parameter |
| Public method | RemoveOverride | Removes an overridden value from the given parameter. |
| Public method | SetOverriddenParameterModifiable | Sets this overridden parameter to be modifiable. |
| Public method | SetOverriddenParameterReadonly | Sets this overridden parameter to be readonly. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

RebarContainerParameterManager Class

Autodesk.Revit.DB.Structure Namespace