#### LinkNode Members

---

|  |
| --- |
| LinkNode Class   Methods   Properties   See Also |

The  LinkNode  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | GetDocument | Returns the document associated with the link. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | SymbolId | Identifies the Id of the symbol associated with the node. |

# See Also

LinkNode Class

Autodesk.Revit.DB Namespace