#### BoundaryConditions Members

---

|  |
| --- |
| BoundaryConditions Class   Methods   Properties   See Also |

The  BoundaryConditions  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | GetBoundaryConditionsType | Returns the boundary conditions type. |
| Public method | GetCurve | Returns curve that define geometry of the line boundary conditions. |
| Public method | GetDegreesOfFreedomCoordinateSystem | Gets the origin and rotation of coordinate system that is used by translation and rotation parameters, like X Translation or Z Rotation. |
| Public method | GetLoops | Returns curve loops that define geometry of the area boundary conditions. |
| Public method | GetOrientTo | Returns the boundary conditions orientation option. |
| Public method | SetOrientTo | Sets the boundary condition orientation option. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | AssociatedLoadId | The Id of the internal load element associated with a boundary conditions. |
| Public property | HostElementId | The host element Id for the boundary conditions. |
| Public property | Point | Returns the position of point boundary conditions. |

# See Also

BoundaryConditions Class

Autodesk.Revit.DB.Structure Namespace