#### CurveLoopsProfile Members

---

|  |
| --- |
| CurveLoopsProfile Class   Methods   Properties   See Also |

The  CurveLoopsProfile  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Profile | Returns the curve loops of the profile. |

# See Also

CurveLoopsProfile Class

Autodesk.Revit.DB Namespace