#### ViewDrafting Members

---

|  |
| --- |
| ViewDrafting Class   Methods   Properties   See Also |

The  ViewDrafting  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create | Creates a new ViewDrafting in the model. |

# Properties

|  | Name | Description |
| --- | --- | --- |

# See Also

ViewDrafting Class

Autodesk.Revit.DB Namespace