#### RebarHandlesData Members

---

|  |
| --- |
| RebarHandlesData Class   Methods   Properties   See Also |

The  RebarHandlesData  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | AddCustomHandle | Adds a new handle definition to the rebar. This information is set to the rebar after the API execution is finished successfully. |
| Public method | Dispose | Releases all resources used by the  RebarHandlesData |
| Public method | GetCustomHandles | Gets the handle definitions for the rebar that were added. |
| Public method | GetEndHandle | Gets the end handle tag. |
| Public method | GetStartHandle | Gets the start handle tag. |
| Public method | SetEndHandle | Sets the end handle tag. This information is set to the rebar after the API execution is finished successfully. |
| Public method | SetStartHandle | Sets the start handle tag. This information is set to the rebar after the API execution is finished successfully. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

RebarHandlesData Class

Autodesk.Revit.DB.Structure Namespace