#### PipePressureDropData Members

---

|  |
| --- |
| PipePressureDropData Class   Methods   Properties   See Also |

The  PipePressureDropData  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  PipePressureDropData |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | CategoryId | The category id of pipe curves. It will be OST\_PipeCurves, OST\_FlexPipeCurves, or OST\_PlaceHolderPipes. |
| Public property | Coefficient | The coefficient of the pipe. |
| Public property | Density | The density of the pipe. Units: (kg/ftÂ³). |
| Public property | Flow | The flow of the pipe. Units: (ftÂ³/s). |
| Public property | FlowState | The flowState of the pipe. |
| Public property | Friction | The friction of the pipe. Units: (kg/(ftÂ²Â·sÂ²)). |
| Public property | FrictionFactor | The friction factor of the pipe. |
| Public property | InsideDiameter | The inside diameter of the pipe. Units: (ft). |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | KLevel | The system calculation level. |
| Public property | Length | The length of the pipe. Units: (ft). |
| Public property | NominalDiameter | The nominal diameter of the pipe. Units: (ft). |
| Public property | OutsideDiameter | The outside diameter of the pipe. Units: (ft). |
| Public property | PressureDrop | The pressure drop of the pipe. Units: (kg/(ftÂ·sÂ²)). |
| Public property | RelativeRoughness | The relative roughness of the pipe. |
| Public property | ReynoldsNumber | The reynolds number of the pipe. |
| Public property | Roughness | The roughness of the pipe. Units: (ft). |
| Public property | Velocity | The velocity of the pipe. Units: (ft/s) . |
| Public property | VelocityPressure | The velocity pressure of the pipe. Units: (kg/(ftÂ·sÂ²)) |
| Public property | Viscosity | The viscosity of the pipe. Units: (kg/(ftÂ·s)). |

# See Also

PipePressureDropData Class

Autodesk.Revit.DB.Plumbing Namespace