#### AssetPropertyDoubleArray4d Members

---

|  |
| --- |
| AssetPropertyDoubleArray4d Class   Methods   Properties   See Also |

The  AssetPropertyDoubleArray4d  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | GetValueAsColor | Gets the value property as a color. |
| Public method | GetValueAsDoubles | Gets the value property as doubles. |
| Public method | IsValidValue(IList Double ) | Checks that the value is a valid value for this property. |
| Public method | IsValidValue(Color) | Checks that the value is a valid value for this property. |
| Public method | SetValueAsColor | Sets the value property as a color. |
| Public method | SetValueAsDoubles | Sets the value of the property. |

# Properties

|  | Name | Description |
| --- | --- | --- |

# See Also

AssetPropertyDoubleArray4d Class

Autodesk.Revit.DB.Visual Namespace