#### ConceptualConstructionType Members

---

|  |
| --- |
| ConceptualConstructionType Class   Methods   Properties   See Also |

The  ConceptualConstructionType  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | GetAllConceptualConstructionsForCategory | Get all the ids of constructions applicable to the input massSubCategory |
| Public method Static member | GetFloorOrSlabConstructionType | Get a Floor or Slab ConceptualConstructionType by its ConceptualConstructionFloorSlabType. |
| Public method | GetGBSId | Gets the Green Building Studio identifier associated with the construction. |
| Public method Static member | GetOpeningConstructionType | Get an Opening ConceptualConstructionType by its ConceptualConstructionOpeningType. |
| Public method Static member | GetRoofConstructionType | Get a Roof ConceptualConstructionType by its ConceptualConstructionRoofType. |
| Public method Static member | GetShadeConstructionType | Get a Shade ConceptualConstructionType by its ConceptualConstructionShadeType. |
| Public method Static member | GetWallConstructionType | Get a Wall ConceptualConstructionType by its ConceptualConstructionWallType. |
| Public method Static member | GetWindowOrSkylightConstructionType | Get a Window or Skylight ConceptualConstructionType by its ConceptualConstructionWindowSkylightType. |
| Public method Static member | IsValidConceptualConstructionId | Indicates if the ElementId is an id of a ConceptualConstructionType. |
| Public method Static member | IsValidConceptualConstructionIdForCategory | Indicate if a ConceptualConstruction is appropriate to assign to a MassSurfaceData of a particular Mass subcategory. |
| Public method Static member | IsValidSubcategoryForMassSurfaceDatas | Validate if a subcategory is appropriate for assignment to Massing surfaces (MassSurfaceData). This is the list of acceptable values:  1. OST\_MassInteriorWall 2. OST\_MassExteriorWall 3. OST\_MassExteriorWallUnderground 4. OST\_MassRoof 5. OST\_MassFloor 6. OST\_MassSlab 7. OST\_MassShade 8. OST\_MassGlazing 9. OST\_MassSkylights 10. OST\_MassOpening |
| Public method | IsValidSurfaceSubcategoryForConstruction | Indicates if this ConceptualConstructionType is appropriate for the input MassSurfaceData subcategory. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | MassSurfaceSubCategoryId | The surface type subcategory element id associated with the ConceptualConstructionType. |
| Public property | MaterialId | Material used for visualization of this construction. |

# See Also

ConceptualConstructionType Class

Autodesk.Revit.DB.Analysis Namespace