#### PipeInsulation Members

---

|  |
| --- |
| PipeInsulation Class   Methods   Properties   See Also |

The  PipeInsulation  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create | Creates a new instance of pipe insulation. |

# Properties

|  | Name | Description |
| --- | --- | --- |

# See Also

PipeInsulation Class

Autodesk.Revit.DB.Plumbing Namespace