#### MultiSegmentGrid Members

---

|  |
| --- |
| MultiSegmentGrid Class   Methods   Properties   See Also |

The  MultiSegmentGrid  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | AreGridsInSameMultiSegmentGrid | Determine whether two Grids are members of the same GridChain. |
| Public method Static member | Create | Create a MultiSegmentGrid element from the specified curve loop. |
| Public method | GetGridIds | Get the element ids of the Grids that make up this MultiSegmentGrid. |
| Public method Static member | GetMultiSegementGridId | Retrieve the element id of the MultiSegmentGrid of which the specified Grid is a member. |
| Public method Static member | IsValidCurveLoop | Identifies whether the specified curve loop is valid for creation of a MultiSegmentGrid. |
| Public method Static member | IsValidSketchPlaneId | Identifies whether provided element id corresponds to a SketchPlane that is valid for GridChain creation. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Text | name shared by grids in this MultiSegmentGrid |

# See Also

MultiSegmentGrid Class

Autodesk.Revit.DB Namespace