#### PipingSystem Members

---

|  |
| --- |
| PipingSystem Class   Methods   Properties   See Also |

The  PipingSystem  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | CanBeHydraulicLoopBoundary | Checks if the element can be used as a hydraulic loop boundary. |
| Public method Static member | Create(Document, ElementId) | Creates a new instance of a piping system and adds it to the document. |
| Public method Static member | Create(Document, ElementId, String) | Creates a new instance of a piping system and adds it to the document. |
| Public method Static member | CreateHydraulicSeparation | Creates new system which is hydraulically separated from the existing system. |
| Public method Static member | DeleteHydraulicSeparation | Deletes hydraulically separated systems and merges the system components into the connected system. |
| Public method | GetFixtureUnits | Gets the fixture units of this piping system. |
| Public method | GetFlow | Gets the flow of this piping system. |
| Public method | GetPumpSets | Gets the set of element Id's for all pump sets in the system, if any. |
| Public method | GetStaticPressure | Gets the static pressure of this piping system. |
| Public method | GetVolume | Gets the volume of this piping system. |
| Public method | IsFlowServerMissing | Indicates if any flow server which was used in the piping system is not available. |
| Public method Static member | IsHydraulicLoopBoundary | Checks if the element is a valid hydraulic loop boundary. |
| Public method | IsPressureDropServerMissing | Indicates if any pressure drop server which was used in the piping system is not available. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | BaseEquipmentConnector | The connector within base equipment which is used to connect with system. |
| Public property | IsWellConnected | Indicates if the system is well connected or not. |
| Public property | PipingNetwork | Pipes and fittings which are contained in this system. |
| Public property | SystemType | The type of this piping system. |

# See Also

PipingSystem Class

Autodesk.Revit.DB.Plumbing Namespace