#### FaceSilhouetteNode Members

---

|  |
| --- |
| FaceSilhouetteNode Class   Methods   Properties   See Also |

The  FaceSilhouetteNode  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | GetFace | Returns the Face object corresponding to the node. |

# Properties

|  | Name | Description |
| --- | --- | --- |

# See Also

FaceSilhouetteNode Class

Autodesk.Revit.DB Namespace