#### MeshTriangle Members

---

|  |
| --- |
| MeshTriangle Class   Methods   Properties   See Also |

The  MeshTriangle  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Index | The index of the vertex in the Vertices array of the mesh, for indexed access. |
| Public property | Vertex | A vertex of the triangle. |

# See Also

MeshTriangle Class

Autodesk.Revit.DB Namespace