#### RebarHandleNameData Members

---

|  |
| --- |
| RebarHandleNameData Class   Methods   Properties   See Also |

The  RebarHandleNameData  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  RebarHandleNameData |
| Public method | GetCustomHandleTag | Gets the handle tag for which we need to specify the name. |
| Public method | SetCustomHandleName | Sets the name of the handle. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

RebarHandleNameData Class

Autodesk.Revit.DB.Structure Namespace