#### LinkedResourceOpenedEventArgs Members

---

|  |
| --- |
| LinkedResourceOpenedEventArgs Class   Methods   Properties   See Also |

The  LinkedResourceOpenedEventArgs  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | LinkedResourcePathName | Path of the linked resource. |
| Public property | ResourceType | The desired linked resource type. |
| Public property | ResourceTypeId | Element id of the linked resource. |

# See Also

LinkedResourceOpenedEventArgs Class

Autodesk.Revit.DB.Events Namespace