#### RebarShapeVertex Members

---

|  |
| --- |
| RebarShapeVertex Class   Methods   Properties   See Also |

The  RebarShapeVertex  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  RebarShapeVertex |
| Public method | GetConstraints | Retrieve the list of constraints associated with this vertex. |
| Public method | SetConstraints | Assign a new list of constraints to this vertex. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | BendAngle | The range of permissible angles at this bend. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | Turn | The sense of the turn. The Turn property must be set to Left or Right on each internal vertex before the RebarShapeDefinitionBySegments is used. Default is permissible for the first and last vertex, since they do not correspond to bends. |

# See Also

RebarShapeVertex Class

Autodesk.Revit.DB.Structure Namespace