#### AssemblyCodeTable Members

---

|  |
| --- |
| AssemblyCodeTable Class   Methods   Properties   See Also |

The  AssemblyCodeTable  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | GetAssemblyCodeTable | Returns the AssemblyCodeTable for the specified document. |

# Properties

|  | Name | Description |
| --- | --- | --- |

# See Also

AssemblyCodeTable Class

Autodesk.Revit.DB Namespace