#### PolylineNode Members

---

|  |
| --- |
| PolylineNode Class   Methods   Properties   See Also |

The  PolylineNode  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | GetPolyline | Returns the polyline object corresponding to the node. |

# Properties

|  | Name | Description |
| --- | --- | --- |

# See Also

PolylineNode Class

Autodesk.Revit.DB Namespace