#### FieldDomainPoints Members

---

|  |
| --- |
| FieldDomainPoints Class   Methods   Properties   See Also |

The  FieldDomainPoints  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  FieldDomainPoints |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

FieldDomainPoints Class

Autodesk.Revit.DB.Analysis Namespace