#### PipeSegment Members

---

|  |
| --- |
| PipeSegment Class   Methods   Properties   See Also |

The  PipeSegment  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create | Creates a new instance of a PipeSegment and adds it to the document. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | ScheduleTypeId | The ElementId of the PipeScheduleType. |

# See Also

PipeSegment Class

Autodesk.Revit.DB.Plumbing Namespace