#### ElectricalAnalyticalNode Members

---

|  |
| --- |
| ElectricalAnalyticalNode Class   Methods   Properties   See Also |

The  ElectricalAnalyticalNode  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | CanConnectToUpstreamNode | Verifies that the current node can connect to the upstream node. |
| Public method | CanDisconnectFromUpstreamNode | Verifies that the current node can disconnect from the upstream node. |
| Public method | ConnectToUpstreamNode | Connects to upstream node. |
| Public method Static member | Create | Creates an electrical analytical node. |
| Public method | DisconnectFromUpstreamNode | Disconnects from upstream node. |
| Public method | GetAnalyticalPropertyData | Gets the electrical analytical node property data,    a null reference (  Nothing  in Visual Basic)  if not available. |
| Public method | GetDownstreamNodeIds | Gets the downstream node ids. |
| Public method | GetUpstreamNodeIds | Gets upstream node ids. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | NodeType | The type of electrical analytical node. |
| Public property | TotalLoad | The Total Connected Load. |

# See Also

ElectricalAnalyticalNode Class

Autodesk.Revit.DB.Electrical Namespace