#### AssetPropertyDoubleArray2d Members

---

|  |
| --- |
| AssetPropertyDoubleArray2d Class   Methods   Properties   See Also |

The  AssetPropertyDoubleArray2d  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Value | Get the value of the property |

# See Also

AssetPropertyDoubleArray2d Class

Autodesk.Revit.DB.Visual Namespace