#### PointOnEdge Members

---

|  |
| --- |
| PointOnEdge Class   Methods   Properties   See Also |

The  PointOnEdge  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | GetEdgeReference | Get a copy of the edge or curve reference. |
| Public method | SetEdgeReference | Change the edge or curve reference. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | LocationOnCurve | The point location on curve. |

# See Also

PointOnEdge Class

Autodesk.Revit.DB Namespace