#### SpatialElementCalculationLocation Members

---

|  |
| --- |
| SpatialElementCalculationLocation Class   Methods   Properties   See Also |

The  SpatialElementCalculationLocation  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | MarkerPosition | The position of the spatial element calculation location marker. |

# See Also

SpatialElementCalculationLocation Class

Autodesk.Revit.DB Namespace