#### FormulaManager Members

---

|  |
| --- |
| FormulaManager Class   Methods   Properties   See Also |

The  FormulaManager  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  FormulaManager |
| Public method Static member | Evaluate | Evaluates value of the formula |
| Public method Static member | GetFunctions | Gets list of function names supported by formula engine |
| Public method Static member | GetOperators | Gets list of operator names supported by formula engine |
| Public method Static member | Validate | Validates the formuls |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

FormulaManager Class

Autodesk.Revit.DB Namespace