#### AssetPropertyDistance Members

---

|  |
| --- |
| AssetPropertyDistance Class   Methods   Properties   See Also |

The  AssetPropertyDistance  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | GetUnitTypeId | Gets the identifier of the unit quantifying the distance property. |
| Public method | IsValidValue | Checks that the value is a valid value for this property. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Value | Value of the property. |

# See Also

AssetPropertyDistance Class

Autodesk.Revit.DB.Visual Namespace