#### ProjectLocation Members

---

|  |
| --- |
| ProjectLocation Class   Methods   Properties   See Also |

The  ProjectLocation  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create | Create an instance of ProjectLocation in the document. |
| Public method | Duplicate | Generate a copy of this project location with the specified name. |
| Public method | GetProjectPosition | Gets the coordinates of a point in the ProjectLocation's coordinate system. |
| Public method | GetSiteLocation | Gets the site location to which this project location refers. |
| Public method Static member | IsProjectLocationNameUnique | Verifies that there is no existing ProjectLocation with the given name belonging to the given SiteLocation. |
| Public method | SetProjectPosition | Sets the coordinates of a point in the ProjectLocation's coordinate system. |

# Properties

|  | Name | Description |
| --- | --- | --- |

# See Also

ProjectLocation Class

Autodesk.Revit.DB Namespace