#### Conduit Members

---

|  |
| --- |
| Conduit Class   Methods   Properties   See Also |

The  Conduit  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create | Creates a new instance of conduit. |
| Public method Static member | IsValidConduitType | Identifies if a conduit type is valid. |

# Properties

|  | Name | Description |
| --- | --- | --- |

# See Also

Conduit Class

Autodesk.Revit.DB.Electrical Namespace