#### AnalyticalToPhysicalAssociationManager Members

---

|  |
| --- |
| AnalyticalToPhysicalAssociationManager Class   Methods   Properties   See Also |

The  AnalyticalToPhysicalAssociationManager  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | AddAssociation | Adds a new association between an analytical element and a physical element. |
| Public method Static member | GetAnalyticalToPhysicalAssociationManager | Returns the AnalyticalToPhysicalAssociationManager for this document. |
| Public method | GetAssociatedElementId | Returns id of the element which is in association with the element with the given ElementId. |
| Public method | HasAssociation | Verifies if the element has already defined an association. |
| Public method | RemoveAssociation | This method will remove the association for the element with the given ElementId. |

# Properties

|  | Name | Description |
| --- | --- | --- |

# See Also

AnalyticalToPhysicalAssociationManager Class

Autodesk.Revit.DB.Structure Namespace