#### ITemporaryGraphicsHandler Members

---

|  |
| --- |
| ITemporaryGraphicsHandler Interface   Methods   See Also |

The  ITemporaryGraphicsHandler  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | OnClick | Handles mouse click event on a given temporary graphics object managed by  TemporaryGraphicsManager  . |

# See Also

ITemporaryGraphicsHandler Interface

Autodesk.Revit.UI Namespace