#### SelectionUIOptions Members

---

|  |
| --- |
| SelectionUIOptions Class   Methods   Properties   See Also |

The  SelectionUIOptions  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  SelectionUIOptions |
| Public method Static member | ElementSelectsAsPinned | Checks whether the specified element will be treated as pinned for the purposes of selection. |
| Public method Static member | GetSelectionUIOptions | Returns the current user's SelectionOptions. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | ActivateControlsAndDimensionsOnMultiSelect | Indicates whether controls and temporary dimensions are activated on selection of multiple elements. |
| Public property | DragOnSelection | Indicates whether elements can be dragged immediately when they are selected. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | SelectFaces | Indicates whether elements can be selected by clicking on the interior of a face. |
| Public property | SelectLinks | Indicates whether Revit and CAD link instances can be selected. |
| Public property | SelectPinned | Indicates whether pinned elements can be selected. |
| Public property | SelectUnderlay | Indicates whether elements that are displayed as underlay can be selected. |

# See Also

SelectionUIOptions Class

Autodesk.Revit.UI Namespace