#### DocumentSavedAsEventArgs Members

---

|  |
| --- |
| DocumentSavedAsEventArgs Class   Methods   Properties   See Also |

The  DocumentSavedAsEventArgs  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsSavingAsCentralFile | Indicates whether the document is to be saved as central file. |
| Public property | OriginalPath | Original path of the document. |

# See Also

DocumentSavedAsEventArgs Class

Autodesk.Revit.DB.Events Namespace