#### FlexPipe Members

---

|  |
| --- |
| FlexPipe Class   Methods   Properties   See Also |

The  FlexPipe  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create(Document, ElementId, ElementId, ElementId, IList XYZ ) | Creates a new flexible pipe into the document, using a point array and flex pipe type. |
| Public method Static member | Create(Document, ElementId, ElementId, ElementId, XYZ, XYZ, IList XYZ ) | Creates a new flexible pipe into the document, using a point array and flex pipe type. |
| Public method Static member | IsFlexPipeTypeId | Checks if given type is valid flexible pipe type. |
| Public method Static member | IsPipingSystemTypeId | Checks if given type is valid piping system type. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | EndTangent | Gets or sets the tangent vector at the end of the curve. The invalid or zero vector is ignored when setting the tangent. |
| Public property | FlexPipeType | The flex pipe type of this flex pipe. |
| Public property | FlowState | The flow state of the pipe. |
| Public property | Points | The points of the flex pipe. |
| Public property | StartTangent | Gets or sets the tangent vector at the start of the curve. The invalid or zero vector is ignored when setting the tangent. |

# See Also

FlexPipe Class

Autodesk.Revit.DB.Plumbing Namespace