#### DocumentReloadedLatestEventArgs Members

---

|  |
| --- |
| DocumentReloadedLatestEventArgs Class   Methods   Properties   See Also |

The  DocumentReloadedLatestEventArgs  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Location | Full path of the central model which is to be operated. |

# See Also

DocumentReloadedLatestEventArgs Class

Autodesk.Revit.DB.Events Namespace