#### EndTreatmentType Members

---

|  |
| --- |
| EndTreatmentType Class   Methods   Properties   See Also |

The  EndTreatmentType  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create(Document) | Creates a new EndTreatmentType in a document. |
| Public method Static member | Create(Document, String) | Creates a new EndTreatmentType in a document and adds the input string to the endTreatment parameter. |
| Public method Static member | CreateDefaultEndTreatmentType | Creates a new EndTreatmentType object with a default name. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | EndTreatment | String describing the end treatment |

# See Also

EndTreatmentType Class

Autodesk.Revit.DB.Structure Namespace