#### DocumentSavingAsEventArgs Members

---

|  |
| --- |
| DocumentSavingAsEventArgs Class   Methods   Properties   See Also |

The  DocumentSavingAsEventArgs  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsSavingAsCentralFile | Indicates whether the document is to be saved as central file. |
| Public property | PathName | Target path to which the document is to be saved. |

# See Also

DocumentSavingAsEventArgs Class

Autodesk.Revit.DB.Events Namespace