#### IOException Members

---

|  |
| --- |
| IOException Class   Methods   Properties   See Also |

The  IOException  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | GetObjectData | Retrieves data needed to serialize the target object. (Overrides  ApplicationException GetObjectData(SerializationInfo, StreamingContext)  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |

# See Also

IOException Class

Autodesk.Revit.Exceptions Namespace