#### MultiReferenceAnnotation Members

---

|  |
| --- |
| MultiReferenceAnnotation Class   Methods   Properties   See Also |

The  MultiReferenceAnnotation  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | AreElementsValidForMultiReferenceAnnotation | The method validates if the input elements match the element category id for the MultiReferenceAnnotationType. |
| Public method Static member | AreReferencesValidForLinearDimension | If the DimensionStyleType is Linear, validates that the references are valid for an aligned multi-reference annotation. |
| Public method Static member | AreReferencesValidForLinearFixedDimension | If the DimensionStyleType is LinearFixed, validates that the references are valid for an aligned multi-reference annotation. |
| Public method Static member | Create | Creates a new MultiReferenceAnnotation. |
| Public method Static member | Is3DViewValidForDimension | If the DimensionStyle is LinearFixed, it cannot be created in a 3D View. If the DimensionStyle is Linear, it cannot be created in a 3D View if the view direction is perpendicular to the current work plane normal. Returns true if the ownerViewId is not a 3D view. |
| Public method Static member | IsLinearFixedDimensionDirectionValid | If the DimensionStyleType is LinearFixed, this function verifies that the dimension line direction matches either the view's vertical or horizontal direction. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | DimensionId | The child dimension owned by this multi-reference annotation. |
| Public property | TagId | The child IndependentTag owned by this multi-reference annotation. |

# See Also

MultiReferenceAnnotation Class

Autodesk.Revit.DB Namespace