#### SteelElementProperties Members

---

|  |
| --- |
| SteelElementProperties Class   Methods   Properties   See Also |

The  SteelElementProperties  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | AddFabricationInformationForRevitElements | This method adds fabrication information to the given elements. |
| Public method Static member | GetFabricationUniqueID | This method will return the fabrication id for the given reference. |
| Public method Static member | GetReference | This method will return the reference for the given fabrication id. |
| Public method Static member | GetSteelElementProperties | Get SteelElementProperties for the input element if they exist. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | UniqueID | This method will return the fabrication id. This represents the link between the Revit and the Steel Core element. |

# See Also

SteelElementProperties Class

Autodesk.Revit.DB.Steel Namespace