#### DeleteElements Members

---

|  |
| --- |
| DeleteElements Class   Methods   Properties   See Also |

The  DeleteElements  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create(Document, ElementId) | Creates an instance of the DeleteElements resolution. |
| Public method Static member | Create(Document, IList ElementId ) | Creates an instance of the DeleteElements resolution. |
| Public method Static member | Create(Document, ISet ElementId ) | Creates an instance of the DeleteElements resolution. |

# Properties

|  | Name | Description |
| --- | --- | --- |

# See Also

DeleteElements Class

Autodesk.Revit.DB Namespace