#### PathReinforcement Members

---

|  |
| --- |
| PathReinforcement Class   Methods   Properties   See Also |

The  PathReinforcement  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | ConvertRebarInSystemToRebars | Converts all RebarInSystem elements owned by the input PathReinforcement to equivalent Rebar elements. |
| Public method Static member | Create(Document, Element, IList Curve , Boolean, ElementId, ElementId, ElementId, ElementId) | Creates a new PathReinforcement object from an array of curves. The newly created object will use a default Rebar Shape. |
| Public method Static member | Create(Document, Element, IList Curve , Boolean, ElementId, ElementId, ElementId, ElementId, ElementId) | Creates a new PathReinforcement object from an array of curves and given Rebar Shape id. |
| Public method | GetCurveElementIds | Retrieves the set of ElementIds of curves forming the boundary of the Path Reinforcement. |
| Public method | GetHostId | The element that contains the Path Reinforcement. |
| Public method Static member | GetOrCreateDefaultRebarShape | Creates a new RebarShape object with a default name or returns existing one which fulfills Path Reinforcement bending data requirements. |
| Public method | GetRebarInSystemIds | Returns the ids of the RebarInSystem elements owned by the PathReinforcement element. |
| Public method | IsAlternatingLayerEnabled | Checks if alternating bars are present in Path Reinforcement. |
| Public method | IsSolidInView | **Obsolete.**   Checks if this Path Reinforcement is shown solidly in a 3D view. |
| Public method | IsUnobscuredInView | Checks if Path Reinforcement is shown unobscured in a view. |
| Public method | IsValidAlternatingBarOrientation | Checks if orientation for alternating bars is valid. |
| Public method | IsValidPrimaryBarOrientation | Checks if orientation for primary bars is valid. |
| Public method Static member | IsValidRebarShapeId | Identifies whether an element id corresponds to a Rebar Shape element which can be used in Path Reinforcement. |
| Public method Static member | RemovePathReinforcementSystem | Deletes the specified PathReinforcement, and converts its RebarInSystem elements to equivalent Rebar elements. |
| Public method | SetSolidInView | **Obsolete.**   Sets this Path Reinforcement to be shown solidly in a 3D view. |
| Public method | SetUnobscuredInView | Sets Path Reinforcement to be shown unobscured in a view. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | AdditionalOffset | Additional offset of rebars in the Path Reinforcement. |
| Public property | AlternatingBarOrientation | Orientation of alternating bars of Path Reinforcement. |
| Public property | AlternatingBarShapeId | The RebarShape element that defines the shape of the alternating bars of the Path Reinforcement. |
| Public property | PathReinforcementType | Retrieves the type of the Path Reinforcement. |
| Public property | PrimaryBarOrientation | Orientation of primary bars of Path Reinforcement. |
| Public property | PrimaryBarShapeId | The RebarShape element that defines the shape of the primary bars of the Path Reinforcement. |

# See Also

PathReinforcement Class

Autodesk.Revit.DB.Structure Namespace