#### FabricArea Members

---

|  |
| --- |
| FabricArea Class   Methods   Properties   See Also |

The  FabricArea  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | CopyCurveLoopsInSketch | Creates copies of the CurveLoops in the FabricArea sketch. |
| Public method Static member | Create(Document, Element, XYZ, ElementId, ElementId) | Creates a FabricArea based on a host boundary. |
| Public method Static member | Create(Document, Element, IList CurveLoop , XYZ, XYZ, ElementId, ElementId) | Creates a FabricArea from an array of curves. |
| Public method | GetBoundaryCurveIds | Retrieves the identifiers of the set of curves forming the boundary of the Fabric Area. |
| Public method | GetFabricSheetElementIds | Retrieves the identifiers of all the FabricSheet Elements in the FabricArea. |
| Public method | GetReinforcementRoundingManager | Returns an object for managing reinforcement rounding override settings. |
| Public method | GetTotalSheetMass | Calculates the total sheet mass: Volume of Wire \* Unit Weight. |
| Public method | GetValidViewsForTags | Gets ids of the views where tags and symbols can be placed for the FabricArea and/or FabricSheets |
| Public method | IsCoverOffsetValid | Identifies if the specified value is valid for use as a cover offset. |
| Public method | IsValidMajorLapSplice | Identifies if the specified value is valid for use as a major lap splice. |
| Public method | IsValidMinorLapSplice | Identifies if the specified value is valid for use as a minor lap splice. |
| Public method Static member | RemoveFabricReinforcementSystem | Deletes the specified FabricArea, and converts its FabricSheet elements to equivalent Single Fabric Sheet elements. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | CoverOffset | The additional cover offset of the fabric distribution. |
| Public property | Direction | The Major Direction of the Fabric Area. |
| Public property | DirectionOrigin | The Origin Point of the Major Direction of the Fabric Area. |
| Public property | FabricAreaType | The type of the Fabric Area. |
| Public property | FabricLocation | The Fabric location in the host. |
| Public property | FabricSheetTypeId | The id of the Fabric Sheet Type for this element. |
| Public property | HostId | The id of the Host element for the fabric area. |
| Public property | LapSplicePosition | The fabric lap splice position in the fabric distribution. |
| Public property | MajorLapSpliceLength | The fabric lap splice length in the fabric distribution in the major direction. |
| Public property | MajorSheetAlignment | The fabric sheet alignment in the fabric distribution in the major direction. |
| Public property | MinorLapSpliceLength | The fabric lap splice length in the fabric distribution in the minor direction. |
| Public property | MinorSheetAlignment | The fabric sheet alignment in the fabric distribution in the minor direction. |
| Public property | SketchId | The id of the Sketch element for this element. |
| Public property | TagViewId | The element of the view in which to tag new members of this element. |

# See Also

FabricArea Class

Autodesk.Revit.DB.Structure Namespace