#### RebarShapeSegment Members

---

|  |
| --- |
| RebarShapeSegment Class   Methods   Properties   See Also |

The  RebarShapeSegment  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  RebarShapeSegment |
| Public method | GetConstraints | Retrieve the list of constraints associated with this segment. |
| Public method | SetConstraints | Assign a new list of constraints to this segment. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

RebarShapeSegment Class

Autodesk.Revit.DB.Structure Namespace