#### FaceNode Members

---

|  |
| --- |
| FaceNode Class   Methods   Properties   See Also |

The  FaceNode  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | GetFace | Returns the Face object corresponding to the node. |

# Properties

|  | Name | Description |
| --- | --- | --- |

# See Also

FaceNode Class

Autodesk.Revit.DB Namespace