#### Duct Members

---

|  |
| --- |
| Duct Class   Methods   Properties   See Also |

The  Duct  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create(Document, ElementId, ElementId, Connector, Connector) | Creates a new duct that connects to two connectors. |
| Public method Static member | Create(Document, ElementId, ElementId, Connector, XYZ) | Creates a new duct that connects to the connector. |
| Public method Static member | Create(Document, ElementId, ElementId, ElementId, XYZ, XYZ) | Creates a new duct from two points. |
| Public method Static member | CreatePlaceholder | Creates a new placeholder duct. |
| Public method Static member | IsDuctTypeId | Checks if given type is valid duct type. |
| Public method Static member | IsHvacSystemTypeId | Checks if given type is valid HVAC system type. |
| Public method | SetSystemType | Updates the associated system type for the duct. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | DuctType | The duct type of this duct. |
| Public property | IsPlaceholder | Identifies if the duct is a placeholder or not. |

# See Also

Duct Class

Autodesk.Revit.DB.Mechanical Namespace