#### ExportPDFSettings Members

---

|  |
| --- |
| ExportPDFSettings Class   Methods   Properties   See Also |

The  ExportPDFSettings  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create | Returns an new created ExportPDFSettings element in the document with specified settings. |
| Public method Static member | FindByName | Returns settings element by name. |
| Public method Static member | GetActivePredefinedSettings | Gets the active settings element in the document. |
| Public method | GetOptions | Gets a copy of options from settings for exporting. Modification on this options would not change the element. |
| Public method Static member | IsValidName | Returns result that the proposed name is valid and not exist in the specified document. |
| Public method Static member | ListNames | Returns all the names of the settings instances in the document. |
| Public method | SetOptions | Sets options for exporting. |

# Properties

|  | Name | Description |
| --- | --- | --- |

# See Also

ExportPDFSettings Class

Autodesk.Revit.DB Namespace