#### StructuralConnectionHandler Members

---

|  |
| --- |
| StructuralConnectionHandler Class   Methods   Properties   See Also |

The  StructuralConnectionHandler  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | AddElementIds | Adds element ids to the connection. All element ids in an array should be of applicable category. |
| Public method | AddReferences | Adds references to the connection. All references should be of applicable category. |
| Public method Static member | Create(Document, IList ElementId , ElementId) | Creates a new instance of a Structural Connection Handler, which defines the connection between given elements. |
| Public method Static member | Create(Document, IList ElementId , String) | Creates custom StructuralConnectionHandlerType and StructuralConnectionHandler. |
| Public method Static member | Create(Document, IList ElementId , ElementId, IList ConnectionInputPoint ) | Creates a new instance of a Structural Connection Handler, which is defined by the elements to connect and the additional points. |
| Public method Static member | CreateGenericConnection | Creates a new instance of a Structural Connection Handler with a generic type, which defines the connection between given elements. |
| Public method | GetConnectedElementIds | Retrieves list of element ids of connected elements. |
| Public method | GetInputPoint | Returns point with specified id. Returns null if specified point does not exist |
| Public method | GetInputPoints | Returns a list of additional points defining certain connections. |
| Public method | GetInputReferences | Gets references of input elements. |
| Public method | GetOrigin | Retrieves origin point of Structural Connection Handler element. |
| Public method | IsCustom | Checks if Structural Connection Handler has the custom connection style. |
| Public method | IsDetailed | Checks if Structural Connection Handler has the detailed connection style. |
| Public method | RemoveElementIds | Removes element ids from the connection. All element ids in an array should belong to the connection. |
| Public method | RemoveReferences | Removes references from the connection. All references in an array should belong to the connection. |
| Public method | SetDefaultElementOrder | Sorts the connected elements connection according to structural categories, element materials and geometries. The steel element is set rather than an element of other material. The priorities of the elements are set according structural categories in following order: columns, framings, walls, foundations, floors. In case of several Structural Framing elements order is determined by cutting - the cutting element is set as the primary one rather than element being cut. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | ApprovalTypeId | Retrieves or changes approval type of the Structural Connection Handler. |
| Public property | CodeCheckingStatus | Code checking status of the structural connection. |
| Public property | OverrideTypeParams | Allow or disallow connection's type parameters to be overridden. |
| Public property | SingleElementEndIndex | Element end index for single element connections (0: start, 1: end). |

# See Also

StructuralConnectionHandler Class

Autodesk.Revit.DB.Structure Namespace