#### RebarTrimExtendData Members

---

|  |
| --- |
| RebarTrimExtendData Class   Methods   Properties   See Also |

The  RebarTrimExtendData  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | AddBarGeometry(IList Curve ) | Adds a new rebar geometry. This information is set to the rebar after the API execution is finished successfully. |
| Public method | AddBarGeometry(CurveLoop) | Adds a new rebar geometry. This information is set to the rebar after the API execution is finished successfully. |
| Public method | CanAddBarGeometry | Returns true if getNumberOfBarGeometry() is less than GetNumberOfBars(), false otherwise. |
| Public method | ClearAllAddedBarGeometry | This function will remove all bars geometry that were added by calling AddBarGeometry(). |
| Public method | CreateEndConstraint | Creates a constraint for the end handle of the rebar. This constraint will be set preferred after the API execution is finished successfully. |
| Public method | CreateStartConstraint | Creates a constraint for the start handle of the rebar. This constraint will be set preferred after the API execution is finished successfully. |
| Public method | Dispose | Releases all resources used by the  RebarTrimExtendData |
| Public method | GetAddedBarGeometry | Gets the added curves that will represent the bar at index barIndex. |
| Public method | GetNumberOfBarGeometry | Gets the number of Bar Geometry that were added. |
| Public method | GetRebarUpdateCurvesData | Gets a class that contains information used as input and output for rebar free form calculation. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

RebarTrimExtendData Class

Autodesk.Revit.DB.Structure Namespace