#### ZoneEquipment Members

---

|  |
| --- |
| ZoneEquipment Class   Methods   Properties   See Also |

The  ZoneEquipment  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create(Document, String) | Creates a new zone equipment |
| Public method Static member | Create(Document, AnalyticalSystemDomain, String) | **Obsolete.**   Creates a new zone equipment |
| Public method Static member | GetAssociatedZoneEquipment(Document, ElementId) | Gets the associated zone equipment of the specified analytical space. |
| Public method Static member | GetAssociatedZoneEquipment(Document, ISet ElementId ) | Gets the associated zone equipment of all specified analytical spaces. |
| Public method | GetZoneEquipmentData | Gets the zone equipment data. |
| Public method Static member | MoveSpaceToEquipment | Moves the selected analytical spaces from the identified zone equipment to another target zone equipment. |

# Properties

|  | Name | Description |
| --- | --- | --- |

# See Also

ZoneEquipment Class

Autodesk.Revit.DB.Mechanical Namespace