#### PathReinforcementType Members

---

|  |
| --- |
| PathReinforcementType Class   Methods   Properties   See Also |

The  PathReinforcementType  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | CreateDefaultPathReinforcementType | Creates a new PathReinforcementType object with a default name. |

# Properties

|  | Name | Description |
| --- | --- | --- |

# See Also

PathReinforcementType Class

Autodesk.Revit.DB.Structure Namespace