#### ExternallyTaggedBRep Members

---

|  |
| --- |
| ExternallyTaggedBRep Class   Methods   Properties   See Also |

The  ExternallyTaggedBRep  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | GetTaggedGeometry | Returns the externally tagged geometry object. |

# Properties

|  | Name | Description |
| --- | --- | --- |

# See Also

ExternallyTaggedBRep Class

Autodesk.Revit.DB Namespace