#### Ceiling Members

---

|  |
| --- |
| Ceiling Class   Methods   Properties   See Also |

The  Ceiling  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create(Document, IList CurveLoop , ElementId, ElementId) | Creates a new instance of ceiling within the project. |
| Public method Static member | Create(Document, IList CurveLoop , ElementId, ElementId, Line, Double) | Creates a new instance of ceiling within the project. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | SketchId | Returns id of the sketch. |

# See Also

Ceiling Class

Autodesk.Revit.DB Namespace