#### AnalyticalPowerSourceData Members

---

|  |
| --- |
| AnalyticalPowerSourceData Class   Methods   Properties   See Also |

The  AnalyticalPowerSourceData  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | TotalConnectedCurrent | The total connected current of the analytical power source. |
| Public property | Voltage | The voltage value of the analytical power source. |

# See Also

AnalyticalPowerSourceData Class

Autodesk.Revit.DB.Electrical Namespace