#### StructuralSectionColdFormed Members

---

|  |
| --- |
| StructuralSectionColdFormed Class   Methods   Properties   See Also |

The  StructuralSectionColdFormed  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | InnerFillet | Inner Fillet - Corner fillet inner radius. |
| Public property | WallDesignThickness | Represents wall design thickness of rectangle. |
| Public property | WallNominalThickness | Represents wall nominal thickness of rectangle. |

# See Also

StructuralSectionColdFormed Class

Autodesk.Revit.DB.Structure.StructuralSections Namespace