#### LineLoad Members

---

|  |
| --- |
| LineLoad Class   Methods   Properties   See Also |

The  LineLoad  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create(Document, ElementId, XYZ, XYZ, LineLoadType) | Creates a new hosted line load within the project. |
| Public method Static member | Create(Document, ElementId, Int32, XYZ, XYZ, LineLoadType) | Creates a new hosted line load within the project. |
| Public method Static member | Create(Document, XYZ, XYZ, XYZ, XYZ, LineLoadType, SketchPlane) | Creates a new non-hosted line load within the project using data at point. |
| Public method | GetCurve | Returns curve that define geometry of the line load. |
| Public method Static member | IsValidHostId | Indicates if the provided host id can host line loads The document containing both the host and the load The id of the analytical panel that is about to host a line load True if a line load can be placed on the input host id |
| Public method | SetPoints | Sets start and end point of the line load. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | EndPoint | Returns the three dimensional location of the end point for the line load. |
| Public property | ForceVector1 | The force vector applied to the start point of the line load, oriented according to OrientTo setting. |
| Public property | ForceVector2 | The force vector applied to the end point of the line load, oriented according to OrientTo setting. |
| Public property | IsProjected | Indicates if the load is projected. |
| Public property | IsUniform | Indicates if the load is uniform. |
| Public property | MomentVector1 | The moment vector applied to the start point of the line load, oriented according to OrientTo setting. |
| Public property | MomentVector2 | The moment vector applied to the end point of the line load, oriented according to OrientTo setting. |
| Public property | StartPoint | Returns the three dimensional location of the start point for the line load. |

# See Also

LineLoad Class

Autodesk.Revit.DB.Structure Namespace